#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BackButton.BackButton_C.ExecuteUbergraph_BackButton
// 0x0058 (0x0058 - 0x0000)
struct BackButton_C_ExecuteUbergraph_BackButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
static_assert(alignof(BackButton_C_ExecuteUbergraph_BackButton) == 0x000008, "Wrong alignment on BackButton_C_ExecuteUbergraph_BackButton");
static_assert(sizeof(BackButton_C_ExecuteUbergraph_BackButton) == 0x000058, "Wrong size on BackButton_C_ExecuteUbergraph_BackButton");
static_assert(offsetof(BackButton_C_ExecuteUbergraph_BackButton, EntryPoint) == 0x000000, "Member 'BackButton_C_ExecuteUbergraph_BackButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackButton_C_ExecuteUbergraph_BackButton, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'BackButton_C_ExecuteUbergraph_BackButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BackButton_C_ExecuteUbergraph_BackButton, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'BackButton_C_ExecuteUbergraph_BackButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

