#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bjarne_Customization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Bjarne_Customization.BP_Bjarne_Customization_C.ExecuteUbergraph_BP_Bjarne_Customization
// 0x01E0 (0x01E0 - 0x0000)
struct BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkinPreviewActor_C*                    K2Node_DynamicCast_AsSkin_Preview_Actor;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0xE];                                       // 0x0022(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_InvertTransform_ReturnValue;              // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class ACharSelectionPreviewActor_C*           K2Node_DynamicCast_AsChar_Selection_Preview_Actor; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_2;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharSelectionPreviewActor_C*           K2Node_DynamicCast_AsChar_Selection_Preview_Actor_1; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization) == 0x000010, "Wrong alignment on BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization");
static_assert(sizeof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization) == 0x0001E0, "Wrong size on BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, EntryPoint) == 0x000000, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_AsSkin_Preview_Actor) == 0x000018, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_AsSkin_Preview_Actor' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_Less_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_InvertTransform_ReturnValue) == 0x000070, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_InvertTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_SelectFloat_ReturnValue) == 0x0000A4, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_FInterpTo_ReturnValue) == 0x0000A8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BooleanAND_ReturnValue) == 0x0000AC, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetOwningActor_ReturnValue_1) == 0x0000B0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_AsChar_Selection_Preview_Actor) == 0x0000C8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_AsChar_Selection_Preview_Actor' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetOwningActor_ReturnValue_2) == 0x0000D8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetOwningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_AsChar_Selection_Preview_Actor_1) == 0x0000E0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_AsChar_Selection_Preview_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000EC, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x0000FC, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000100, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000108, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GetCameraLocation_ReturnValue) == 0x000110, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_MakeRotator_ReturnValue) == 0x00011C, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_ComposeTransforms_ReturnValue) == 0x000160, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakTransform_Location) == 0x000190, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakTransform_Rotation) == 0x00019C, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakTransform_Scale) == 0x0001A8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001B4, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_MakeRotFromX_ReturnValue) == 0x0001C0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakRotator_Roll) == 0x0001CC, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakRotator_Pitch) == 0x0001D0, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_BreakRotator_Yaw) == 0x0001D4, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001D8, "Member 'BP_Bjarne_Customization_C_ExecuteUbergraph_BP_Bjarne_Customization::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Bjarne_Customization.BP_Bjarne_Customization_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_Bjarne_Customization_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Bjarne_Customization_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_Bjarne_Customization_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_Bjarne_Customization_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_Bjarne_Customization_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_Bjarne_Customization_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_Bjarne_Customization_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_Bjarne_Customization.BP_Bjarne_Customization_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_Bjarne_Customization_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Bjarne_Customization_C_AnimGraph) == 0x000008, "Wrong alignment on BP_Bjarne_Customization_C_AnimGraph");
static_assert(sizeof(BP_Bjarne_Customization_C_AnimGraph) == 0x000010, "Wrong size on BP_Bjarne_Customization_C_AnimGraph");
static_assert(offsetof(BP_Bjarne_Customization_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_Bjarne_Customization_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

