#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bjarne_Customization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Bjarne_Customization.BP_Bjarne_Customization_C
// 0x0710 (0x0980 - 0x0270)
class UBP_Bjarne_Customization_C : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4D06068E49884151D87C96A4AE7F4C65; // 0x0278(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ED2CEA104C6E7DCB393BF2970E34927F; // 0x02A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E7AEB21F4CEA10D92114E3B7C30C4081; // 0x02D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D4100D1A4F46F4917BCA3C8346E59BF4; // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C84A465542C9199EBF8A57A022AE631C; // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31A3D4EE4DC976CCD8377BBC6C4D0359; // 0x0348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B36ADBC446C4E4EA65267185B454DA7C; // 0x0370(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6013CF314685A02227F1478CF42900DE; // 0x0398(0x0188)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BFBD9F0149688EE3D85403AF3BE94E91; // 0x0520(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6058C2C0451CDB16FC07FBA7C3337D51; // 0x0598(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DD7C7EE64EF23480AD3631AE77DC8009; // 0x05C8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38FF79E3499E9F6B17CF5DBBDDD74294; // 0x0640(0x0030)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5FB74131432EBD5D2E1992A5D323544F; // 0x0670(0x0188)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A19C241D462C84B3C7B5F08779E1D08A; // 0x07F8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B79FFAC74E5B8D376AF6BAB6E228492A; // 0x0870(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FA91CE2D4130E792DB2ED7984B7A4907; // 0x08A0(0x00B0)()
	struct FVector                                CameraWorldLocation;                               // 0x0950(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleOfView;                                       // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxViewRange;                                      // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinViewRange;                                      // 0x0964(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleOfViewAlpha;                                  // 0x0968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutOfViewRangeInterSpeed;                          // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngleOfViewOffset;                                 // 0x0970(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldStartOnIntroAnimation;                      // 0x0974(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldSwitchToIntroAnimation;                     // 0x0975(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasSwitchedToIntroAnimationOnce;                  // 0x0976(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCanSetStartAnimation;                             // 0x0977(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Bjarne_Customization(int32 EntryPoint);
	void AnimNotify_OnLeaveIdle();
	void BlueprintInitializeAnimation();
	void On_Select_Character();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Bjarne_Customization_AnimGraphNode_TransitionResult_C84A465542C9199EBF8A57A022AE631C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Bjarne_Customization_AnimGraphNode_TransitionResult_D4100D1A4F46F4917BCA3C8346E59BF4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bjarne_Customization_C">();
	}
	static class UBP_Bjarne_Customization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Bjarne_Customization_C>();
	}
};
static_assert(alignof(UBP_Bjarne_Customization_C) == 0x000010, "Wrong alignment on UBP_Bjarne_Customization_C");
static_assert(sizeof(UBP_Bjarne_Customization_C) == 0x000980, "Wrong size on UBP_Bjarne_Customization_C");
static_assert(offsetof(UBP_Bjarne_Customization_C, UberGraphFrame) == 0x000270, "Member 'UBP_Bjarne_Customization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_Root_4D06068E49884151D87C96A4AE7F4C65) == 0x000278, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_Root_4D06068E49884151D87C96A4AE7F4C65' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_ED2CEA104C6E7DCB393BF2970E34927F) == 0x0002A8, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_ED2CEA104C6E7DCB393BF2970E34927F' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_E7AEB21F4CEA10D92114E3B7C30C4081) == 0x0002D0, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_E7AEB21F4CEA10D92114E3B7C30C4081' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_D4100D1A4F46F4917BCA3C8346E59BF4) == 0x0002F8, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_D4100D1A4F46F4917BCA3C8346E59BF4' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_C84A465542C9199EBF8A57A022AE631C) == 0x000320, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_C84A465542C9199EBF8A57A022AE631C' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_31A3D4EE4DC976CCD8377BBC6C4D0359) == 0x000348, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_31A3D4EE4DC976CCD8377BBC6C4D0359' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_TransitionResult_B36ADBC446C4E4EA65267185B454DA7C) == 0x000370, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_TransitionResult_B36ADBC446C4E4EA65267185B454DA7C' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_RotationOffsetBlendSpace_6013CF314685A02227F1478CF42900DE) == 0x000398, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_RotationOffsetBlendSpace_6013CF314685A02227F1478CF42900DE' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_SequencePlayer_BFBD9F0149688EE3D85403AF3BE94E91) == 0x000520, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_SequencePlayer_BFBD9F0149688EE3D85403AF3BE94E91' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_StateResult_6058C2C0451CDB16FC07FBA7C3337D51) == 0x000598, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_StateResult_6058C2C0451CDB16FC07FBA7C3337D51' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_SequencePlayer_DD7C7EE64EF23480AD3631AE77DC8009) == 0x0005C8, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_SequencePlayer_DD7C7EE64EF23480AD3631AE77DC8009' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_StateResult_38FF79E3499E9F6B17CF5DBBDDD74294) == 0x000640, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_StateResult_38FF79E3499E9F6B17CF5DBBDDD74294' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_RotationOffsetBlendSpace_5FB74131432EBD5D2E1992A5D323544F) == 0x000670, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_RotationOffsetBlendSpace_5FB74131432EBD5D2E1992A5D323544F' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_SequencePlayer_A19C241D462C84B3C7B5F08779E1D08A) == 0x0007F8, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_SequencePlayer_A19C241D462C84B3C7B5F08779E1D08A' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_StateResult_B79FFAC74E5B8D376AF6BAB6E228492A) == 0x000870, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_StateResult_B79FFAC74E5B8D376AF6BAB6E228492A' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AnimGraphNode_StateMachine_FA91CE2D4130E792DB2ED7984B7A4907) == 0x0008A0, "Member 'UBP_Bjarne_Customization_C::AnimGraphNode_StateMachine_FA91CE2D4130E792DB2ED7984B7A4907' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, CameraWorldLocation) == 0x000950, "Member 'UBP_Bjarne_Customization_C::CameraWorldLocation' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AngleOfView) == 0x00095C, "Member 'UBP_Bjarne_Customization_C::AngleOfView' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, MaxViewRange) == 0x000960, "Member 'UBP_Bjarne_Customization_C::MaxViewRange' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, MinViewRange) == 0x000964, "Member 'UBP_Bjarne_Customization_C::MinViewRange' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AngleOfViewAlpha) == 0x000968, "Member 'UBP_Bjarne_Customization_C::AngleOfViewAlpha' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, OutOfViewRangeInterSpeed) == 0x00096C, "Member 'UBP_Bjarne_Customization_C::OutOfViewRangeInterSpeed' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, AngleOfViewOffset) == 0x000970, "Member 'UBP_Bjarne_Customization_C::AngleOfViewOffset' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, bShouldStartOnIntroAnimation) == 0x000974, "Member 'UBP_Bjarne_Customization_C::bShouldStartOnIntroAnimation' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, bShouldSwitchToIntroAnimation) == 0x000975, "Member 'UBP_Bjarne_Customization_C::bShouldSwitchToIntroAnimation' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, bHasSwitchedToIntroAnimationOnce) == 0x000976, "Member 'UBP_Bjarne_Customization_C::bHasSwitchedToIntroAnimationOnce' has a wrong offset!");
static_assert(offsetof(UBP_Bjarne_Customization_C, bCanSetStartAnimation) == 0x000977, "Member 'UBP_Bjarne_Customization_C::bCanSetStartAnimation' has a wrong offset!");

}

