#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HealthKitPickup

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.ExecuteUbergraph_BP_HealthKitPickup
// 0x00F8 (0x00F8 - 0x0000)
struct BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LifeCylcle;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_NewState;                             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup) == 0x000008, "Wrong alignment on BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup");
static_assert(sizeof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup) == 0x0000F8, "Wrong size on BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, EntryPoint) == 0x000000, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, K2Node_Event_LifeCylcle) == 0x000004, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::K2Node_Event_LifeCylcle' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00003C, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_GetUpVector_ReturnValue) == 0x000048, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_MakeRotFromZX_ReturnValue) == 0x000054, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_GetFloatValue_ReturnValue) == 0x000060, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000064, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, K2Node_Event_NewState) == 0x0000EC, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000F0, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F4, "Member 'BP_HealthKitPickup_C_ExecuteUbergraph_BP_HealthKitPickup::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.ParticleTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HealthKitPickup_C_ParticleTick final
{
public:
	float                                         LifeCylcle;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealthKitPickup_C_ParticleTick) == 0x000004, "Wrong alignment on BP_HealthKitPickup_C_ParticleTick");
static_assert(sizeof(BP_HealthKitPickup_C_ParticleTick) == 0x000004, "Wrong size on BP_HealthKitPickup_C_ParticleTick");
static_assert(offsetof(BP_HealthKitPickup_C_ParticleTick, LifeCylcle) == 0x000000, "Member 'BP_HealthKitPickup_C_ParticleTick::LifeCylcle' has a wrong offset!");

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.OnParticleEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_HealthKitPickup_C_OnParticleEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HealthKitPickup_C_OnParticleEnabled) == 0x000001, "Wrong alignment on BP_HealthKitPickup_C_OnParticleEnabled");
static_assert(sizeof(BP_HealthKitPickup_C_OnParticleEnabled) == 0x000001, "Wrong size on BP_HealthKitPickup_C_OnParticleEnabled");
static_assert(offsetof(BP_HealthKitPickup_C_OnParticleEnabled, NewState) == 0x000000, "Member 'BP_HealthKitPickup_C_OnParticleEnabled::NewState' has a wrong offset!");

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HealthKitPickup_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealthKitPickup_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HealthKitPickup_C_ReceiveTick");
static_assert(sizeof(BP_HealthKitPickup_C_ReceiveTick) == 0x000004, "Wrong size on BP_HealthKitPickup_C_ReceiveTick");
static_assert(offsetof(BP_HealthKitPickup_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HealthKitPickup_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_HealthKitPickup_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealthKitPickup_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_HealthKitPickup_C_UserConstructionScript");
static_assert(sizeof(BP_HealthKitPickup_C_UserConstructionScript) == 0x000010, "Wrong size on BP_HealthKitPickup_C_UserConstructionScript");
static_assert(offsetof(BP_HealthKitPickup_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_HealthKitPickup_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_HealthKitPickup_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function BP_HealthKitPickup.BP_HealthKitPickup_C.TimeUpdate
// 0x001C (0x001C - 0x0000)
struct BP_HealthKitPickup_C_TimeUpdate final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealthKitPickup_C_TimeUpdate) == 0x000004, "Wrong alignment on BP_HealthKitPickup_C_TimeUpdate");
static_assert(sizeof(BP_HealthKitPickup_C_TimeUpdate) == 0x00001C, "Wrong size on BP_HealthKitPickup_C_TimeUpdate");
static_assert(offsetof(BP_HealthKitPickup_C_TimeUpdate, Time) == 0x000000, "Member 'BP_HealthKitPickup_C_TimeUpdate::Time' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_TimeUpdate, CallFunc_VLerp_ReturnValue) == 0x000004, "Member 'BP_HealthKitPickup_C_TimeUpdate::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealthKitPickup_C_TimeUpdate, CallFunc_VLerp_ReturnValue_1) == 0x000010, "Member 'BP_HealthKitPickup_C_TimeUpdate::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");

}

