#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Impact_Laser_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Impact_Laser_Base.BP_Impact_Laser_Base_C.ExecuteUbergraph_BP_Impact_Laser_Base
// 0x0004 (0x0004 - 0x0000)
struct BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base) == 0x000004, "Wrong alignment on BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base");
static_assert(sizeof(BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base) == 0x000004, "Wrong size on BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base");
static_assert(offsetof(BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base, EntryPoint) == 0x000000, "Member 'BP_Impact_Laser_Base_C_ExecuteUbergraph_BP_Impact_Laser_Base::EntryPoint' has a wrong offset!");

// Function BP_Impact_Laser_Base.BP_Impact_Laser_Base_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Impact_Laser_Base_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Impact_Laser_Base_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Impact_Laser_Base_C_UserConstructionScript");
static_assert(sizeof(BP_Impact_Laser_Base_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Impact_Laser_Base_C_UserConstructionScript");
static_assert(offsetof(BP_Impact_Laser_Base_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_Impact_Laser_Base_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Impact_Laser_Base_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Impact_Laser_Base_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

