#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_impact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_impact.BP_impact_C.ExecuteUbergraph_BP_impact
// 0x0040 (0x0040 - 0x0000)
struct BP_impact_C_ExecuteUbergraph_BP_impact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetLoopLength_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentRelativeTime_ReturnValue;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_impact_C_ExecuteUbergraph_BP_impact) == 0x000008, "Wrong alignment on BP_impact_C_ExecuteUbergraph_BP_impact");
static_assert(sizeof(BP_impact_C_ExecuteUbergraph_BP_impact) == 0x000040, "Wrong size on BP_impact_C_ExecuteUbergraph_BP_impact");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, EntryPoint) == 0x000000, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000020, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_GetLoopLength_ReturnValue) == 0x00002C, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_GetLoopLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_GetCurrentRelativeTime_ReturnValue) == 0x000030, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_GetCurrentRelativeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_ExecuteUbergraph_BP_impact, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_impact_C_ExecuteUbergraph_BP_impact::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_impact.BP_impact_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_impact_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_impact_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_impact_C_ReceiveTick");
static_assert(sizeof(BP_impact_C_ReceiveTick) == 0x000004, "Wrong size on BP_impact_C_ReceiveTick");
static_assert(offsetof(BP_impact_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_impact_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_impact.BP_impact_C.RandomizeOrientationAndScale
// 0x00B0 (0x00B0 - 0x0000)
struct BP_impact_C_RandomizeOrientationAndScale final
{
public:
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_impact_C_RandomizeOrientationAndScale) == 0x000004, "Wrong alignment on BP_impact_C_RandomizeOrientationAndScale");
static_assert(sizeof(BP_impact_C_RandomizeOrientationAndScale) == 0x0000B0, "Wrong size on BP_impact_C_RandomizeOrientationAndScale");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_RandomFloat_ReturnValue) == 0x000000, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_RandomFloat_ReturnValue_1) == 0x000004, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_RandomizeOrientationAndScale, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000028, "Member 'BP_impact_C_RandomizeOrientationAndScale::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_impact.BP_impact_C.EventOnDestroy
// 0x0020 (0x0020 - 0x0000)
struct BP_impact_C_EventOnDestroy final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLifeSpan_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_impact_C_EventOnDestroy) == 0x000008, "Wrong alignment on BP_impact_C_EventOnDestroy");
static_assert(sizeof(BP_impact_C_EventOnDestroy) == 0x000020, "Wrong size on BP_impact_C_EventOnDestroy");
static_assert(offsetof(BP_impact_C_EventOnDestroy, Actor) == 0x000000, "Member 'BP_impact_C_EventOnDestroy::Actor' has a wrong offset!");
static_assert(offsetof(BP_impact_C_EventOnDestroy, CallFunc_GetLifeSpan_ReturnValue) == 0x000008, "Member 'BP_impact_C_EventOnDestroy::CallFunc_GetLifeSpan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_impact_C_EventOnDestroy, CallFunc_Conv_FloatToString_ReturnValue) == 0x000010, "Member 'BP_impact_C_EventOnDestroy::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");

}

