#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Jackie_Customization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Jackie_Customization.BP_Jackie_Customization_C
// 0x0DD0 (0x1040 - 0x0270)
class UBP_Jackie_Customization_C : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3741C5F1416A82AB0F6ABFABDBDAFFC2; // 0x0278(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BAF583E94098CEAC73F36898A3EA694E; // 0x02A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FCD6F782476CA28FBA1CCEA7A444C57D; // 0x02D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1DF3CEE24EDC952CED7AC1915B27B646; // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3E126FCA4C8B7D5BFB3F36BEA769EE7C; // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8D276C67477747439D8B869C3A466EF8; // 0x0348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78B648C540351FCAA6A95C83EF8E866E; // 0x0370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6ECBDA284C8478831868EF8A62E198D3; // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61A2186E4D9BBF67AC30D4A3748A10C1; // 0x03C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EF8F908D4EFBAE224A31CE8DE2EB7DBD; // 0x03E8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34AE5F7A43DE1C3E2B079FA386658BE8; // 0x0410(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CF535C8D49467E41A539499AD6968C93; // 0x0488(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D538511F40A09A78E3CEE99298E048B0; // 0x04B8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_04CE1B8045CA2BCE50BD50BF92B0050D; // 0x0530(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70BEAE49442F34DB25BA0E93EF33D541; // 0x0560(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_604E08B94E6190A4083280845C9C3A11; // 0x05D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_98CD9A0848EFB55185DFF4B792B6C856; // 0x0608(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8DD71BC34B8AE474444BDDAEB4B8B10C; // 0x06B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C52BE90141D9F5AE878525A0A4EB762D; // 0x06E8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1A6D008646A8B1C626ED92A470530E2E; // 0x0710(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3C87EF9E445F2B6DF171D2949BE91F2C; // 0x0788(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9CDF4B524326E1479CC02296A9F16CFD; // 0x07B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72A957E1491ED827CA46D69EB001324B; // 0x07E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2E1707B9430BA09F6D4D898C480F8D23; // 0x0808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9BC65DA4447C86DCEFB74391826780CC; // 0x0830(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A88310FF4F68FE1E6AB55F9F4F6E4188; // 0x0858(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3B1E3533429584D3DE7099A8736B34D2; // 0x08D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68EA7E23482ED9DB4209AE9B7D4A5E0F; // 0x0900(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_182E00014CAB6CFCD79520A3CAFCF35A; // 0x0978(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E91823CE467B4FC2210932BB77564DA3; // 0x09A8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B7AB04084E09A41003A6D18208192D35; // 0x0A20(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8C009DBE4AF42D944C3901A1F9FA4788; // 0x0A50(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D35601AA4C3CA3475A5A428C4193F722; // 0x0B00(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9795F7EF474B334625B64E9CA217E82A; // 0x0B30(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E97CB5514C7505F8E51BF7A9F47A2B98; // 0x0BE0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_40215224452645B2184592A9A0876569; // 0x0C28(0x0020)()
	uint8                                         Pad_C48[0x8];                                      // 0x0C48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_8CB70C6F4A8A979A3CA168B9B5C79CE2; // 0x0C50(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4A6168B5423F378E0BA8448283980D84; // 0x0E00(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2B98311C4D7BEE9A3BA178B18A568719; // 0x0FB0(0x0020)()
	float                                         AngleOfView;                                       // 0x0FD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraWorldLocation;                               // 0x0FD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                REyeOffset;                                        // 0x0FE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LEyeOffset;                                        // 0x0FEC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinViewRange;                                      // 0x0FF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxViewRange;                                      // 0x0FFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyesLookAtAlpha;                                   // 0x1000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isLeftSide;                                        // 0x1004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isRightSide;                                       // 0x1005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1006[0x2];                                     // 0x1006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RightSideAngle;                                    // 0x1008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftSideAngle;                                     // 0x100C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                REyeTarget;                                        // 0x1010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LEyeTarget;                                        // 0x101C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookAtDuringIntro;                                 // 0x1028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1029[0x7];                                     // 0x1029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      BlinkAnimation;                                    // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldStartOnIntroAnimation;                      // 0x1038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldSwitchToIntroAnimation;                     // 0x1039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasSwitchedToIntroAnimationOnce;                  // 0x103A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCanSetStartAnimation;                             // 0x103B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Jackie_Customization(int32 EntryPoint);
	void AnimNotify_IsBlinking();
	void AnimNotify_OnLeaveIdle();
	void BlueprintInitializeAnimation();
	void On_Select_Character();
	void AnimNotify_LookAtCamera();
	void AnimNotify_Blink();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Jackie_Customization_AnimGraphNode_TransitionResult_1DF3CEE24EDC952CED7AC1915B27B646();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Jackie_Customization_AnimGraphNode_TransitionResult_3E126FCA4C8B7D5BFB3F36BEA769EE7C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Jackie_Customization_C">();
	}
	static class UBP_Jackie_Customization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Jackie_Customization_C>();
	}
};
static_assert(alignof(UBP_Jackie_Customization_C) == 0x000010, "Wrong alignment on UBP_Jackie_Customization_C");
static_assert(sizeof(UBP_Jackie_Customization_C) == 0x001040, "Wrong size on UBP_Jackie_Customization_C");
static_assert(offsetof(UBP_Jackie_Customization_C, UberGraphFrame) == 0x000270, "Member 'UBP_Jackie_Customization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_Root_3741C5F1416A82AB0F6ABFABDBDAFFC2) == 0x000278, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_Root_3741C5F1416A82AB0F6ABFABDBDAFFC2' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_BAF583E94098CEAC73F36898A3EA694E) == 0x0002A8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_BAF583E94098CEAC73F36898A3EA694E' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_FCD6F782476CA28FBA1CCEA7A444C57D) == 0x0002D0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_FCD6F782476CA28FBA1CCEA7A444C57D' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_1DF3CEE24EDC952CED7AC1915B27B646) == 0x0002F8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_1DF3CEE24EDC952CED7AC1915B27B646' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_3E126FCA4C8B7D5BFB3F36BEA769EE7C) == 0x000320, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_3E126FCA4C8B7D5BFB3F36BEA769EE7C' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_8D276C67477747439D8B869C3A466EF8) == 0x000348, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_8D276C67477747439D8B869C3A466EF8' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_78B648C540351FCAA6A95C83EF8E866E) == 0x000370, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_78B648C540351FCAA6A95C83EF8E866E' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_6ECBDA284C8478831868EF8A62E198D3) == 0x000398, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_6ECBDA284C8478831868EF8A62E198D3' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_61A2186E4D9BBF67AC30D4A3748A10C1) == 0x0003C0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_61A2186E4D9BBF67AC30D4A3748A10C1' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_EF8F908D4EFBAE224A31CE8DE2EB7DBD) == 0x0003E8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_EF8F908D4EFBAE224A31CE8DE2EB7DBD' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_34AE5F7A43DE1C3E2B079FA386658BE8) == 0x000410, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_34AE5F7A43DE1C3E2B079FA386658BE8' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_CF535C8D49467E41A539499AD6968C93) == 0x000488, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_CF535C8D49467E41A539499AD6968C93' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_D538511F40A09A78E3CEE99298E048B0) == 0x0004B8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_D538511F40A09A78E3CEE99298E048B0' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_04CE1B8045CA2BCE50BD50BF92B0050D) == 0x000530, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_04CE1B8045CA2BCE50BD50BF92B0050D' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_70BEAE49442F34DB25BA0E93EF33D541) == 0x000560, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_70BEAE49442F34DB25BA0E93EF33D541' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_604E08B94E6190A4083280845C9C3A11) == 0x0005D8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_604E08B94E6190A4083280845C9C3A11' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateMachine_98CD9A0848EFB55185DFF4B792B6C856) == 0x000608, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateMachine_98CD9A0848EFB55185DFF4B792B6C856' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_8DD71BC34B8AE474444BDDAEB4B8B10C) == 0x0006B8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_8DD71BC34B8AE474444BDDAEB4B8B10C' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_C52BE90141D9F5AE878525A0A4EB762D) == 0x0006E8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_C52BE90141D9F5AE878525A0A4EB762D' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_1A6D008646A8B1C626ED92A470530E2E) == 0x000710, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_1A6D008646A8B1C626ED92A470530E2E' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_3C87EF9E445F2B6DF171D2949BE91F2C) == 0x000788, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_3C87EF9E445F2B6DF171D2949BE91F2C' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_9CDF4B524326E1479CC02296A9F16CFD) == 0x0007B8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_9CDF4B524326E1479CC02296A9F16CFD' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_72A957E1491ED827CA46D69EB001324B) == 0x0007E0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_72A957E1491ED827CA46D69EB001324B' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_2E1707B9430BA09F6D4D898C480F8D23) == 0x000808, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_2E1707B9430BA09F6D4D898C480F8D23' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_TransitionResult_9BC65DA4447C86DCEFB74391826780CC) == 0x000830, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_TransitionResult_9BC65DA4447C86DCEFB74391826780CC' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_A88310FF4F68FE1E6AB55F9F4F6E4188) == 0x000858, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_A88310FF4F68FE1E6AB55F9F4F6E4188' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_3B1E3533429584D3DE7099A8736B34D2) == 0x0008D0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_3B1E3533429584D3DE7099A8736B34D2' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_68EA7E23482ED9DB4209AE9B7D4A5E0F) == 0x000900, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_68EA7E23482ED9DB4209AE9B7D4A5E0F' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_182E00014CAB6CFCD79520A3CAFCF35A) == 0x000978, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_182E00014CAB6CFCD79520A3CAFCF35A' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_SequencePlayer_E91823CE467B4FC2210932BB77564DA3) == 0x0009A8, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_SequencePlayer_E91823CE467B4FC2210932BB77564DA3' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_B7AB04084E09A41003A6D18208192D35) == 0x000A20, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_B7AB04084E09A41003A6D18208192D35' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateMachine_8C009DBE4AF42D944C3901A1F9FA4788) == 0x000A50, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateMachine_8C009DBE4AF42D944C3901A1F9FA4788' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateResult_D35601AA4C3CA3475A5A428C4193F722) == 0x000B00, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateResult_D35601AA4C3CA3475A5A428C4193F722' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_StateMachine_9795F7EF474B334625B64E9CA217E82A) == 0x000B30, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_StateMachine_9795F7EF474B334625B64E9CA217E82A' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_Slot_E97CB5514C7505F8E51BF7A9F47A2B98) == 0x000BE0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_Slot_E97CB5514C7505F8E51BF7A9F47A2B98' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_LocalToComponentSpace_40215224452645B2184592A9A0876569) == 0x000C28, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_LocalToComponentSpace_40215224452645B2184592A9A0876569' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_LookAt_8CB70C6F4A8A979A3CA168B9B5C79CE2) == 0x000C50, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_LookAt_8CB70C6F4A8A979A3CA168B9B5C79CE2' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_LookAt_4A6168B5423F378E0BA8448283980D84) == 0x000E00, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_LookAt_4A6168B5423F378E0BA8448283980D84' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AnimGraphNode_ComponentToLocalSpace_2B98311C4D7BEE9A3BA178B18A568719) == 0x000FB0, "Member 'UBP_Jackie_Customization_C::AnimGraphNode_ComponentToLocalSpace_2B98311C4D7BEE9A3BA178B18A568719' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, AngleOfView) == 0x000FD0, "Member 'UBP_Jackie_Customization_C::AngleOfView' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, CameraWorldLocation) == 0x000FD4, "Member 'UBP_Jackie_Customization_C::CameraWorldLocation' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, REyeOffset) == 0x000FE0, "Member 'UBP_Jackie_Customization_C::REyeOffset' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, LEyeOffset) == 0x000FEC, "Member 'UBP_Jackie_Customization_C::LEyeOffset' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, MinViewRange) == 0x000FF8, "Member 'UBP_Jackie_Customization_C::MinViewRange' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, MaxViewRange) == 0x000FFC, "Member 'UBP_Jackie_Customization_C::MaxViewRange' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, EyesLookAtAlpha) == 0x001000, "Member 'UBP_Jackie_Customization_C::EyesLookAtAlpha' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, isLeftSide) == 0x001004, "Member 'UBP_Jackie_Customization_C::isLeftSide' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, isRightSide) == 0x001005, "Member 'UBP_Jackie_Customization_C::isRightSide' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, RightSideAngle) == 0x001008, "Member 'UBP_Jackie_Customization_C::RightSideAngle' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, LeftSideAngle) == 0x00100C, "Member 'UBP_Jackie_Customization_C::LeftSideAngle' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, REyeTarget) == 0x001010, "Member 'UBP_Jackie_Customization_C::REyeTarget' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, LEyeTarget) == 0x00101C, "Member 'UBP_Jackie_Customization_C::LEyeTarget' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, LookAtDuringIntro) == 0x001028, "Member 'UBP_Jackie_Customization_C::LookAtDuringIntro' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, BlinkAnimation) == 0x001030, "Member 'UBP_Jackie_Customization_C::BlinkAnimation' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, bShouldStartOnIntroAnimation) == 0x001038, "Member 'UBP_Jackie_Customization_C::bShouldStartOnIntroAnimation' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, bShouldSwitchToIntroAnimation) == 0x001039, "Member 'UBP_Jackie_Customization_C::bShouldSwitchToIntroAnimation' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, bHasSwitchedToIntroAnimationOnce) == 0x00103A, "Member 'UBP_Jackie_Customization_C::bHasSwitchedToIntroAnimationOnce' has a wrong offset!");
static_assert(offsetof(UBP_Jackie_Customization_C, bCanSetStartAnimation) == 0x00103B, "Member 'UBP_Jackie_Customization_C::bCanSetStartAnimation' has a wrong offset!");

}

