#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIntroActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchIntroActor.BP_MatchIntroActor_C.ExecuteUbergraph_BP_MatchIntroActor
// 0x0178 (0x0178 - 0x0000)
struct BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWPlayerIntroActor*                    CallFunc_GetPlayerIntroActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetPlayerCount_PlayerCount;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State_1;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x010C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue_1;                  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchHUD*                          K2Node_DynamicCast_AsTime_Watch_HUD;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDManagedLayer*                       CallFunc_GetDefaultLayer_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDHUDState*                           CallFunc_GetState_ReturnValue;                     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWC_VersusScreen_C*                     CallFunc_GetWidgetContainer_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_PlayerCharacterIntro_WidgetAnimationRef;  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor) == 0x000008, "Wrong alignment on BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor");
static_assert(sizeof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor) == 0x000178, "Wrong size on BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, EntryPoint) == 0x000000, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, Temp_struct_Variable) == 0x000008, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, Temp_struct_Variable_1) == 0x000018, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, Temp_delegate_Variable) == 0x000028, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, Temp_int_Variable) == 0x000038, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000060, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_PostAkEvent_ReturnValue) == 0x00006C, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerCount_ReturnValue) == 0x000070, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_Divide_IntInt_ReturnValue) == 0x000074, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_Max_ReturnValue) == 0x000078, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerController_ReturnValue_1) == 0x000080, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerIntroActor_ReturnValue) == 0x000088, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerIntroActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerCount_PlayerCount) == 0x0000A4, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerCount_PlayerCount' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_Event_EndPlayReason) == 0x0000D0, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetGameState_ReturnValue_1) == 0x0000D8, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_AsTime_Watch_Game_State_1) == 0x0000E0, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_AsTime_Watch_Game_State_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000EC, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_PostSound_ReturnValue) == 0x0000F8, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000100, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, Temp_delegate_Variable_1) == 0x00010C, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_PostSound_ReturnValue_1) == 0x000120, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_PostSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_PostAkEvent_ReturnValue_1) == 0x000128, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetPlayerController_ReturnValue_2) == 0x000130, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetHUD_ReturnValue) == 0x000138, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_AsTime_Watch_HUD) == 0x000140, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_AsTime_Watch_HUD' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetDefaultLayer_ReturnValue) == 0x000150, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetDefaultLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetState_ReturnValue) == 0x000158, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_GetWidgetContainer_ReturnValue) == 0x000168, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_GetWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor, CallFunc_PlayerCharacterIntro_WidgetAnimationRef) == 0x000170, "Member 'BP_MatchIntroActor_C_ExecuteUbergraph_BP_MatchIntroActor::CallFunc_PlayerCharacterIntro_WidgetAnimationRef' has a wrong offset!");

// Function BP_MatchIntroActor.BP_MatchIntroActor_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MatchIntroActor_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntroActor_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MatchIntroActor_C_ReceiveEndPlay");
static_assert(sizeof(BP_MatchIntroActor_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MatchIntroActor_C_ReceiveEndPlay");
static_assert(offsetof(BP_MatchIntroActor_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MatchIntroActor_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MatchIntroActor.BP_MatchIntroActor_C.GetPlayerIntroLevelSequencePlayer
// 0x0038 (0x0038 - 0x0000)
struct BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer final
{
public:
	class AActor*                                 PlayerIntro;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   LevelSequencePlayer;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer) == 0x000008, "Wrong alignment on BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer");
static_assert(sizeof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer) == 0x000038, "Wrong size on BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, PlayerIntro) == 0x000000, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::PlayerIntro' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, LevelSequencePlayer) == 0x000008, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::LevelSequencePlayer' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_MatchIntroActor_C_GetPlayerIntroLevelSequencePlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_MatchIntroActor.BP_MatchIntroActor_C.GetPlayerCount
// 0x0020 (0x0020 - 0x0000)
struct BP_MatchIntroActor_C_GetPlayerCount final
{
public:
	int32                                         PlayerCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchIntroActor_C_GetPlayerCount) == 0x000008, "Wrong alignment on BP_MatchIntroActor_C_GetPlayerCount");
static_assert(sizeof(BP_MatchIntroActor_C_GetPlayerCount) == 0x000020, "Wrong size on BP_MatchIntroActor_C_GetPlayerCount");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerCount, PlayerCount) == 0x000000, "Member 'BP_MatchIntroActor_C_GetPlayerCount::PlayerCount' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerCount, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_MatchIntroActor_C_GetPlayerCount::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerCount, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000010, "Member 'BP_MatchIntroActor_C_GetPlayerCount::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerCount, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MatchIntroActor_C_GetPlayerCount::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchIntroActor_C_GetPlayerCount, CallFunc_GetPlayerCount_ReturnValue) == 0x00001C, "Member 'BP_MatchIntroActor_C_GetPlayerCount::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");

}

