#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchIntroActor

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchIntroActor.BP_MatchIntroActor_C
// 0x0058 (0x0388 - 0x0330)
class ABP_MatchIntroActor_C final : public ATWMatchIntroActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Levka_02;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Levka_01;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        NGDAk_Whooshes;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        NGDAk_VS;                                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       VersusScreenCameraLocation;                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPlayerIndex;                                // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLightingChannels>              LigthChannels_Teams;                               // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FName                                   DynamicLigthLevelName;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWC_VersusScreen_C*                     WC_VersusScreen;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MatchIntroActor(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void EndMatchIntro();
	void ShowVersusScreen();
	void ShowPlayerIntro();
	void OnMatchIntroAnimEnded();
	void Blueprint_Start();
	void GetPlayerIntroLevelSequencePlayer(class AActor* PlayerIntro, class ULevelSequencePlayer** LevelSequencePlayer);
	void GetPlayerCount(int32* PlayerCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchIntroActor_C">();
	}
	static class ABP_MatchIntroActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MatchIntroActor_C>();
	}
};
static_assert(alignof(ABP_MatchIntroActor_C) == 0x000008, "Wrong alignment on ABP_MatchIntroActor_C");
static_assert(sizeof(ABP_MatchIntroActor_C) == 0x000388, "Wrong size on ABP_MatchIntroActor_C");
static_assert(offsetof(ABP_MatchIntroActor_C, UberGraphFrame) == 0x000330, "Member 'ABP_MatchIntroActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, SK_Levka_02) == 0x000338, "Member 'ABP_MatchIntroActor_C::SK_Levka_02' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, SK_Levka_01) == 0x000340, "Member 'ABP_MatchIntroActor_C::SK_Levka_01' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, NGDAk_Whooshes) == 0x000348, "Member 'ABP_MatchIntroActor_C::NGDAk_Whooshes' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, NGDAk_VS) == 0x000350, "Member 'ABP_MatchIntroActor_C::NGDAk_VS' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, VersusScreenCameraLocation) == 0x000358, "Member 'ABP_MatchIntroActor_C::VersusScreenCameraLocation' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, CurrentPlayerIndex) == 0x000360, "Member 'ABP_MatchIntroActor_C::CurrentPlayerIndex' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, LigthChannels_Teams) == 0x000368, "Member 'ABP_MatchIntroActor_C::LigthChannels_Teams' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, DynamicLigthLevelName) == 0x000378, "Member 'ABP_MatchIntroActor_C::DynamicLigthLevelName' has a wrong offset!");
static_assert(offsetof(ABP_MatchIntroActor_C, WC_VersusScreen) == 0x000380, "Member 'ABP_MatchIntroActor_C::WC_VersusScreen' has a wrong offset!");

}

