#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleFlash_Laser_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MuzzleFlash_Laser_Base.BP_MuzzleFlash_Laser_Base_C
// 0x0078 (0x0290 - 0x0218)
class ABP_MuzzleFlash_Laser_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            Billboard;                                         // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Value_D4DA91654C15BE8D8B427DA5BC21AA1B; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D4DA91654C15BE8D8B427DA5BC21AA1B; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Parent_Material;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LigthColor;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PlaneColor;                                        // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ParticlesColor;                                    // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MuzzleFlash_Laser_Base(int32 EntryPoint);
	void Start_MuzzleFlash();
	void DisableLigths();
	void ReceiveTick(float DeltaSeconds);
	void Stop_MuzzleFlash();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MuzzleFlash_Laser_Base_C">();
	}
	static class ABP_MuzzleFlash_Laser_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MuzzleFlash_Laser_Base_C>();
	}
};
static_assert(alignof(ABP_MuzzleFlash_Laser_Base_C) == 0x000008, "Wrong alignment on ABP_MuzzleFlash_Laser_Base_C");
static_assert(sizeof(ABP_MuzzleFlash_Laser_Base_C) == 0x000290, "Wrong size on ABP_MuzzleFlash_Laser_Base_C");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, UberGraphFrame) == 0x000218, "Member 'ABP_MuzzleFlash_Laser_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Billboard) == 0x000220, "Member 'ABP_MuzzleFlash_Laser_Base_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, ParticleSystem) == 0x000228, "Member 'ABP_MuzzleFlash_Laser_Base_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, PointLight) == 0x000230, "Member 'ABP_MuzzleFlash_Laser_Base_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Root) == 0x000238, "Member 'ABP_MuzzleFlash_Laser_Base_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Timeline_0_Value_D4DA91654C15BE8D8B427DA5BC21AA1B) == 0x000240, "Member 'ABP_MuzzleFlash_Laser_Base_C::Timeline_0_Value_D4DA91654C15BE8D8B427DA5BC21AA1B' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Timeline_0__Direction_D4DA91654C15BE8D8B427DA5BC21AA1B) == 0x000244, "Member 'ABP_MuzzleFlash_Laser_Base_C::Timeline_0__Direction_D4DA91654C15BE8D8B427DA5BC21AA1B' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Timeline_0) == 0x000248, "Member 'ABP_MuzzleFlash_Laser_Base_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, Parent_Material) == 0x000250, "Member 'ABP_MuzzleFlash_Laser_Base_C::Parent_Material' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, DynamicMaterial) == 0x000258, "Member 'ABP_MuzzleFlash_Laser_Base_C::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, LigthColor) == 0x000260, "Member 'ABP_MuzzleFlash_Laser_Base_C::LigthColor' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, PlaneColor) == 0x000270, "Member 'ABP_MuzzleFlash_Laser_Base_C::PlaneColor' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleFlash_Laser_Base_C, ParticlesColor) == 0x000280, "Member 'ABP_MuzzleFlash_Laser_Base_C::ParticlesColor' has a wrong offset!");

}

