#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Passive_UnsyncedDisruptionsVision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TimeWatch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ANGDPlayerController*                   CallFunc_GetLocalController_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGameplayAbilitySystem*               K2Node_Event_InTWAbilitySystem_1;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             K2Node_Event_AbilityDataHandle;                    // 0x0048(0x0020)(ConstParm)
	bool                                          K2Node_Event_bShouldTriggerLogic;                  // 0x0068(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGameplayAbilitySystem*               K2Node_Event_InTWAbilitySystem;                    // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWAbilitiesComponent*                  K2Node_Event_Caster_AbilityComp;                   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_CustomEvent_TWChar;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFirearm*                               K2Node_CustomEvent_Firearm;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterGhostBP_C*                  CallFunc_CreateOrRefreshGhost_Ghost_Character;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateOrRefreshGhost_Existed_Before;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INGDDamageable>        CallFunc_IsAlive_self_CastInput;                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterGhost*                      K2Node_CustomEvent_TWGhacrGhost_1;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_CustomEvent_TWMimicCharacter_1;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchEvent*                        K2Node_CustomEvent_Event;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWKillEvent*                           K2Node_DynamicCast_AsTWKill_Event;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP_1;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_CustomEvent_Character;                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewHealth;                      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterGhostBP_C*                  CallFunc_Map_Find_Value;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    CallFunc_GetGameState_ReturnValue_1;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue;              // 0x0158(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentCloneIndex_ReturnValue;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListenServer_ReturnValue;               // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    CallFunc_GetOwningCharacter_ReturnValue;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_3;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_4;          // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    CallFunc_GetOwningCharacter_ReturnValue_1;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCloneIndex_ReturnValue;                // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCloneCount_ReturnValue;                // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_12;             // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_13;             // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_14;             // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_15;             // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    CallFunc_GetGameState_ReturnValue_2;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalTeamId_ReturnValue;               // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATWCharacterGhost* TWGhacrGhost, class ATimeWatchCharacter* TWMimicCharacter)> K2Node_CreateDelegate_OutputDelegate; // 0x0348(0x0010)(ZeroConstructor, NoDestructor)
	class ATWCharacterGhost*                      K2Node_CustomEvent_TWGhacrGhost;                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_CustomEvent_TWMimicCharacter;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ATWCharacterGhost* TWGhacrGhost, class ATimeWatchCharacter* TWMimicCharacter)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ATWCharacterGhost* TWGhacrGhost, class ATimeWatchCharacter* TWMimicCharacter)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0378(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ATWCharacterGhost* TWGhacrGhost, class ATimeWatchCharacter* TWMimicCharacter)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	class ATWCharacterGhostBP_C*                  CallFunc_CreateOrRefreshGhost_Ghost_Character_1;   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CreateOrRefreshGhost_Existed_Before_1;    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision) == 0x0003A8, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, EntryPoint) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_BoolToString_ReturnValue) == 0x000010, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetLocalController_ReturnValue) == 0x000020, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetPlayerName_ReturnValue) == 0x000028, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_InTWAbilitySystem_1) == 0x000040, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_InTWAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_AbilityDataHandle) == 0x000048, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_bShouldTriggerLogic) == 0x000068, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_bShouldTriggerLogic' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_InTWAbilitySystem) == 0x000070, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_Event_Caster_AbilityComp) == 0x000078, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_Event_Caster_AbilityComp' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_TWChar) == 0x000080, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_TWChar' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_Firearm) == 0x000088, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_Firearm' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_AsTWCharacter_BP) == 0x000090, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_AsTWCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_CreateOrRefreshGhost_Ghost_Character) == 0x0000A0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_CreateOrRefreshGhost_Ghost_Character' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_CreateOrRefreshGhost_Existed_Before) == 0x0000A8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_CreateOrRefreshGhost_Existed_Before' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_IsAlive_self_CastInput) == 0x0000B0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_IsAlive_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_IsAlive_ReturnValue) == 0x0000C0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_TWGhacrGhost_1) == 0x0000C8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_TWGhacrGhost_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_TWMimicCharacter_1) == 0x0000D0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_TWMimicCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_Event) == 0x0000D8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_AsTWKill_Event) == 0x0000E0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_AsTWKill_Event' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetObjectClass_ReturnValue) == 0x0000F0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetClassDisplayName_ReturnValue) == 0x0000F8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Contains_ReturnValue) == 0x000108, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_AsTWCharacter_BP_1) == 0x000120, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_AsTWCharacter_BP_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetTeamId_ReturnValue) == 0x00012C, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_Character) == 0x000130, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_NewHealth) == 0x000138, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_NewHealth' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Map_Find_Value) == 0x000140, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Map_Find_ReturnValue) == 0x000148, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetGameState_ReturnValue_1) == 0x000150, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetInstanceData_ReturnValue) == 0x000158, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetInstanceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetCurrentCloneIndex_ReturnValue) == 0x000170, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetCurrentCloneIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Add_IntInt_ReturnValue) == 0x000174, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_IsStandalone_ReturnValue) == 0x000178, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_IsListenServer_ReturnValue) == 0x000179, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_IsListenServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetOwningCharacter_ReturnValue) == 0x000180, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetOwningCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_BooleanOR_ReturnValue) == 0x000188, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetLocalRole_ReturnValue) == 0x000189, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000190, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_BoolToString_ReturnValue_2) == 0x0001B8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_BoolToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001C8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_BooleanAND_ReturnValue) == 0x0001D8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_IsPlayerControlled_ReturnValue) == 0x0001D9, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetOwner_ReturnValue) == 0x0001E0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_AsTime_Watch_Character) == 0x0001F0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_DynamicCast_bSuccess_3) == 0x0001F8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_BooleanAND_ReturnValue_2) == 0x0001F9, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_BoolToString_ReturnValue_3) == 0x000200, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_BoolToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_BooleanOR_ReturnValue_1) == 0x000210, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000218, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_BoolToString_ReturnValue_4) == 0x000228, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_BoolToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000238, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000248, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetOwningCharacter_ReturnValue_1) == 0x000258, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetOwningCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000260, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetCloneIndex_ReturnValue) == 0x000270, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetCloneIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000278, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Conv_IntToString_ReturnValue) == 0x000288, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000298, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetDisplayName_ReturnValue) == 0x0002A8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_9) == 0x0002B8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_10) == 0x0002C8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetCloneCount_ReturnValue) == 0x0002D8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetCloneCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_11) == 0x0002E0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002F0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_12) == 0x0002F8, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_13) == 0x000308, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_14) == 0x000318, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_Concat_StrStr_ReturnValue_15) == 0x000328, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_Concat_StrStr_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetGameState_ReturnValue_2) == 0x000338, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_GetLocalTeamId_ReturnValue) == 0x000340, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_GetLocalTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000344, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CreateDelegate_OutputDelegate) == 0x000348, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_TWGhacrGhost) == 0x000358, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_TWGhacrGhost' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CustomEvent_TWMimicCharacter) == 0x000360, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CustomEvent_TWMimicCharacter' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000368, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CreateDelegate_OutputDelegate_2) == 0x000378, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, K2Node_CreateDelegate_OutputDelegate_3) == 0x000388, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_CreateOrRefreshGhost_Ghost_Character_1) == 0x000398, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_CreateOrRefreshGhost_Ghost_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision, CallFunc_CreateOrRefreshGhost_Existed_Before_1) == 0x0003A0, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_ExecuteUbergraph_BP_Passive_UnsyncedDisruptionsVision::CallFunc_CreateOrRefreshGhost_Existed_Before_1' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.OnGhostDisappear
// 0x0010 (0x0010 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear final
{
public:
	class ATWCharacterGhost*                      TWGhacrGhost;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    TWMimicCharacter;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear) == 0x000010, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear, TWGhacrGhost) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear::TWGhacrGhost' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear, TWMimicCharacter) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnGhostDisappear::TWMimicCharacter' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.OnHealthRestored
// 0x0010 (0x0010 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored final
{
public:
	class ATimeWatchCharacter*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewHealth;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored) == 0x000010, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored, Character) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored::Character' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored, NewHealth) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnHealthRestored::NewHealth' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.OnGenericObserverEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent final
{
public:
	class UTimeWatchEvent*                        Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent) == 0x000008, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent, Event) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnGenericObserverEvent::Event' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.OnDestroyParadox
// 0x0010 (0x0010 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox final
{
public:
	class ATWCharacterGhost*                      TWGhacrGhost;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    TWMimicCharacter;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox) == 0x000010, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox, TWGhacrGhost) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox::TWGhacrGhost' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox, TWMimicCharacter) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnDestroyParadox::TWMimicCharacter' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.OnFirearmUsed
// 0x0010 (0x0010 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed final
{
public:
	class ATimeWatchCharacter*                    TWChar;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFirearm*                               Firearm;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed) == 0x000010, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed, TWChar) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed::TWChar' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed, Firearm) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_OnFirearmUsed::Firearm' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.BP_OnPreActivated
// 0x0010 (0x0010 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated final
{
public:
	class UTWGameplayAbilitySystem*               InTWAbilitySystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWAbilitiesComponent*                  Caster_AbilityComp;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated) == 0x000010, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated, InTWAbilitySystem) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated::InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated, Caster_AbilityComp) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_BP_OnPreActivated::Caster_AbilityComp' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.BP_OnReExecuted
// 0x0030 (0x0030 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted final
{
public:
	class UTWGameplayAbilitySystem*               InTWAbilitySystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bShouldTriggerLogic;                               // 0x0028(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted) == 0x000008, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted) == 0x000030, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted, InTWAbilitySystem) == 0x000000, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted::InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted, AbilityDataHandle) == 0x000008, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted, bShouldTriggerLogic) == 0x000028, "Member 'BP_Passive_UnsyncedDisruptionsVision_C_BP_OnReExecuted::bShouldTriggerLogic' has a wrong offset!");

// Function BP_Passive_UnsyncedDisruptionsVision.BP_Passive_UnsyncedDisruptionsVision_C.BP_Update
// 0x0004 (0x0004 - 0x0000)
struct BP_Passive_UnsyncedDisruptionsVision_C_BP_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Passive_UnsyncedDisruptionsVision_C_BP_Update) == 0x000004, "Wrong alignment on BP_Passive_UnsyncedDisruptionsVision_C_BP_Update");
static_assert(sizeof(BP_Passive_UnsyncedDisruptionsVision_C_BP_Update) == 0x000004, "Wrong size on BP_Passive_UnsyncedDisruptionsVision_C_BP_Update");
