#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RewindImpact_Shotgun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RewindImpact_Shotgun.BP_RewindImpact_Shotgun_C.ExecuteUbergraph_BP_RewindImpact_Shotgun
// 0x0048 (0x0048 - 0x0000)
struct BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LifeCylcle;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewState;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun) == 0x000004, "Wrong alignment on BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun");
static_assert(sizeof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun) == 0x000048, "Wrong size on BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, EntryPoint) == 0x000000, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, K2Node_Event_LifeCylcle) == 0x000004, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::K2Node_Event_LifeCylcle' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000018, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_GetFloatValue_ReturnValue) == 0x00001C, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000020, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x00002C, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, K2Node_Event_NewState) == 0x000038, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun, CallFunc_VLerp_ReturnValue) == 0x00003C, "Member 'BP_RewindImpact_Shotgun_C_ExecuteUbergraph_BP_RewindImpact_Shotgun::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function BP_RewindImpact_Shotgun.BP_RewindImpact_Shotgun_C.OnParticleEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_RewindImpact_Shotgun_C_OnParticleEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RewindImpact_Shotgun_C_OnParticleEnabled) == 0x000001, "Wrong alignment on BP_RewindImpact_Shotgun_C_OnParticleEnabled");
static_assert(sizeof(BP_RewindImpact_Shotgun_C_OnParticleEnabled) == 0x000001, "Wrong size on BP_RewindImpact_Shotgun_C_OnParticleEnabled");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_OnParticleEnabled, NewState) == 0x000000, "Member 'BP_RewindImpact_Shotgun_C_OnParticleEnabled::NewState' has a wrong offset!");

// Function BP_RewindImpact_Shotgun.BP_RewindImpact_Shotgun_C.ParticleTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RewindImpact_Shotgun_C_ParticleTick final
{
public:
	float                                         LifeCylcle;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RewindImpact_Shotgun_C_ParticleTick) == 0x000004, "Wrong alignment on BP_RewindImpact_Shotgun_C_ParticleTick");
static_assert(sizeof(BP_RewindImpact_Shotgun_C_ParticleTick) == 0x000004, "Wrong size on BP_RewindImpact_Shotgun_C_ParticleTick");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_ParticleTick, LifeCylcle) == 0x000000, "Member 'BP_RewindImpact_Shotgun_C_ParticleTick::LifeCylcle' has a wrong offset!");

// Function BP_RewindImpact_Shotgun.BP_RewindImpact_Shotgun_C.Construction
// 0x0138 (0x0138 - 0x0000)
struct BP_RewindImpact_Shotgun_C_Construction final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalWeapon*                        K2Node_DynamicCast_AsTemporal_Weapon;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANGDCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlly_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RewindImpact_Shotgun_C_Construction) == 0x000008, "Wrong alignment on BP_RewindImpact_Shotgun_C_Construction");
static_assert(sizeof(BP_RewindImpact_Shotgun_C_Construction) == 0x000138, "Wrong size on BP_RewindImpact_Shotgun_C_Construction");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, K2Node_DynamicCast_AsTemporal_Weapon) == 0x000008, "Member 'BP_RewindImpact_Shotgun_C_Construction::K2Node_DynamicCast_AsTemporal_Weapon' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_RewindImpact_Shotgun_C_Construction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_RandomFloatInRange_ReturnValue) == 0x000014, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000018, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000020, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000028, "Member 'BP_RewindImpact_Shotgun_C_Construction::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_RewindImpact_Shotgun_C_Construction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000034, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_IsAlly_ReturnValue) == 0x000038, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_IsAlly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_MakeVector_ReturnValue) == 0x00003C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_GetVectorParameterValue_ReturnValue) == 0x00004C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_GetVectorParameterValue_ReturnValue_1) == 0x00005C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_LinearColorLerp_ReturnValue) == 0x00006C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x00007C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_MakeRotator_ReturnValue) == 0x000080, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_ComposeRotators_ReturnValue) == 0x00008C, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000098, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000120, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_Shotgun_C_Construction, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000130, "Member 'BP_RewindImpact_Shotgun_C_Construction::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

