#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RewindImpact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RewindImpact.BP_RewindImpact_C.ExecuteUbergraph_BP_RewindImpact
// 0x0068 (0x0068 - 0x0000)
struct BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LifeCylcle;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewState;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact) == 0x000008, "Wrong alignment on BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact");
static_assert(sizeof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact) == 0x000068, "Wrong size on BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, EntryPoint) == 0x000000, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, K2Node_Event_LifeCylcle) == 0x000008, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::K2Node_Event_LifeCylcle' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00001C, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_FClamp_ReturnValue_1) == 0x000020, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_GetFloatValue_ReturnValue) == 0x000024, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_VLerp_ReturnValue) == 0x000028, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000034, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000040, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact, K2Node_Event_NewState) == 0x000060, "Member 'BP_RewindImpact_C_ExecuteUbergraph_BP_RewindImpact::K2Node_Event_NewState' has a wrong offset!");

// Function BP_RewindImpact.BP_RewindImpact_C.OnParticleEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_RewindImpact_C_OnParticleEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RewindImpact_C_OnParticleEnabled) == 0x000001, "Wrong alignment on BP_RewindImpact_C_OnParticleEnabled");
static_assert(sizeof(BP_RewindImpact_C_OnParticleEnabled) == 0x000001, "Wrong size on BP_RewindImpact_C_OnParticleEnabled");
static_assert(offsetof(BP_RewindImpact_C_OnParticleEnabled, NewState) == 0x000000, "Member 'BP_RewindImpact_C_OnParticleEnabled::NewState' has a wrong offset!");

// Function BP_RewindImpact.BP_RewindImpact_C.ParticleTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RewindImpact_C_ParticleTick final
{
public:
	float                                         LifeCylcle;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RewindImpact_C_ParticleTick) == 0x000004, "Wrong alignment on BP_RewindImpact_C_ParticleTick");
static_assert(sizeof(BP_RewindImpact_C_ParticleTick) == 0x000004, "Wrong size on BP_RewindImpact_C_ParticleTick");
static_assert(offsetof(BP_RewindImpact_C_ParticleTick, LifeCylcle) == 0x000000, "Member 'BP_RewindImpact_C_ParticleTick::LifeCylcle' has a wrong offset!");

// Function BP_RewindImpact.BP_RewindImpact_C.Construction
// 0x0300 (0x0300 - 0x0000)
struct BP_RewindImpact_C_Construction final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult_1;  // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x01E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalWeapon*                        K2Node_DynamicCast_AsTemporal_Weapon;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANGDCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBlue_ReturnValue;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x025C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x02E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RewindImpact_C_Construction) == 0x000010, "Wrong alignment on BP_RewindImpact_C_Construction");
static_assert(sizeof(BP_RewindImpact_C_Construction) == 0x000300, "Wrong size on BP_RewindImpact_C_Construction");
static_assert(offsetof(BP_RewindImpact_C_Construction, Temp_float_Variable) == 0x000000, "Member 'BP_RewindImpact_C_Construction::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_Construction, Temp_struct_Variable) == 0x000010, "Member 'BP_RewindImpact_C_Construction::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_RewindImpact_C_Construction, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_RewindImpact_C_Construction::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
