#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RewindImpact_Shotgun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_TemporalParticle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RewindImpact_Shotgun.BP_RewindImpact_Shotgun_C
// 0x0070 (0x02C0 - 0x0250)
class ABP_RewindImpact_Shotgun_C final : public ABP_TemporalParticle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_BulletImpact;                                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Impact;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          Seed;                                              // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	class UCurveFloat*                            Curve;                                             // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Material_Fire;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material_Fire;                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartSize;                                         // 0x0290(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndSize;                                           // 0x029C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_Intensity;                                   // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfSparks;                                    // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomSize;                                        // 0x02B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RewindImpact_Shotgun(int32 EntryPoint);
	void OnParticleEnabled(bool NewState);
	void ReceiveBeginPlay();
	void ParticleTick(float LifeCylcle);
	void Construction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RewindImpact_Shotgun_C">();
	}
	static class ABP_RewindImpact_Shotgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RewindImpact_Shotgun_C>();
	}
};
static_assert(alignof(ABP_RewindImpact_Shotgun_C) == 0x000008, "Wrong alignment on ABP_RewindImpact_Shotgun_C");
static_assert(sizeof(ABP_RewindImpact_Shotgun_C) == 0x0002C0, "Wrong size on ABP_RewindImpact_Shotgun_C");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, UberGraphFrame) == 0x000250, "Member 'ABP_RewindImpact_Shotgun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, PS_BulletImpact) == 0x000258, "Member 'ABP_RewindImpact_Shotgun_C::PS_BulletImpact' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, PointLight) == 0x000260, "Member 'ABP_RewindImpact_Shotgun_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, SM_Impact) == 0x000268, "Member 'ABP_RewindImpact_Shotgun_C::SM_Impact' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Seed) == 0x000270, "Member 'ABP_RewindImpact_Shotgun_C::Seed' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Curve) == 0x000278, "Member 'ABP_RewindImpact_Shotgun_C::Curve' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Material_Fire) == 0x000280, "Member 'ABP_RewindImpact_Shotgun_C::Material_Fire' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Dynamic_Material_Fire) == 0x000288, "Member 'ABP_RewindImpact_Shotgun_C::Dynamic_Material_Fire' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, StartSize) == 0x000290, "Member 'ABP_RewindImpact_Shotgun_C::StartSize' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, EndSize) == 0x00029C, "Member 'ABP_RewindImpact_Shotgun_C::EndSize' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Light_Intensity) == 0x0002A8, "Member 'ABP_RewindImpact_Shotgun_C::Light_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, NumberOfSparks) == 0x0002AC, "Member 'ABP_RewindImpact_Shotgun_C::NumberOfSparks' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, Time) == 0x0002B0, "Member 'ABP_RewindImpact_Shotgun_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_RewindImpact_Shotgun_C, RandomSize) == 0x0002B4, "Member 'ABP_RewindImpact_Shotgun_C::RandomSize' has a wrong offset!");

}

