#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SeeDamagedEnemiesAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TimeWatch_structs.hpp"


namespace SDK::Params
{

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.ExecuteUbergraph_BP_SeeDamagedEnemiesAbility
// 0x0198 (0x0198 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue;              // 0x0008(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue_1;            // 0x0028(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListenServer_ReturnValue;               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue_1;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGameplayAbilitySystem*               K2Node_Event_InTWAbilitySystem_2;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             K2Node_Event_AbilityDataHandle_1;                  // 0x0070(0x0020)(ConstParm)
	bool                                          K2Node_Event_bShouldTriggerLogic_1;                // 0x0090(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGameplayAbilitySystem*               K2Node_Event_InTWAbilitySystem_1;                  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWAbilitiesComponent*                  K2Node_Event_Caster_AbilityComp;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityExecutionData                CallFunc_GetAbilityExecutionData_ReturnValue;      // 0x00A8(0x0028)(NoDestructor, ContainsInstancedReference)
	class ATimeWatchCharacter*                    CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterBP_C*                       CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_CustomEvent_Character;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewHealth;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ATimeWatchCharacter* Character, float NewHealth)> K2Node_CreateDelegate_OutputDelegate; // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP_1;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWGameplayAbilitySystem*               K2Node_Event_InTWAbilitySystem;                    // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             K2Node_Event_AbilityDataHandle;                    // 0x0138(0x0020)(ConstParm)
	bool                                          K2Node_Event_bShouldTriggerLogic;                  // 0x0158(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue_2;            // 0x0160(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWCharacterBP_C*                       CallFunc_Array_Get_Item_2;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsedInLoop_ReturnValue;                   // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetHealth_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility) == 0x000198, "Wrong size on BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, EntryPoint) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_GetInstanceData_ReturnValue) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_GetInstanceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_IsStandalone_ReturnValue) == 0x000024, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_HasAuthority_ReturnValue) == 0x000025, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_GetInstanceData_ReturnValue_1) == 0x000028, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_GetInstanceData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_BooleanOR_ReturnValue) == 0x000041, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_GetLocalRole_ReturnValue) == 0x000042, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_IsListenServer_ReturnValue) == 0x000043, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_IsListenServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000044, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_IsStandalone_ReturnValue_1) == 0x000045, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_IsStandalone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_BooleanOR_ReturnValue_1) == 0x00004C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_BooleanOR_ReturnValue_2) == 0x00004D, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Array_Index_Variable_2) == 0x000058, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_InTWAbilitySystem_2) == 0x000068, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_InTWAbilitySystem_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_AbilityDataHandle_1) == 0x000070, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_AbilityDataHandle_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_bShouldTriggerLogic_1) == 0x000090, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_bShouldTriggerLogic_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_InTWAbilitySystem_1) == 0x000098, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_InTWAbilitySystem_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_Caster_AbilityComp) == 0x0000A0, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_Caster_AbilityComp' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_GetAbilityExecutionData_ReturnValue) == 0x0000A8, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_GetAbilityExecutionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_DynamicCast_AsTWCharacter_BP) == 0x0000E0, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_DynamicCast_AsTWCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_CustomEvent_Character) == 0x000100, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_CustomEvent_NewHealth) == 0x000108, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_CustomEvent_NewHealth' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_CreateDelegate_OutputDelegate) == 0x00010C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_DynamicCast_AsTWCharacter_BP_1) == 0x000120, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_DynamicCast_AsTWCharacter_BP_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, Temp_int_Loop_Counter_Variable_2) == 0x00012C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_InTWAbilitySystem) == 0x000130, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_AbilityDataHandle) == 0x000138, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_bShouldTriggerLogic) == 0x000158, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_bShouldTriggerLogic' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Less_IntInt_ReturnValue_1) == 0x000159, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Add_IntInt_ReturnValue_2) == 0x00015C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_GetInstanceData_ReturnValue_2) == 0x000160, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_GetInstanceData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000178, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, K2Node_Event_DeltaSeconds) == 0x00017C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Get_Item_2) == 0x000180, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Array_Length_ReturnValue_2) == 0x000188, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_UsedInLoop_ReturnValue) == 0x00018C, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_UsedInLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_Less_IntInt_ReturnValue_2) == 0x00018D, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_BP_GetHealth_ReturnValue) == 0x000190, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_BP_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000194, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility, CallFunc_BooleanAND_ReturnValue) == 0x000195, "Member 'BP_SeeDamagedEnemiesAbility_C_ExecuteUbergraph_BP_SeeDamagedEnemiesAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.BP_Update
// 0x0004 (0x0004 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_BP_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_BP_Update) == 0x000004, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_BP_Update");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_BP_Update) == 0x000004, "Wrong size on BP_SeeDamagedEnemiesAbility_C_BP_Update");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_Update, DeltaSeconds) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_Update::DeltaSeconds' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.BP_OnReExecuted
// 0x0030 (0x0030 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted final
{
public:
	class UTWGameplayAbilitySystem*               InTWAbilitySystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bShouldTriggerLogic;                               // 0x0028(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted) == 0x000030, "Wrong size on BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted, InTWAbilitySystem) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted::InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted, AbilityDataHandle) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted, bShouldTriggerLogic) == 0x000028, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnReExecuted::bShouldTriggerLogic' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.OnHealthRestored
// 0x0010 (0x0010 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_OnHealthRestored final
{
public:
	class ATimeWatchCharacter*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewHealth;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_OnHealthRestored) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_OnHealthRestored");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_OnHealthRestored) == 0x000010, "Wrong size on BP_SeeDamagedEnemiesAbility_C_OnHealthRestored");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_OnHealthRestored, Character) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_OnHealthRestored::Character' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_OnHealthRestored, NewHealth) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_OnHealthRestored::NewHealth' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.BP_OnPreActivated
// 0x0010 (0x0010 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated final
{
public:
	class UTWGameplayAbilitySystem*               InTWAbilitySystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWAbilitiesComponent*                  Caster_AbilityComp;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated) == 0x000010, "Wrong size on BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated, InTWAbilitySystem) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated::InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated, Caster_AbilityComp) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnPreActivated::Caster_AbilityComp' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.BP_OnActivated
// 0x0030 (0x0030 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_BP_OnActivated final
{
public:
	class UTWGameplayAbilitySystem*               InTWAbilitySystem;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bShouldTriggerLogic;                               // 0x0028(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_BP_OnActivated) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_BP_OnActivated");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_BP_OnActivated) == 0x000030, "Wrong size on BP_SeeDamagedEnemiesAbility_C_BP_OnActivated");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnActivated, InTWAbilitySystem) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnActivated::InTWAbilitySystem' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnActivated, AbilityDataHandle) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnActivated::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_BP_OnActivated, bShouldTriggerLogic) == 0x000028, "Member 'BP_SeeDamagedEnemiesAbility_C_BP_OnActivated::bShouldTriggerLogic' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.SetDamagedOutline
// 0x0060 (0x0060 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline final
{
public:
	class ANGDCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AItem*>                          CallFunc_GetItemsOfClass_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AItem*                                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalWeapon*                        K2Node_DynamicCast_AsTemporal_Weapon;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetMeshTP_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline) == 0x000060, "Wrong size on BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, Character) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::Character' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_GetItemsOfClass_ReturnValue) == 0x000018, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_GetItemsOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, K2Node_DynamicCast_AsTemporal_Weapon) == 0x000040, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::K2Node_DynamicCast_AsTemporal_Weapon' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_GetMeshTP_ReturnValue) == 0x000050, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_GetMeshTP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_SeeDamagedEnemiesAbility_C_SetDamagedOutline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.SetOutlineOnAlreadyDamagedEnemies
// 0x0040 (0x0040 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies final
{
public:
	class ATimeWatchCharacter*                    Controlled_Char;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCloneIndex_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterBP_C*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCloneIndex_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetHealth_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies) == 0x000040, "Wrong size on BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, Controlled_Char) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::Controlled_Char' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_GetCloneIndex_ReturnValue) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_GetCloneIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_GetCloneIndex_ReturnValue_1) == 0x00002C, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_GetCloneIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_BP_GetHealth_ReturnValue) == 0x000034, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_BP_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_Less_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'BP_SeeDamagedEnemiesAbility_C_SetOutlineOnAlreadyDamagedEnemies::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.GetEnemyClonesAndBind
// 0x0088 (0x0088 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind final
{
public:
	class ATimeWatchCharacter*                    Controlled_Char;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalTeamId_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue;              // 0x0018(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATimeWatchCharacter*>            CallFunc_GetAllClones_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class ATimeWatchCharacter*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATimeWatchCharacter* Character, float NewHealth)> K2Node_CreateDelegate_OutputDelegate; // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind) == 0x000008, "Wrong alignment on BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind");
static_assert(sizeof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind) == 0x000088, "Wrong size on BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, Controlled_Char) == 0x000000, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::Controlled_Char' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_GetLocalTeamId_ReturnValue) == 0x00000C, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_GetLocalTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_GetInstanceData_ReturnValue) == 0x000018, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_GetInstanceData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_GetAllClones_ReturnValue) == 0x000040, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_GetAllClones_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, K2Node_DynamicCast_AsTWCharacter_BP) == 0x000058, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::K2Node_DynamicCast_AsTWCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_GetTeamId_ReturnValue) == 0x000068, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'BP_SeeDamagedEnemiesAbility_C_GetEnemyClonesAndBind::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_SeeDamagedEnemiesAbility.BP_SeeDamagedEnemiesAbility_C.TryActivateAbility
// 0x0060 (0x0060 - 0x0000)
struct BP_SeeDamagedEnemiesAbility_C_TryActivateAbility final
{
public:
	bool                                          Should_Trigger_Logic;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWAbilitiesComponent*                  TWAbilityComponent;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    TWCharacter;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTWAbilityInstanceData                 CallFunc_GetInstanceData_ReturnValue;              // 0x0018(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class ANGDPlayerController*                   CallFunc_GetLocalController_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListenServer_ReturnValue;               // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
