#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tooltip_Targets

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Tooltip_Targets.BP_Tooltip_Targets_C.ExecuteUbergraph_BP_Tooltip_Targets
// 0x0068 (0x0068 - 0x0000)
struct BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentRound)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class ABP_TutorialToolipManager_C*            K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewIndex_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CurrentLoop)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_NewIndex;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATutorial_Target_BP2_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetTargetDownCount_GetTargetDownCount;    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTargetDownCount_GetTargetDownCount_1;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets) == 0x000008, "Wrong alignment on BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets");
static_assert(sizeof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets) == 0x000068, "Wrong size on BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, EntryPoint) == 0x000000, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager) == 0x000020, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_CustomEvent_NewIndex_1) == 0x00002C, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_CustomEvent_NewIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, K2Node_CustomEvent_NewIndex) == 0x000044, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::K2Node_CustomEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_GetTargetDownCount_GetTargetDownCount) == 0x000058, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_GetTargetDownCount_GetTargetDownCount' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00005C, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_BooleanAND_ReturnValue) == 0x00005D, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_GetTargetDownCount_GetTargetDownCount_1) == 0x000060, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_GetTargetDownCount_GetTargetDownCount_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_Tooltip_Targets_C_ExecuteUbergraph_BP_Tooltip_Targets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Tooltip_Targets.BP_Tooltip_Targets_C.OnLoopChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_Tooltip_Targets_C_OnLoopChanged final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tooltip_Targets_C_OnLoopChanged) == 0x000004, "Wrong alignment on BP_Tooltip_Targets_C_OnLoopChanged");
static_assert(sizeof(BP_Tooltip_Targets_C_OnLoopChanged) == 0x000004, "Wrong size on BP_Tooltip_Targets_C_OnLoopChanged");
static_assert(offsetof(BP_Tooltip_Targets_C_OnLoopChanged, NewIndex) == 0x000000, "Member 'BP_Tooltip_Targets_C_OnLoopChanged::NewIndex' has a wrong offset!");

// Function BP_Tooltip_Targets.BP_Tooltip_Targets_C.OnRoundChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_Tooltip_Targets_C_OnRoundChanged final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tooltip_Targets_C_OnRoundChanged) == 0x000004, "Wrong alignment on BP_Tooltip_Targets_C_OnRoundChanged");
static_assert(sizeof(BP_Tooltip_Targets_C_OnRoundChanged) == 0x000004, "Wrong size on BP_Tooltip_Targets_C_OnRoundChanged");
static_assert(offsetof(BP_Tooltip_Targets_C_OnRoundChanged, NewIndex) == 0x000000, "Member 'BP_Tooltip_Targets_C_OnRoundChanged::NewIndex' has a wrong offset!");

// Function BP_Tooltip_Targets.BP_Tooltip_Targets_C.CheckLocks
// 0x0004 (0x0004 - 0x0000)
struct BP_Tooltip_Targets_C_CheckLocks final
{
public:
	bool                                          LocksPassed;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckLocks_LocksPassed;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tooltip_Targets_C_CheckLocks) == 0x000001, "Wrong alignment on BP_Tooltip_Targets_C_CheckLocks");
static_assert(sizeof(BP_Tooltip_Targets_C_CheckLocks) == 0x000004, "Wrong size on BP_Tooltip_Targets_C_CheckLocks");
static_assert(offsetof(BP_Tooltip_Targets_C_CheckLocks, LocksPassed) == 0x000000, "Member 'BP_Tooltip_Targets_C_CheckLocks::LocksPassed' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_CheckLocks, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'BP_Tooltip_Targets_C_CheckLocks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_CheckLocks, CallFunc_CheckLocks_LocksPassed) == 0x000002, "Member 'BP_Tooltip_Targets_C_CheckLocks::CallFunc_CheckLocks_LocksPassed' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_CheckLocks, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_Tooltip_Targets_C_CheckLocks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Tooltip_Targets.BP_Tooltip_Targets_C.GetTargetDownCount
// 0x0030 (0x0030 - 0x0000)
struct BP_Tooltip_Targets_C_GetTargetDownCount final
{
public:
	int32                                         GetTargetDownCount_0;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATutorial_Target_BP2_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Tooltip_Targets_C_GetTargetDownCount) == 0x000008, "Wrong alignment on BP_Tooltip_Targets_C_GetTargetDownCount");
static_assert(sizeof(BP_Tooltip_Targets_C_GetTargetDownCount) == 0x000030, "Wrong size on BP_Tooltip_Targets_C_GetTargetDownCount");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, GetTargetDownCount_0) == 0x000000, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::GetTargetDownCount_0' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, Count) == 0x000004, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::Count' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, Temp_int_Variable) == 0x000014, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_Targets_C_GetTargetDownCount, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Tooltip_Targets_C_GetTargetDownCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

