#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Temporal_ParticleSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.ExecuteUbergraph_BP_Temporal_ParticleSystem
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewState_2;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_LifeCylcle;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWStaticMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Temporal_Emitter_C*                 CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Header;                         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Temporal_Emitter_C*                 CallFunc_Array_Get_Item_3;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NewState;                       // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewState_1;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_NewState;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem) == 0x000008, "Wrong alignment on BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem) == 0x0000F8, "Wrong size on BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, EntryPoint) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_Event_NewState_2) == 0x000020, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_Event_NewState_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_Event_LifeCylcle) == 0x000024, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_Event_LifeCylcle' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Length_ReturnValue_1) == 0x00003C, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_CustomEvent_Header) == 0x000050, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_CustomEvent_Header' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Len_ReturnValue) == 0x000060, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Get_Item_3) == 0x000068, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Conv_FloatToString_ReturnValue) == 0x000090, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Array_Length_ReturnValue_2) == 0x0000B0, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, Temp_int_Loop_Counter_Variable_2) == 0x0000E0, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E4, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E8, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000EC, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_CustomEvent_NewState) == 0x0000ED, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_Not_PreBool_ReturnValue) == 0x0000EE, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, CallFunc_BooleanAND_ReturnValue) == 0x0000EF, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_Event_NewState_1) == 0x0000F0, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_Event_NewState_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem, K2Node_Event_NewState) == 0x0000F1, "Member 'BP_Temporal_ParticleSystem_C_ExecuteUbergraph_BP_Temporal_ParticleSystem::K2Node_Event_NewState' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.SetOwnerSee
// 0x0001 (0x0001 - 0x0000)
struct BP_Temporal_ParticleSystem_C_SetOwnerSee final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_SetOwnerSee) == 0x000001, "Wrong alignment on BP_Temporal_ParticleSystem_C_SetOwnerSee");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_SetOwnerSee) == 0x000001, "Wrong size on BP_Temporal_ParticleSystem_C_SetOwnerSee");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSee, NewState) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSee::NewState' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.SetOnlyOwnerSee
// 0x0001 (0x0001 - 0x0000)
struct BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee) == 0x000001, "Wrong alignment on BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee) == 0x000001, "Wrong size on BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee, NewState) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSee::NewState' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.BP_SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_Temporal_ParticleSystem_C_BP_SetEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_BP_SetEnabled) == 0x000001, "Wrong alignment on BP_Temporal_ParticleSystem_C_BP_SetEnabled");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_BP_SetEnabled) == 0x000001, "Wrong size on BP_Temporal_ParticleSystem_C_BP_SetEnabled");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_BP_SetEnabled, NewState) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_BP_SetEnabled::NewState' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.LogDebug
// 0x0010 (0x0010 - 0x0000)
struct BP_Temporal_ParticleSystem_C_LogDebug final
{
public:
	class FString                                 Header;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_LogDebug) == 0x000008, "Wrong alignment on BP_Temporal_ParticleSystem_C_LogDebug");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_LogDebug) == 0x000010, "Wrong size on BP_Temporal_ParticleSystem_C_LogDebug");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_LogDebug, Header) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_LogDebug::Header' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.ParticleTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Temporal_ParticleSystem_C_ParticleTick final
{
public:
	float                                         LifeCylcle;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_ParticleTick) == 0x000004, "Wrong alignment on BP_Temporal_ParticleSystem_C_ParticleTick");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_ParticleTick) == 0x000004, "Wrong size on BP_Temporal_ParticleSystem_C_ParticleTick");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_ParticleTick, LifeCylcle) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_ParticleTick::LifeCylcle' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.OnParticleEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_Temporal_ParticleSystem_C_OnParticleEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_OnParticleEnabled) == 0x000001, "Wrong alignment on BP_Temporal_ParticleSystem_C_OnParticleEnabled");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_OnParticleEnabled) == 0x000001, "Wrong size on BP_Temporal_ParticleSystem_C_OnParticleEnabled");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_OnParticleEnabled, NewState) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_OnParticleEnabled::NewState' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.SetOnlyOwnerSeeConfig
// 0x0028 (0x0028 - 0x0000)
struct BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig final
{
public:
	bool                                          New_State;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig) == 0x000008, "Wrong alignment on BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig) == 0x000028, "Wrong size on BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, New_State) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::New_State' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_Temporal_ParticleSystem_C_SetOnlyOwnerSeeConfig::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.SetOwnerSeeConfig
// 0x0028 (0x0028 - 0x0000)
struct BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig final
{
public:
	bool                                          New_State;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig) == 0x000008, "Wrong alignment on BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig) == 0x000028, "Wrong size on BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, New_State) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::New_State' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_Temporal_ParticleSystem_C_SetOwnerSeeConfig::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.SetupEmitters
// 0x0088 (0x0088 - 0x0000)
struct BP_Temporal_ParticleSystem_C_SetupEmitters final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIntCVar_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWStaticMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_Temporal_Emitter_C*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Temporal_Emitter_C*                 CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_SetupEmitters) == 0x000008, "Wrong alignment on BP_Temporal_ParticleSystem_C_SetupEmitters");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_SetupEmitters) == 0x000088, "Wrong size on BP_Temporal_ParticleSystem_C_SetupEmitters");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_GetIntCVar_ReturnValue) == 0x000004, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_GetIntCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_FFloor_ReturnValue) == 0x000018, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Less_FloatFloat_ReturnValue) == 0x000043, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Add_ReturnValue) == 0x00004C, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000058, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Array_Add_ReturnValue_1) == 0x00007C, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_And_IntInt_ReturnValue) == 0x000080, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_Conv_IntToBool_ReturnValue) == 0x000084, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_SetupEmitters, CallFunc_BooleanAND_ReturnValue) == 0x000085, "Member 'BP_Temporal_ParticleSystem_C_SetupEmitters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Temporal_ParticleSystem.BP_Temporal_ParticleSystem_C.Recalculate
// 0x0150 (0x0150 - 0x0000)
struct BP_Temporal_ParticleSystem_C_Recalculate final
{
public:
	class UBP_Temporal_Emitter_C*                 Emitter_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWStaticMeshComponent*                 Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_First_Person;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Temporal_ParticleSystem_C_Recalculate) == 0x000010, "Wrong alignment on BP_Temporal_ParticleSystem_C_Recalculate");
static_assert(sizeof(BP_Temporal_ParticleSystem_C_Recalculate) == 0x000150, "Wrong size on BP_Temporal_ParticleSystem_C_Recalculate");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_Recalculate, Emitter_0) == 0x000000, "Member 'BP_Temporal_ParticleSystem_C_Recalculate::Emitter_0' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_Recalculate, Mesh) == 0x000008, "Member 'BP_Temporal_ParticleSystem_C_Recalculate::Mesh' has a wrong offset!");
static_assert(offsetof(BP_Temporal_ParticleSystem_C_Recalculate, is_First_Person) == 0x000010, "Member 'BP_Temporal_ParticleSystem_C_Recalculate::is_First_Person' has a wrong offset!");
