#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TutorialToolipManager

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TutorialToolipManager.BP_TutorialToolipManager_C
// 0x0030 (0x0318 - 0x02E8)
class ABP_TutorialToolipManager_C final : public ATWTutorialTooltipManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Tooltip_NoFire_C*                   BP_Tooltip_NoFire;                                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Tooltip_Targets_C*                  BP_Tooltip_Targets;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Tooltip_NoMovement_C*               BP_Tooltip_NoMovement;                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Tooltip_GameMode_C*                 BP_Tooltip_GameMode;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_TutorialToolipManager(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TutorialToolipManager_C">();
	}
	static class ABP_TutorialToolipManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TutorialToolipManager_C>();
	}
};
static_assert(alignof(ABP_TutorialToolipManager_C) == 0x000008, "Wrong alignment on ABP_TutorialToolipManager_C");
static_assert(sizeof(ABP_TutorialToolipManager_C) == 0x000318, "Wrong size on ABP_TutorialToolipManager_C");
static_assert(offsetof(ABP_TutorialToolipManager_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_TutorialToolipManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TutorialToolipManager_C, BP_Tooltip_NoFire) == 0x0002F0, "Member 'ABP_TutorialToolipManager_C::BP_Tooltip_NoFire' has a wrong offset!");
static_assert(offsetof(ABP_TutorialToolipManager_C, BP_Tooltip_Targets) == 0x0002F8, "Member 'ABP_TutorialToolipManager_C::BP_Tooltip_Targets' has a wrong offset!");
static_assert(offsetof(ABP_TutorialToolipManager_C, BP_Tooltip_NoMovement) == 0x000300, "Member 'ABP_TutorialToolipManager_C::BP_Tooltip_NoMovement' has a wrong offset!");
static_assert(offsetof(ABP_TutorialToolipManager_C, BP_Tooltip_GameMode) == 0x000308, "Member 'ABP_TutorialToolipManager_C::BP_Tooltip_GameMode' has a wrong offset!");
static_assert(offsetof(ABP_TutorialToolipManager_C, DefaultSceneRoot) == 0x000310, "Member 'ABP_TutorialToolipManager_C::DefaultSceneRoot' has a wrong offset!");

}

