#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Temporal_Emitter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Temporal_Emitter.BP_Temporal_Emitter_C.ExecuteUbergraph_BP_Temporal_Emitter
// 0x0028 (0x0028 - 0x0000)
struct BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Particle_System_Start_Time;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isFirstPerson;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter) == 0x000004, "Wrong alignment on BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter");
static_assert(sizeof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter) == 0x000028, "Wrong size on BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, EntryPoint) == 0x000000, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, Temp_bool_Variable) == 0x000004, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, Temp_float_Variable) == 0x000008, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, K2Node_CustomEvent_Particle_System_Start_Time) == 0x00000C, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::K2Node_CustomEvent_Particle_System_Start_Time' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, K2Node_CustomEvent_isFirstPerson) == 0x000010, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::K2Node_CustomEvent_isFirstPerson' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, K2Node_Select_Default) == 0x000014, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'BP_Temporal_Emitter_C_ExecuteUbergraph_BP_Temporal_Emitter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_Temporal_Emitter.BP_Temporal_Emitter_C.Initialize Emitter
// 0x0008 (0x0008 - 0x0000)
struct BP_Temporal_Emitter_C_Initialize_Emitter final
{
public:
	float                                         Particle_System_Start_Time;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPerson;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Temporal_Emitter_C_Initialize_Emitter) == 0x000004, "Wrong alignment on BP_Temporal_Emitter_C_Initialize_Emitter");
static_assert(sizeof(BP_Temporal_Emitter_C_Initialize_Emitter) == 0x000008, "Wrong size on BP_Temporal_Emitter_C_Initialize_Emitter");
static_assert(offsetof(BP_Temporal_Emitter_C_Initialize_Emitter, Particle_System_Start_Time) == 0x000000, "Member 'BP_Temporal_Emitter_C_Initialize_Emitter::Particle_System_Start_Time' has a wrong offset!");
static_assert(offsetof(BP_Temporal_Emitter_C_Initialize_Emitter, IsFirstPerson) == 0x000004, "Member 'BP_Temporal_Emitter_C_Initialize_Emitter::IsFirstPerson' has a wrong offset!");

}

