#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TWPlayerCameraManager

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "TimeWatch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.ExecuteUbergraph_BP_TWPlayerCameraManager
// 0x0038 (0x0038 - 0x0000)
struct BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager");
static_assert(sizeof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager) == 0x000038, "Wrong size on BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, EntryPoint) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000028, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_TWPlayerCameraManager_C_ExecuteUbergraph_BP_TWPlayerCameraManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.FindTransitionFXsMaxValues
// 0x000C (0x000C - 0x0000)
struct BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_2;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues) == 0x000004, "Wrong alignment on BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues");
static_assert(sizeof(BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues) == 0x00000C, "Wrong size on BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues");
static_assert(offsetof(BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000004, "Member 'BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues, CallFunc_GetScalarParameterValue_ReturnValue_2) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_FindTransitionFXsMaxValues::CallFunc_GetScalarParameterValue_ReturnValue_2' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.GetForwardAxisModifier
// 0x0060 (0x0060 - 0x0000)
struct BP_TWPlayerCameraManager_C_GetForwardAxisModifier final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_GetForwardAxisModifier");
static_assert(sizeof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier) == 0x000060, "Wrong size on BP_TWPlayerCameraManager_C_GetForwardAxisModifier");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, NewParam) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::NewParam' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetVelocity_ReturnValue) == 0x000024, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000030, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x00003C, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_GetForwardVector_ReturnValue) == 0x000048, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_Dot_VectorVector_ReturnValue) == 0x000054, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetForwardAxisModifier, CallFunc_FClamp_ReturnValue) == 0x00005C, "Member 'BP_TWPlayerCameraManager_C_GetForwardAxisModifier::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.GetUpAxisModifier
// 0x0068 (0x0068 - 0x0000)
struct BP_TWPlayerCameraManager_C_GetUpAxisModifier final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_GetUpAxisModifier) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_GetUpAxisModifier");
static_assert(sizeof(BP_TWPlayerCameraManager_C_GetUpAxisModifier) == 0x000068, "Wrong size on BP_TWPlayerCameraManager_C_GetUpAxisModifier");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, NewParam) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::NewParam' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetVelocity_ReturnValue) == 0x000024, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000030, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x00003C, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_GetUpVector_ReturnValue) == 0x000048, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_Dot_VectorVector_ReturnValue) == 0x000054, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetUpAxisModifier, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'BP_TWPlayerCameraManager_C_GetUpAxisModifier::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.GetRightAxisModifier
// 0x0068 (0x0068 - 0x0000)
struct BP_TWPlayerCameraManager_C_GetRightAxisModifier final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_GetRightAxisModifier) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_GetRightAxisModifier");
static_assert(sizeof(BP_TWPlayerCameraManager_C_GetRightAxisModifier) == 0x000068, "Wrong size on BP_TWPlayerCameraManager_C_GetRightAxisModifier");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, NewParam) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::NewParam' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetVelocity_ReturnValue) == 0x000024, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000030, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x00003C, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_GetRightVector_ReturnValue) == 0x000048, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_Dot_VectorVector_ReturnValue) == 0x000054, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetRightAxisModifier, CallFunc_FClamp_ReturnValue) == 0x000060, "Member 'BP_TWPlayerCameraManager_C_GetRightAxisModifier::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.GetHealthPPModifier
// 0x0048 (0x0048 - 0x0000)
struct BP_TWPlayerCameraManager_C_GetHealthPPModifier final
{
public:
	float                                         NewParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INGDDamageable>        CallFunc_GetHealth_self_CastInput;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_GetHealthPPModifier) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_GetHealthPPModifier");
static_assert(sizeof(BP_TWPlayerCameraManager_C_GetHealthPPModifier) == 0x000048, "Wrong size on BP_TWPlayerCameraManager_C_GetHealthPPModifier");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, NewParam) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::NewParam' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_GetHealth_self_CastInput) == 0x000028, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_GetHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_GetHealth_ReturnValue) == 0x000038, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_GetHealthPPModifier, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_TWPlayerCameraManager_C_GetHealthPPModifier::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_TWPlayerCameraManager.BP_TWPlayerCameraManager_C.OnGameStateChanged
// 0x0098 (0x0098 - 0x0000)
struct BP_TWPlayerCameraManager_C_OnGameStateChanged final
{
public:
	EFluxCapacitorStates                          OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0068(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0080(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TWPlayerCameraManager_C_OnGameStateChanged) == 0x000008, "Wrong alignment on BP_TWPlayerCameraManager_C_OnGameStateChanged");
static_assert(sizeof(BP_TWPlayerCameraManager_C_OnGameStateChanged) == 0x000098, "Wrong size on BP_TWPlayerCameraManager_C_OnGameStateChanged");
static_assert(offsetof(BP_TWPlayerCameraManager_C_OnGameStateChanged, OldState) == 0x000000, "Member 'BP_TWPlayerCameraManager_C_OnGameStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_OnGameStateChanged, NewState) == 0x000001, "Member 'BP_TWPlayerCameraManager_C_OnGameStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_TWPlayerCameraManager_C_OnGameStateChanged, Temp_delegate_Variable) == 0x000004, "Member 'BP_TWPlayerCameraManager_C_OnGameStateChanged::Temp_delegate_Variable' has a wrong offset!");
