#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tooltip_NoFire

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_TooltipTutorialListener_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Tooltip_NoFire.BP_Tooltip_NoFire_C
// 0x0010 (0x0118 - 0x0108)
class UBP_Tooltip_NoFire_C final : public UBP_TooltipTutorialListener_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RemainingTimeNoFire;                               // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainingTimeNoFire_Current;                       // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Tooltip_NoFire(int32 EntryPoint);
	void BasicActionUse(ETWBasicPlayerAction BasicPlayerActionUse);
	void OnRoundStarted(int32 CurrentLoop);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Tooltip_NoFire_C">();
	}
	static class UBP_Tooltip_NoFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Tooltip_NoFire_C>();
	}
};
static_assert(alignof(UBP_Tooltip_NoFire_C) == 0x000008, "Wrong alignment on UBP_Tooltip_NoFire_C");
static_assert(sizeof(UBP_Tooltip_NoFire_C) == 0x000118, "Wrong size on UBP_Tooltip_NoFire_C");
static_assert(offsetof(UBP_Tooltip_NoFire_C, UberGraphFrame) == 0x000108, "Member 'UBP_Tooltip_NoFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_NoFire_C, RemainingTimeNoFire) == 0x000110, "Member 'UBP_Tooltip_NoFire_C::RemainingTimeNoFire' has a wrong offset!");
static_assert(offsetof(UBP_Tooltip_NoFire_C, RemainingTimeNoFire_Current) == 0x000114, "Member 'UBP_Tooltip_NoFire_C::RemainingTimeNoFire_Current' has a wrong offset!");

}

