#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Toure_Training_Customization

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Toure_Training_Customization.BP_Toure_Training_Customization_C.ExecuteUbergraph_BP_Toure_Training_Customization
// 0x0008 (0x0008 - 0x0000)
struct BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization) == 0x000004, "Wrong alignment on BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization");
static_assert(sizeof(BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization) == 0x000008, "Wrong size on BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization");
static_assert(offsetof(BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization, EntryPoint) == 0x000000, "Member 'BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'BP_Toure_Training_Customization_C_ExecuteUbergraph_BP_Toure_Training_Customization::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function BP_Toure_Training_Customization.BP_Toure_Training_Customization_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_Toure_Training_Customization_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Toure_Training_Customization_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_Toure_Training_Customization_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_Toure_Training_Customization_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_Toure_Training_Customization_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_Toure_Training_Customization_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_Toure_Training_Customization_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

