#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TooltipTutorialListener

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TooltipTutorialListener.BP_TooltipTutorialListener_C.UpdateLocks
// 0x0010 (0x0010 - 0x0000)
struct BP_TooltipTutorialListener_C_UpdateLocks final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TooltipTutorialListener_C_UpdateLocks) == 0x000004, "Wrong alignment on BP_TooltipTutorialListener_C_UpdateLocks");
static_assert(sizeof(BP_TooltipTutorialListener_C_UpdateLocks) == 0x000010, "Wrong size on BP_TooltipTutorialListener_C_UpdateLocks");
static_assert(offsetof(BP_TooltipTutorialListener_C_UpdateLocks, Temp_int_Variable) == 0x000000, "Member 'BP_TooltipTutorialListener_C_UpdateLocks::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_UpdateLocks, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_TooltipTutorialListener_C_UpdateLocks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_UpdateLocks, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'BP_TooltipTutorialListener_C_UpdateLocks::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_UpdateLocks, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_TooltipTutorialListener_C_UpdateLocks::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_TooltipTutorialListener.BP_TooltipTutorialListener_C.CheckLocks
// 0x000C (0x000C - 0x0000)
struct BP_TooltipTutorialListener_C_CheckLocks final
{
public:
	bool                                          LocksPassed;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TooltipTutorialListener_C_CheckLocks) == 0x000004, "Wrong alignment on BP_TooltipTutorialListener_C_CheckLocks");
static_assert(sizeof(BP_TooltipTutorialListener_C_CheckLocks) == 0x00000C, "Wrong size on BP_TooltipTutorialListener_C_CheckLocks");
static_assert(offsetof(BP_TooltipTutorialListener_C_CheckLocks, LocksPassed) == 0x000000, "Member 'BP_TooltipTutorialListener_C_CheckLocks::LocksPassed' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_CheckLocks, CallFunc_GetTimeSeconds_ReturnValue) == 0x000004, "Member 'BP_TooltipTutorialListener_C_CheckLocks::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_CheckLocks, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_TooltipTutorialListener_C_CheckLocks::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_CheckLocks, CallFunc_Less_IntInt_ReturnValue) == 0x000009, "Member 'BP_TooltipTutorialListener_C_CheckLocks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TooltipTutorialListener_C_CheckLocks, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'BP_TooltipTutorialListener_C_CheckLocks::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

