#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tooltip_NoFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TimeWatch_structs.hpp"


namespace SDK::Params
{

// Function BP_Tooltip_NoFire.BP_Tooltip_NoFire_C.ExecuteUbergraph_BP_Tooltip_NoFire
// 0x0108 (0x0108 - 0x0000)
struct BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TutorialToolipManager_C*            K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentLoop;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETWBasicPlayerAction                          K2Node_CustomEvent_BasicPlayerActionUse;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CurrentRound)>           K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ETWBasicPlayerAction BasicPlayerActionUse)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayActive_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetActionKeyFriendlyName_ReturnValue;     // 0x0080(0x0018)()
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire) == 0x000008, "Wrong alignment on BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire");
static_assert(sizeof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire) == 0x000108, "Wrong size on BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, EntryPoint) == 0x000000, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager) == 0x000018, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_DynamicCast_AsBP_Tutorial_Toolip_Manager' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_CustomEvent_CurrentLoop) == 0x000024, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_CustomEvent_CurrentLoop' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_CustomEvent_BasicPlayerActionUse) == 0x000028, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_CustomEvent_BasicPlayerActionUse' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003C, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000060, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_IsGameplayActive_ReturnValue) == 0x000069, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_IsGameplayActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00006B, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00006C, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_GetActionKeyFriendlyName_ReturnValue) == 0x000080, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_GetActionKeyFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_FMax_ReturnValue) == 0x000098, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'BP_Tooltip_NoFire_C_ExecuteUbergraph_BP_Tooltip_NoFire::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_Tooltip_NoFire.BP_Tooltip_NoFire_C.BasicActionUse
// 0x0001 (0x0001 - 0x0000)
struct BP_Tooltip_NoFire_C_BasicActionUse final
{
public:
	ETWBasicPlayerAction                          BasicPlayerActionUse;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tooltip_NoFire_C_BasicActionUse) == 0x000001, "Wrong alignment on BP_Tooltip_NoFire_C_BasicActionUse");
static_assert(sizeof(BP_Tooltip_NoFire_C_BasicActionUse) == 0x000001, "Wrong size on BP_Tooltip_NoFire_C_BasicActionUse");
static_assert(offsetof(BP_Tooltip_NoFire_C_BasicActionUse, BasicPlayerActionUse) == 0x000000, "Member 'BP_Tooltip_NoFire_C_BasicActionUse::BasicPlayerActionUse' has a wrong offset!");

// Function BP_Tooltip_NoFire.BP_Tooltip_NoFire_C.OnRoundStarted
// 0x0004 (0x0004 - 0x0000)
struct BP_Tooltip_NoFire_C_OnRoundStarted final
{
public:
	int32                                         CurrentLoop;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tooltip_NoFire_C_OnRoundStarted) == 0x000004, "Wrong alignment on BP_Tooltip_NoFire_C_OnRoundStarted");
static_assert(sizeof(BP_Tooltip_NoFire_C_OnRoundStarted) == 0x000004, "Wrong size on BP_Tooltip_NoFire_C_OnRoundStarted");
static_assert(offsetof(BP_Tooltip_NoFire_C_OnRoundStarted, CurrentLoop) == 0x000000, "Member 'BP_Tooltip_NoFire_C_OnRoundStarted::CurrentLoop' has a wrong offset!");

// Function BP_Tooltip_NoFire.BP_Tooltip_NoFire_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Tooltip_NoFire_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tooltip_NoFire_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Tooltip_NoFire_C_ReceiveTick");
static_assert(sizeof(BP_Tooltip_NoFire_C_ReceiveTick) == 0x000004, "Wrong size on BP_Tooltip_NoFire_C_ReceiveTick");
static_assert(offsetof(BP_Tooltip_NoFire_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Tooltip_NoFire_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

