#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TemporalParticle

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TemporalParticle.BP_TemporalParticle_C
// 0x0018 (0x0250 - 0x0238)
class ABP_TemporalParticle_C : public ATemporalParticle
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    TWGamestate;                                       // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TemporalParticle_C">();
	}
	static class ABP_TemporalParticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TemporalParticle_C>();
	}
};
static_assert(alignof(ABP_TemporalParticle_C) == 0x000008, "Wrong alignment on ABP_TemporalParticle_C");
static_assert(sizeof(ABP_TemporalParticle_C) == 0x000250, "Wrong size on ABP_TemporalParticle_C");
static_assert(offsetof(ABP_TemporalParticle_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_TemporalParticle_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TemporalParticle_C, IsActive) == 0x000240, "Member 'ABP_TemporalParticle_C::IsActive' has a wrong offset!");
static_assert(offsetof(ABP_TemporalParticle_C, TWGamestate) == 0x000248, "Member 'ABP_TemporalParticle_C::TWGamestate' has a wrong offset!");

}

