#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_Sniper_MuzzleFlash

#include "Basic.hpp"

#include "BP_Temporal_ParticleSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VFX_Sniper_MuzzleFlash.BP_VFX_Sniper_MuzzleFlash_C
// 0x0038 (0x02C0 - 0x0288)
class ABP_VFX_Sniper_MuzzleFlash_C final : public ABP_Temporal_ParticleSystem_C
{
public:
	class UBP_Temporal_Emitter_C*                 Emitter_Mesh_Muzzle_Central;                       // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Mesh_Muzzle_Sides;                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Muzzle_Flare;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Mesh_Muzzle_Radial_Cover;                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Muzzle_Ribbon;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Mesh_Muzzle_Radial_Big;                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Mesh_Muzzle;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VFX_Sniper_MuzzleFlash_C">();
	}
	static class ABP_VFX_Sniper_MuzzleFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VFX_Sniper_MuzzleFlash_C>();
	}
};
static_assert(alignof(ABP_VFX_Sniper_MuzzleFlash_C) == 0x000008, "Wrong alignment on ABP_VFX_Sniper_MuzzleFlash_C");
static_assert(sizeof(ABP_VFX_Sniper_MuzzleFlash_C) == 0x0002C0, "Wrong size on ABP_VFX_Sniper_MuzzleFlash_C");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Mesh_Muzzle_Central) == 0x000288, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Mesh_Muzzle_Central' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Mesh_Muzzle_Sides) == 0x000290, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Mesh_Muzzle_Sides' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Muzzle_Flare) == 0x000298, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Muzzle_Flare' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Mesh_Muzzle_Radial_Cover) == 0x0002A0, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Mesh_Muzzle_Radial_Cover' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Muzzle_Ribbon) == 0x0002A8, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Muzzle_Ribbon' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Mesh_Muzzle_Radial_Big) == 0x0002B0, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Mesh_Muzzle_Radial_Big' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Sniper_MuzzleFlash_C, Emitter_Mesh_Muzzle) == 0x0002B8, "Member 'ABP_VFX_Sniper_MuzzleFlash_C::Emitter_Mesh_Muzzle' has a wrong offset!");

}

