#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VFX_Barrel_Explosion_New_Toon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Temporal_ParticleSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VFX_Barrel_Explosion_New_Toon.BP_VFX_Barrel_Explosion_New_Toon_C
// 0x0090 (0x0318 - 0x0288)
class ABP_VFX_Barrel_Explosion_New_Toon_C final : public ABP_Temporal_ParticleSystem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_VFX_Barrel_Explosion_New_Toon_C; // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Small_Sparks;                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Spark_Strike;                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Fire_Strike;                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Medium_Trans;                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Big_B_Trans;                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Big_Trans;                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Big_B;                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Medium;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Big;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Mesh_Small;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Flare;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Smoke;                                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 EmitterBase_Sphere_AoE;                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Sparks_Strike_Fast;                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Sparks_Strikes;                     // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Ribbon_Escombros_Up;                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Temporal_Emitter_C*                 Emitter_Escombros_Barrel_Parts_Billboard;          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VFX_Barrel_Explosion_New_Toon(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VFX_Barrel_Explosion_New_Toon_C">();
	}
	static class ABP_VFX_Barrel_Explosion_New_Toon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VFX_Barrel_Explosion_New_Toon_C>();
	}
};
static_assert(alignof(ABP_VFX_Barrel_Explosion_New_Toon_C) == 0x000008, "Wrong alignment on ABP_VFX_Barrel_Explosion_New_Toon_C");
static_assert(sizeof(ABP_VFX_Barrel_Explosion_New_Toon_C) == 0x000318, "Wrong size on ABP_VFX_Barrel_Explosion_New_Toon_C");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, UberGraphFrame_BP_VFX_Barrel_Explosion_New_Toon_C) == 0x000288, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::UberGraphFrame_BP_VFX_Barrel_Explosion_New_Toon_C' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Small_Sparks) == 0x000290, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Small_Sparks' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Spark_Strike) == 0x000298, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Spark_Strike' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Fire_Strike) == 0x0002A0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Fire_Strike' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Medium_Trans) == 0x0002A8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Medium_Trans' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Big_B_Trans) == 0x0002B0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Big_B_Trans' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Big_Trans) == 0x0002B8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Big_Trans' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Big_B) == 0x0002C0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Big_B' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Medium) == 0x0002C8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Medium' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Big) == 0x0002D0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Big' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Mesh_Small) == 0x0002D8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Mesh_Small' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Flare) == 0x0002E0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Flare' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Smoke) == 0x0002E8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Smoke' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, EmitterBase_Sphere_AoE) == 0x0002F0, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::EmitterBase_Sphere_AoE' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Sparks_Strike_Fast) == 0x0002F8, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Sparks_Strike_Fast' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Sparks_Strikes) == 0x000300, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Sparks_Strikes' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Ribbon_Escombros_Up) == 0x000308, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Ribbon_Escombros_Up' has a wrong offset!");
static_assert(offsetof(ABP_VFX_Barrel_Explosion_New_Toon_C, Emitter_Escombros_Barrel_Parts_Billboard) == 0x000310, "Member 'ABP_VFX_Barrel_Explosion_New_Toon_C::Emitter_Escombros_Barrel_Parts_Billboard' has a wrong offset!");

}

