#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_BulletTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_BulletTrail.BPC_BulletTrail_C
// 0x0048 (0x00F8 - 0x00B0)
class UBPC_BulletTrail_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystem*                        Trail_Particle_Template;                           // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeStopGrowing;                                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletSpawnTime;                                   // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BulletSpawnPosition;                               // 0x00C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Trail_Particle_FP;                                 // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletImpactTime;                                  // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail_Particle_TP;                                 // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnedVelocity;                                   // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_BulletTrail(int32 EntryPoint);
	void Trail_VFX___SetEnabled(bool NewState);
	void Trail_VFX___Construct(class USceneComponent* FP_AttachComp, class USceneComponent* TP_AttachComp);
	void Trail_VFX___Bullet_Hit(float Bullet_Impact_Time);
	void Trail_VFX___Update(const struct FVector& Bullet_Current_Position__ws_);
	void Trail_VFX___Initialize(float TrailLengthTime, float TimeAtBulletSpawn, const struct FVector& Bullet_Spawn_Position__ws_, const struct FVector& Color);
	void Initialize(float InTrailLengthAsTime, float SpawnTimestamp, const struct FVector& SpawnPosition, const struct FVector& Color);
	void Construct(class USceneComponent* FP_AttachComp, class USceneComponent* TP_AttachComp);
	void IsAnimationComplete(bool* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_BulletTrail_C">();
	}
	static class UBPC_BulletTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_BulletTrail_C>();
	}
};
static_assert(alignof(UBPC_BulletTrail_C) == 0x000008, "Wrong alignment on UBPC_BulletTrail_C");
static_assert(sizeof(UBPC_BulletTrail_C) == 0x0000F8, "Wrong size on UBPC_BulletTrail_C");
static_assert(offsetof(UBPC_BulletTrail_C, UberGraphFrame) == 0x0000B0, "Member 'UBPC_BulletTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, Trail_Particle_Template) == 0x0000B8, "Member 'UBPC_BulletTrail_C::Trail_Particle_Template' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, TimeStopGrowing) == 0x0000C0, "Member 'UBPC_BulletTrail_C::TimeStopGrowing' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, BulletSpawnTime) == 0x0000C4, "Member 'UBPC_BulletTrail_C::BulletSpawnTime' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, BulletSpawnPosition) == 0x0000C8, "Member 'UBPC_BulletTrail_C::BulletSpawnPosition' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, Trail_Particle_FP) == 0x0000D8, "Member 'UBPC_BulletTrail_C::Trail_Particle_FP' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, BulletImpactTime) == 0x0000E0, "Member 'UBPC_BulletTrail_C::BulletImpactTime' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, CurrentTime) == 0x0000E4, "Member 'UBPC_BulletTrail_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, Trail_Particle_TP) == 0x0000E8, "Member 'UBPC_BulletTrail_C::Trail_Particle_TP' has a wrong offset!");
static_assert(offsetof(UBPC_BulletTrail_C, SpawnedVelocity) == 0x0000F0, "Member 'UBPC_BulletTrail_C::SpawnedVelocity' has a wrong offset!");

}

