#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_OnDeath

#include "Basic.hpp"

#include "UnrealProject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraModifier_OnDeath.CameraModifier_OnDeath_C
// 0x0018 (0x00B0 - 0x0098)
class UCameraModifier_OnDeath_C final : public UNGDCameraModifier
{
public:
	float                                         EffectDilatiation;                                 // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            FOVCurve;                                          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTimer;                                      // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurveScale;                                        // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BlueprintIsModifierActive();
	void BlueprintModifyPostProcess(float DeltaTime, float* PostProcessBlendWeight, struct FPostProcessSettings* PostProcessSettings);
	void BlueprintOverrideAlpha(float* OutNewAlpha);
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, struct FVector* NewViewLocation, struct FRotator* NewViewRotation, float* NewFOV);
	float GetDeathAlphaValue(float Length);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraModifier_OnDeath_C">();
	}
	static class UCameraModifier_OnDeath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraModifier_OnDeath_C>();
	}
};
static_assert(alignof(UCameraModifier_OnDeath_C) == 0x000008, "Wrong alignment on UCameraModifier_OnDeath_C");
static_assert(sizeof(UCameraModifier_OnDeath_C) == 0x0000B0, "Wrong size on UCameraModifier_OnDeath_C");
static_assert(offsetof(UCameraModifier_OnDeath_C, EffectDilatiation) == 0x000098, "Member 'UCameraModifier_OnDeath_C::EffectDilatiation' has a wrong offset!");
static_assert(offsetof(UCameraModifier_OnDeath_C, FOVCurve) == 0x0000A0, "Member 'UCameraModifier_OnDeath_C::FOVCurve' has a wrong offset!");
static_assert(offsetof(UCameraModifier_OnDeath_C, CurrentTimer) == 0x0000A8, "Member 'UCameraModifier_OnDeath_C::CurrentTimer' has a wrong offset!");
static_assert(offsetof(UCameraModifier_OnDeath_C, CurveScale) == 0x0000AC, "Member 'UCameraModifier_OnDeath_C::CurveScale' has a wrong offset!");

}

