#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_Rewind

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraModifier_Rewind.CameraModifier_Rewind_C.BlueprintIsModifierActive
// 0x0020 (0x0020 - 0x0000)
struct CameraModifier_Rewind_C_BlueprintIsModifierActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraModifier_Rewind_C_BlueprintIsModifierActive) == 0x000008, "Wrong alignment on CameraModifier_Rewind_C_BlueprintIsModifierActive");
static_assert(sizeof(CameraModifier_Rewind_C_BlueprintIsModifierActive) == 0x000020, "Wrong size on CameraModifier_Rewind_C_BlueprintIsModifierActive");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintIsModifierActive, ReturnValue) == 0x000000, "Member 'CameraModifier_Rewind_C_BlueprintIsModifierActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintIsModifierActive, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'CameraModifier_Rewind_C_BlueprintIsModifierActive::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintIsModifierActive, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000010, "Member 'CameraModifier_Rewind_C_BlueprintIsModifierActive::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintIsModifierActive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CameraModifier_Rewind_C_BlueprintIsModifierActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintIsModifierActive, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'CameraModifier_Rewind_C_BlueprintIsModifierActive::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CameraModifier_Rewind.CameraModifier_Rewind_C.BlueprintModifyPostProcess
// 0x0540 (0x0540 - 0x0000)
struct CameraModifier_Rewind_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0530)(Parm, OutParm)
};
static_assert(alignof(CameraModifier_Rewind_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on CameraModifier_Rewind_C_BlueprintModifyPostProcess");
static_assert(sizeof(CameraModifier_Rewind_C_BlueprintModifyPostProcess) == 0x000540, "Wrong size on CameraModifier_Rewind_C_BlueprintModifyPostProcess");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'CameraModifier_Rewind_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'CameraModifier_Rewind_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'CameraModifier_Rewind_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");

// Function CameraModifier_Rewind.CameraModifier_Rewind_C.ApplyCustomParameterModifier
// 0x0080 (0x0080 - 0x0000)
struct CameraModifier_Rewind_C_ApplyCustomParameterModifier final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InBaseValue;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutBaseValue;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TWPlayerCameraManager_C*            K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardAxisModifier_NewParam;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TWPlayerCameraManager_C*            K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardAxisModifier_NewParam_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TWPlayerCameraManager_C*            K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardAxisModifier_NewParam_2;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_Rewind_C_ApplyCustomParameterModifier) == 0x000008, "Wrong alignment on CameraModifier_Rewind_C_ApplyCustomParameterModifier");
static_assert(sizeof(CameraModifier_Rewind_C_ApplyCustomParameterModifier) == 0x000080, "Wrong size on CameraModifier_Rewind_C_ApplyCustomParameterModifier");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, ParameterName) == 0x000000, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::ParameterName' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, InBaseValue) == 0x000008, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::InBaseValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, OutBaseValue) == 0x00000C, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::OutBaseValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager) == 0x000020, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetForwardAxisModifier_NewParam) == 0x00002C, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetForwardAxisModifier_NewParam' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000038, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_1) == 0x000048, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetForwardAxisModifier_NewParam_1) == 0x000054, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetForwardAxisModifier_NewParam_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000058, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x000060, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_2) == 0x000068, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_AsBP_TWPlayer_Camera_Manager_2' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_GetForwardAxisModifier_NewParam_2) == 0x000074, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_GetForwardAxisModifier_NewParam_2' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000078, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_ApplyCustomParameterModifier, CallFunc_Multiply_FloatFloat_ReturnValue_5) == 0x00007C, "Member 'CameraModifier_Rewind_C_ApplyCustomParameterModifier::CallFunc_Multiply_FloatFloat_ReturnValue_5' has a wrong offset!");

// Function CameraModifier_Rewind.CameraModifier_Rewind_C.BlueprintOverrideAlpha
// 0x0020 (0x0020 - 0x0000)
struct CameraModifier_Rewind_C_BlueprintOverrideAlpha final
{
public:
	float                                         OutNewAlpha;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCosmeticRemainingRelativeTime_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_Rewind_C_BlueprintOverrideAlpha) == 0x000008, "Wrong alignment on CameraModifier_Rewind_C_BlueprintOverrideAlpha");
static_assert(sizeof(CameraModifier_Rewind_C_BlueprintOverrideAlpha) == 0x000020, "Wrong size on CameraModifier_Rewind_C_BlueprintOverrideAlpha");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintOverrideAlpha, OutNewAlpha) == 0x000000, "Member 'CameraModifier_Rewind_C_BlueprintOverrideAlpha::OutNewAlpha' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintOverrideAlpha, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'CameraModifier_Rewind_C_BlueprintOverrideAlpha::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintOverrideAlpha, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000010, "Member 'CameraModifier_Rewind_C_BlueprintOverrideAlpha::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintOverrideAlpha, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CameraModifier_Rewind_C_BlueprintOverrideAlpha::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_Rewind_C_BlueprintOverrideAlpha, CallFunc_GetCosmeticRemainingRelativeTime_ReturnValue) == 0x00001C, "Member 'CameraModifier_Rewind_C_BlueprintOverrideAlpha::CallFunc_GetCosmeticRemainingRelativeTime_ReturnValue' has a wrong offset!");

}

