#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_OnRevive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraModifier_OnRevive.CameraModifier_OnRevive_C.BlueprintIsModifierActive
// 0x000C (0x000C - 0x0000)
struct CameraModifier_OnRevive_C_BlueprintIsModifierActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetReviveAlphaValue_Alpha;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraModifier_OnRevive_C_BlueprintIsModifierActive) == 0x000004, "Wrong alignment on CameraModifier_OnRevive_C_BlueprintIsModifierActive");
static_assert(sizeof(CameraModifier_OnRevive_C_BlueprintIsModifierActive) == 0x00000C, "Wrong size on CameraModifier_OnRevive_C_BlueprintIsModifierActive");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintIsModifierActive, ReturnValue) == 0x000000, "Member 'CameraModifier_OnRevive_C_BlueprintIsModifierActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintIsModifierActive, CallFunc_GetReviveAlphaValue_Alpha) == 0x000004, "Member 'CameraModifier_OnRevive_C_BlueprintIsModifierActive::CallFunc_GetReviveAlphaValue_Alpha' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintIsModifierActive, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'CameraModifier_OnRevive_C_BlueprintIsModifierActive::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function CameraModifier_OnRevive.CameraModifier_OnRevive_C.BlueprintModifyCamera
// 0x004C (0x004C - 0x0000)
struct CameraModifier_OnRevive_C_BlueprintModifyCamera final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ViewLocation;                                      // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ViewRotation;                                      // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         FOV;                                               // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewViewLocation;                                   // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewViewRotation;                                   // 0x002C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewFOV;                                            // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetReviveAlphaValue_Alpha;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_OnRevive_C_BlueprintModifyCamera) == 0x000004, "Wrong alignment on CameraModifier_OnRevive_C_BlueprintModifyCamera");
static_assert(sizeof(CameraModifier_OnRevive_C_BlueprintModifyCamera) == 0x00004C, "Wrong size on CameraModifier_OnRevive_C_BlueprintModifyCamera");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, DeltaTime) == 0x000000, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, ViewLocation) == 0x000004, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::ViewLocation' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, ViewRotation) == 0x000010, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::ViewRotation' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, FOV) == 0x00001C, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::FOV' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, NewViewLocation) == 0x000020, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::NewViewLocation' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, NewViewRotation) == 0x00002C, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::NewViewRotation' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, NewFOV) == 0x000038, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::NewFOV' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, CallFunc_GetReviveAlphaValue_Alpha) == 0x00003C, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::CallFunc_GetReviveAlphaValue_Alpha' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, CallFunc_GetFloatValue_ReturnValue) == 0x000040, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyCamera, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'CameraModifier_OnRevive_C_BlueprintModifyCamera::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function CameraModifier_OnRevive.CameraModifier_OnRevive_C.BlueprintOverrideAlpha
// 0x0004 (0x0004 - 0x0000)
struct CameraModifier_OnRevive_C_BlueprintOverrideAlpha final
{
public:
	float                                         OutNewAlpha;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_OnRevive_C_BlueprintOverrideAlpha) == 0x000004, "Wrong alignment on CameraModifier_OnRevive_C_BlueprintOverrideAlpha");
static_assert(sizeof(CameraModifier_OnRevive_C_BlueprintOverrideAlpha) == 0x000004, "Wrong size on CameraModifier_OnRevive_C_BlueprintOverrideAlpha");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintOverrideAlpha, OutNewAlpha) == 0x000000, "Member 'CameraModifier_OnRevive_C_BlueprintOverrideAlpha::OutNewAlpha' has a wrong offset!");

// Function CameraModifier_OnRevive.CameraModifier_OnRevive_C.BlueprintModifyPostProcess
// 0x0550 (0x0550 - 0x0000)
struct CameraModifier_OnRevive_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0530)(Parm, OutParm)
	float                                         CallFunc_GetReviveAlphaValue_Alpha;                // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on CameraModifier_OnRevive_C_BlueprintModifyPostProcess");
static_assert(sizeof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess) == 0x000550, "Wrong size on CameraModifier_OnRevive_C_BlueprintModifyPostProcess");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'CameraModifier_OnRevive_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'CameraModifier_OnRevive_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'CameraModifier_OnRevive_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_BlueprintModifyPostProcess, CallFunc_GetReviveAlphaValue_Alpha) == 0x000540, "Member 'CameraModifier_OnRevive_C_BlueprintModifyPostProcess::CallFunc_GetReviveAlphaValue_Alpha' has a wrong offset!");

// Function CameraModifier_OnRevive.CameraModifier_OnRevive_C.GetReviveAlphaValue
// 0x0038 (0x0038 - 0x0000)
struct CameraModifier_OnRevive_C_GetReviveAlphaValue final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha_0;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_OnRevive_C_GetReviveAlphaValue) == 0x000008, "Wrong alignment on CameraModifier_OnRevive_C_GetReviveAlphaValue");
static_assert(sizeof(CameraModifier_OnRevive_C_GetReviveAlphaValue) == 0x000038, "Wrong size on CameraModifier_OnRevive_C_GetReviveAlphaValue");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, Length) == 0x000000, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::Length' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, Alpha_0) == 0x000004, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::Alpha_0' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000008, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_FClamp_ReturnValue) == 0x00002C, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_OnRevive_C_GetReviveAlphaValue, CallFunc_GetFloatValue_ReturnValue) == 0x000030, "Member 'CameraModifier_OnRevive_C_GetReviveAlphaValue::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");

}

