#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_ReducedDamage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraModifier_ReducedDamage.CameraModifier_ReducedDamage_C.BlueprintIsModifierActive
// 0x0020 (0x0020 - 0x0000)
struct CameraModifier_ReducedDamage_C_BlueprintIsModifierActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive) == 0x000008, "Wrong alignment on CameraModifier_ReducedDamage_C_BlueprintIsModifierActive");
static_assert(sizeof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive) == 0x000020, "Wrong size on CameraModifier_ReducedDamage_C_BlueprintIsModifierActive");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, ReturnValue) == 0x000000, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000010, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintIsModifierActive, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'CameraModifier_ReducedDamage_C_BlueprintIsModifierActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CameraModifier_ReducedDamage.CameraModifier_ReducedDamage_C.BlueprintModifyPostProcess
// 0x0540 (0x0540 - 0x0000)
struct CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0530)(Parm, OutParm)
};
static_assert(alignof(CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess");
static_assert(sizeof(CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess) == 0x000540, "Wrong size on CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'CameraModifier_ReducedDamage_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");

}

