#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraModifier_RunFaster

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CameraModifier_RunFaster.CameraModifier_RunFaster_C.BlueprintIsModifierActive
// 0x0040 (0x0040 - 0x0000)
struct CameraModifier_RunFaster_C_BlueprintIsModifierActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INGDDamageable>        CallFunc_IsAlive_self_CastInput;                   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraModifier_RunFaster_C_BlueprintIsModifierActive) == 0x000008, "Wrong alignment on CameraModifier_RunFaster_C_BlueprintIsModifierActive");
static_assert(sizeof(CameraModifier_RunFaster_C_BlueprintIsModifierActive) == 0x000040, "Wrong size on CameraModifier_RunFaster_C_BlueprintIsModifierActive");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, ReturnValue) == 0x000000, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000010, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_IsAlive_self_CastInput) == 0x000028, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_IsAlive_self_CastInput' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_IsAlive_ReturnValue) == 0x000038, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintIsModifierActive, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'CameraModifier_RunFaster_C_BlueprintIsModifierActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CameraModifier_RunFaster.CameraModifier_RunFaster_C.BlueprintModifyPostProcess
// 0x0540 (0x0540 - 0x0000)
struct CameraModifier_RunFaster_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0530)(Parm, OutParm)
};
static_assert(alignof(CameraModifier_RunFaster_C_BlueprintModifyPostProcess) == 0x000010, "Wrong alignment on CameraModifier_RunFaster_C_BlueprintModifyPostProcess");
static_assert(sizeof(CameraModifier_RunFaster_C_BlueprintModifyPostProcess) == 0x000540, "Wrong size on CameraModifier_RunFaster_C_BlueprintModifyPostProcess");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintModifyPostProcess, DeltaTime) == 0x000000, "Member 'CameraModifier_RunFaster_C_BlueprintModifyPostProcess::DeltaTime' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintModifyPostProcess, PostProcessBlendWeight) == 0x000004, "Member 'CameraModifier_RunFaster_C_BlueprintModifyPostProcess::PostProcessBlendWeight' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_BlueprintModifyPostProcess, PostProcessSettings) == 0x000010, "Member 'CameraModifier_RunFaster_C_BlueprintModifyPostProcess::PostProcessSettings' has a wrong offset!");

// Function CameraModifier_RunFaster.CameraModifier_RunFaster_C.GetProgress
// 0x0028 (0x0028 - 0x0000)
struct CameraModifier_RunFaster_C_GetProgress final
{
public:
	float                                         Actual;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinValue;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Progress;                                          // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewLocalVar_0;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CameraModifier_RunFaster_C_GetProgress) == 0x000004, "Wrong alignment on CameraModifier_RunFaster_C_GetProgress");
static_assert(sizeof(CameraModifier_RunFaster_C_GetProgress) == 0x000028, "Wrong size on CameraModifier_RunFaster_C_GetProgress");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, Actual) == 0x000000, "Member 'CameraModifier_RunFaster_C_GetProgress::Actual' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, MaxValue) == 0x000004, "Member 'CameraModifier_RunFaster_C_GetProgress::MaxValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, MinValue) == 0x000008, "Member 'CameraModifier_RunFaster_C_GetProgress::MinValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, Progress) == 0x00000C, "Member 'CameraModifier_RunFaster_C_GetProgress::Progress' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, NewLocalVar_0) == 0x000010, "Member 'CameraModifier_RunFaster_C_GetProgress::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'CameraModifier_RunFaster_C_GetProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000018, "Member 'CameraModifier_RunFaster_C_GetProgress::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'CameraModifier_RunFaster_C_GetProgress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'CameraModifier_RunFaster_C_GetProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraModifier_RunFaster_C_GetProgress, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'CameraModifier_RunFaster_C_GetProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");

}

