#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaptureCompass

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CaptureCompass.CaptureCompass_C
// 0x0070 (0x0358 - 0x02E8)
class UCaptureCompass_C final : public UCaptureCompassWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_162;                                         // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_164;                                         // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_196;                                         // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outer_Reach;                                       // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NameOnClearState;                             // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NameOnContestedState;                         // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NameOnDefendState;                            // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NameOnNeutralState;                           // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_249;                                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_252;                                     // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_254;                                     // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_258;                                     // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CaptureCompass(int32 EntryPoint);
	void OnStateChanged(ECaptureState NewState, const struct FLinearColor& Color);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	ESlateVisibility GetStrokeVisibility();
	class FText GetPointName();
	ESlateVisibility Get_Point_State_Visibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CaptureCompass_C">();
	}
	static class UCaptureCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureCompass_C>();
	}
};
static_assert(alignof(UCaptureCompass_C) == 0x000008, "Wrong alignment on UCaptureCompass_C");
static_assert(sizeof(UCaptureCompass_C) == 0x000358, "Wrong size on UCaptureCompass_C");
static_assert(offsetof(UCaptureCompass_C, UberGraphFrame) == 0x0002E8, "Member 'UCaptureCompass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Image_162) == 0x0002F0, "Member 'UCaptureCompass_C::Image_162' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Image_164) == 0x0002F8, "Member 'UCaptureCompass_C::Image_164' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Image_196) == 0x000300, "Member 'UCaptureCompass_C::Image_196' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Outer_Reach) == 0x000308, "Member 'UCaptureCompass_C::Outer_Reach' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Text_NameOnClearState) == 0x000310, "Member 'UCaptureCompass_C::Text_NameOnClearState' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Text_NameOnContestedState) == 0x000318, "Member 'UCaptureCompass_C::Text_NameOnContestedState' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Text_NameOnDefendState) == 0x000320, "Member 'UCaptureCompass_C::Text_NameOnDefendState' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, Text_NameOnNeutralState) == 0x000328, "Member 'UCaptureCompass_C::Text_NameOnNeutralState' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, TextBlock_249) == 0x000330, "Member 'UCaptureCompass_C::TextBlock_249' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, TextBlock_252) == 0x000338, "Member 'UCaptureCompass_C::TextBlock_252' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, TextBlock_254) == 0x000340, "Member 'UCaptureCompass_C::TextBlock_254' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, TextBlock_258) == 0x000348, "Member 'UCaptureCompass_C::TextBlock_258' has a wrong offset!");
static_assert(offsetof(UCaptureCompass_C, WidgetSwitcher_0) == 0x000350, "Member 'UCaptureCompass_C::WidgetSwitcher_0' has a wrong offset!");

}

