#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharSelectionPreviewActor

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CharSelectionPreviewActor.CharSelectionPreviewActor_C
// 0x0048 (0x03B8 - 0x0370)
class ACharSelectionPreviewActor_C final : public ATWSkinPreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTWSkeletalMeshComponent*               DebugArmsSK;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         VanishAnim_Visibility_B0E0F0EE4E963E0D5DA013AAFE0ED9DD; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            VanishAnim__Direction_B0E0F0EE4E963E0D5DA013AAFE0ED9DD; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     VanishAnim;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayerVideo;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialCall;                                      // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSwapMeshAfterAnim;                                // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowArms;                                    // 0x03A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A3[0x5];                                      // 0x03A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NameParticles;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MIDCharacterName;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharSelectionPreviewActor(int32 EntryPoint);
	void BP_SetupCharacterOutfit(const class UTWStylesDataAsset* InStyleDataAsset);
	void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0(float AxisValue);
	void DebugSetDynMaterial(int32 matIndex, TSoftObjectPtr<class UMaterialInterface> softMat);
	void DebugShowArms();
	void BP_CosmeticStartVanishAnimation();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnLoaded_1C663C5D41E69F156D9313A2CB21E2A4(class UObject* Loaded);
	void VanishAnim__UpdateFunc();
	void VanishAnim__FinishedFunc();
	void UpdateBackground();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharSelectionPreviewActor_C">();
	}
	static class ACharSelectionPreviewActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACharSelectionPreviewActor_C>();
	}
};
static_assert(alignof(ACharSelectionPreviewActor_C) == 0x000008, "Wrong alignment on ACharSelectionPreviewActor_C");
static_assert(sizeof(ACharSelectionPreviewActor_C) == 0x0003B8, "Wrong size on ACharSelectionPreviewActor_C");
static_assert(offsetof(ACharSelectionPreviewActor_C, UberGraphFrame) == 0x000370, "Member 'ACharSelectionPreviewActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, SkeletalMesh) == 0x000378, "Member 'ACharSelectionPreviewActor_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, DebugArmsSK) == 0x000380, "Member 'ACharSelectionPreviewActor_C::DebugArmsSK' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, VanishAnim_Visibility_B0E0F0EE4E963E0D5DA013AAFE0ED9DD) == 0x000388, "Member 'ACharSelectionPreviewActor_C::VanishAnim_Visibility_B0E0F0EE4E963E0D5DA013AAFE0ED9DD' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, VanishAnim__Direction_B0E0F0EE4E963E0D5DA013AAFE0ED9DD) == 0x00038C, "Member 'ACharSelectionPreviewActor_C::VanishAnim__Direction_B0E0F0EE4E963E0D5DA013AAFE0ED9DD' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, VanishAnim) == 0x000390, "Member 'ACharSelectionPreviewActor_C::VanishAnim' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, MediaPlayerVideo) == 0x000398, "Member 'ACharSelectionPreviewActor_C::MediaPlayerVideo' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, bInitialCall) == 0x0003A0, "Member 'ACharSelectionPreviewActor_C::bInitialCall' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, bSwapMeshAfterAnim) == 0x0003A1, "Member 'ACharSelectionPreviewActor_C::bSwapMeshAfterAnim' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, bDebugShowArms) == 0x0003A2, "Member 'ACharSelectionPreviewActor_C::bDebugShowArms' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, NameParticles) == 0x0003A8, "Member 'ACharSelectionPreviewActor_C::NameParticles' has a wrong offset!");
static_assert(offsetof(ACharSelectionPreviewActor_C, MIDCharacterName) == 0x0003B0, "Member 'ACharSelectionPreviewActor_C::MIDCharacterName' has a wrong offset!");

}

