#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChromaSDKPlugin

#include "Basic.hpp"

#include "ChromaSDKPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ChromaSDKPlugin.ChromaSDKPluginAnimation1DObject.IsLoaded
// 0x0001 (0x0001 - 0x0000)
struct ChromaSDKPluginAnimation1DObject_IsLoaded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginAnimation1DObject_IsLoaded) == 0x000001, "Wrong alignment on ChromaSDKPluginAnimation1DObject_IsLoaded");
static_assert(sizeof(ChromaSDKPluginAnimation1DObject_IsLoaded) == 0x000001, "Wrong size on ChromaSDKPluginAnimation1DObject_IsLoaded");
static_assert(offsetof(ChromaSDKPluginAnimation1DObject_IsLoaded, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginAnimation1DObject_IsLoaded::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginAnimation2DObject.IsLoaded
// 0x0001 (0x0001 - 0x0000)
struct ChromaSDKPluginAnimation2DObject_IsLoaded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginAnimation2DObject_IsLoaded) == 0x000001, "Wrong alignment on ChromaSDKPluginAnimation2DObject_IsLoaded");
static_assert(sizeof(ChromaSDKPluginAnimation2DObject_IsLoaded) == 0x000001, "Wrong size on ChromaSDKPluginAnimation2DObject_IsLoaded");
static_assert(offsetof(ChromaSDKPluginAnimation2DObject_IsLoaded, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginAnimation2DObject_IsLoaded::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeys final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, frameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::frameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames::targetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesOffset
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, Offset) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesOffsetName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, Offset) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameId;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, frameId) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::frameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames::targetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesOffset
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, Offset) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesOffsetName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, Offset) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AppendAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AppendAllFrames final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AppendAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AppendAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AppendAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AppendAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFrames, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AppendAllFrames::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFrames, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AppendAllFrames::targetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AppendAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AppendAllFramesName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AppendAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AppendAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AppendAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AppendAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFramesName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AppendAllFramesName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFramesName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AppendAllFramesName::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectCustom1D
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D final
{
public:
	EChromaSDKDevice1DEnum                        Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0018(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, Colors) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, ReturnValue) == 0x000018, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectCustom2D
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D final
{
public:
	EChromaSDKDevice2DEnum                        Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChromaSDKColors>               Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0018(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, Colors) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, ReturnValue) == 0x000018, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectKeyboardCustom2D
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D final
{
public:
	TArray<struct FChromaSDKColors>               Colors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0010(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D, Colors) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectNone
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone, ReturnValue) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectStatic
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           colorParam;                                        // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0014(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, colorParam) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::colorParam' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, ReturnValue) == 0x000014, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKDeleteEffect
// 0x0014 (0x0014 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect final
{
public:
	struct FChromaSDKGuid                         EffectId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect) == 0x000014, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect, EffectId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect::EffectId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKInit
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKInit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKInit) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKInit");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKInit) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKInit");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKInit, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKInit::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKSetEffect
// 0x0014 (0x0014 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKSetEffect final
{
public:
	struct FChromaSDKGuid                         EffectId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKSetEffect");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect) == 0x000014, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKSetEffect");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect, EffectId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKSetEffect::EffectId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKSetEffect::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKUnInit
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKUnInit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKUnInit");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKUnInit");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKUnInit::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ClearAnimationType
// 0x0001 (0x0001 - 0x0000)
struct ChromaSDKPluginBPLibrary_ClearAnimationType final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ClearAnimationType) == 0x000001, "Wrong alignment on ChromaSDKPluginBPLibrary_ClearAnimationType");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ClearAnimationType) == 0x000001, "Wrong size on ChromaSDKPluginBPLibrary_ClearAnimationType");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ClearAnimationType, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ClearAnimationType::Device' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CloseAnimation
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_CloseAnimation final
{
public:
	int32                                         animationId;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CloseAnimation) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CloseAnimation");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CloseAnimation) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_CloseAnimation");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CloseAnimation, animationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CloseAnimation::animationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CloseAnimationName
// 0x0010 (0x0010 - 0x0000)
struct ChromaSDKPluginBPLibrary_CloseAnimationName final
{
public:
	class FString                                 animationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CloseAnimationName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CloseAnimationName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CloseAnimationName) == 0x000010, "Wrong size on ChromaSDKPluginBPLibrary_CloseAnimationName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CloseAnimationName, animationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CloseAnimationName::animationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeys final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, frameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::frameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames::targetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameId;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, frameId) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::frameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAnimation
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAnimation final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 targetAnimationName;                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAnimation) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAnimation");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAnimation) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_CopyAnimation");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimation, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAnimation::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimation, targetAnimationName) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyAnimation::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAnimationName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAnimationName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAnimationName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAnimationName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAnimationName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyAnimationName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimationName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAnimationName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimationName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAnimationName::targetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeyColor
// 0x0010 (0x0010 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeyColor final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChromaSDKKeyboardKey                         Key;                                               // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeyColor) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeyColor");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeyColor) == 0x000010, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeyColor");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, frameIndex) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::frameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, Key) == 0x00000C, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::Key' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeyColorName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeyColorName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameIndex;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChromaSDKKeyboardKey                         Key;                                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeyColorName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeyColorName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeyColorName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeyColorName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, frameIndex) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::frameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, Key) == 0x000024, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::Key' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColor
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColor final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColor) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColor");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColor) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColor");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, frameIndex) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::frameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, Keys) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorAllFrames
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, Keys) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorAllFramesName
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, Keys) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorName
// 0x0038 (0x0038 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorName final
{
public:
	class FString                                 sourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 targetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameIndex;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorName) == 0x000038, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, sourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::sourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, targetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::targetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, frameIndex) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::frameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, Keys) == 0x000028, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyNonZeroAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys final
{
public:
	int32                                         sourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         targetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         frameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, sourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::sourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, targetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::targetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, frameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::frameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyNonZeroAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyNonZeroAllKeysAllFrames final
{
public:
