#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorsComboBoxSetting

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ColorsComboBoxSetting.ColorsComboBoxSetting_C
// 0x0068 (0x0318 - 0x02B0)
class UColorsComboBoxSetting_C final : public UComboBoxSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Arrow;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorDisplay;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, struct FSlateColor>       AvailableColors;                                   // 0x02C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)

public:
	void ExecuteUbergraph_ColorsComboBoxSetting(int32 EntryPoint);
	void OnOptionChanged(const class FString& SelectedItem, ESelectInfo SelectionType);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ColorsComboBoxSetting_C">();
	}
	static class UColorsComboBoxSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorsComboBoxSetting_C>();
	}
};
static_assert(alignof(UColorsComboBoxSetting_C) == 0x000008, "Wrong alignment on UColorsComboBoxSetting_C");
static_assert(sizeof(UColorsComboBoxSetting_C) == 0x000318, "Wrong size on UColorsComboBoxSetting_C");
static_assert(offsetof(UColorsComboBoxSetting_C, UberGraphFrame) == 0x0002B0, "Member 'UColorsComboBoxSetting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UColorsComboBoxSetting_C, Image_Arrow) == 0x0002B8, "Member 'UColorsComboBoxSetting_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UColorsComboBoxSetting_C, Image_ColorDisplay) == 0x0002C0, "Member 'UColorsComboBoxSetting_C::Image_ColorDisplay' has a wrong offset!");
static_assert(offsetof(UColorsComboBoxSetting_C, AvailableColors) == 0x0002C8, "Member 'UColorsComboBoxSetting_C::AvailableColors' has a wrong offset!");

}

