#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crosshair_GrenadeLauncher1

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Crosshair_GrenadeLauncher1.Crosshair_GrenadeLauncher1_C
// 0x0050 (0x0350 - 0x0300)
class UCrosshair_GrenadeLauncher1_C final : public UTWLinearCrosshairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HitAnim;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomLeft;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRight;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Charge_Left;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Charge_Right;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cross;                                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLeft;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRight;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TranslationFactor;                                 // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TranslationConstant;                               // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Crosshair_GrenadeLauncher1(int32 EntryPoint);
	void ShowHitFeedback(const struct FLinearColor& HitColor);
	void UpdateCrosshairColor(int32 ColorIndex);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetImpactCrosshair(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Crosshair_GrenadeLauncher1_C">();
	}
	static class UCrosshair_GrenadeLauncher1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrosshair_GrenadeLauncher1_C>();
	}
};
static_assert(alignof(UCrosshair_GrenadeLauncher1_C) == 0x000008, "Wrong alignment on UCrosshair_GrenadeLauncher1_C");
static_assert(sizeof(UCrosshair_GrenadeLauncher1_C) == 0x000350, "Wrong size on UCrosshair_GrenadeLauncher1_C");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, UberGraphFrame) == 0x000300, "Member 'UCrosshair_GrenadeLauncher1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, HitAnim) == 0x000308, "Member 'UCrosshair_GrenadeLauncher1_C::HitAnim' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, BottomLeft) == 0x000310, "Member 'UCrosshair_GrenadeLauncher1_C::BottomLeft' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, BottomRight) == 0x000318, "Member 'UCrosshair_GrenadeLauncher1_C::BottomRight' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, Charge_Left) == 0x000320, "Member 'UCrosshair_GrenadeLauncher1_C::Charge_Left' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, Charge_Right) == 0x000328, "Member 'UCrosshair_GrenadeLauncher1_C::Charge_Right' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, Cross) == 0x000330, "Member 'UCrosshair_GrenadeLauncher1_C::Cross' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, TopLeft) == 0x000338, "Member 'UCrosshair_GrenadeLauncher1_C::TopLeft' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, TopRight) == 0x000340, "Member 'UCrosshair_GrenadeLauncher1_C::TopRight' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, TranslationFactor) == 0x000348, "Member 'UCrosshair_GrenadeLauncher1_C::TranslationFactor' has a wrong offset!");
static_assert(offsetof(UCrosshair_GrenadeLauncher1_C, TranslationConstant) == 0x00034C, "Member 'UCrosshair_GrenadeLauncher1_C::TranslationConstant' has a wrong offset!");

}

