#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crosshair_Shotgun

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.ExecuteUbergraph_Crosshair_Shotgun
// 0x0178 (0x0178 - 0x0000)
struct Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrosshairDynamic_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_4;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Spread;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusing_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ColorIndex;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0100(0x0028)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_5;               // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_6;               // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_7;               // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_8;               // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_HitColor;                             // 0x0164(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun) == 0x000008, "Wrong alignment on Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun");
static_assert(sizeof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun) == 0x000178, "Wrong size on Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, EntryPoint) == 0x000000, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_IsCrosshairDynamic_ReturnValue) == 0x000004, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_IsCrosshairDynamic_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, Temp_int_Variable) == 0x000008, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_Event_MyGeometry) == 0x000014, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_FMax_ReturnValue) == 0x000060, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue) == 0x000064, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_1) == 0x000070, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_2) == 0x000078, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_3) == 0x000080, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_4) == 0x000088, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_MakeArray_Array) == 0x000090, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000B8, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_DynamicCast_AsTime_Watch_Character) == 0x0000C0, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_Event_Spread) == 0x0000CC, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_Event_Spread' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_IsFocusing_ReturnValue) == 0x0000D0, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_IsFocusing_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_SelectFloat_ReturnValue) == 0x0000D4, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_SelectFloat_ReturnValue_1) == 0x0000D8, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_Event_ColorIndex) == 0x0000DC, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_Event_ColorIndex' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E0, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Map_Find_Value) == 0x0000E4, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Map_Find_ReturnValue) == 0x0000F4, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Ease_ReturnValue) == 0x0000F8, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000FC, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_MakeStruct_SlateColor) == 0x000100, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000128, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_5) == 0x00012C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_6) == 0x000134, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_7) == 0x00013C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_MakeVector2D_ReturnValue_8) == 0x000144, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_MakeVector2D_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, Temp_int_Variable_1) == 0x00014C, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Add_IntInt_ReturnValue_1) == 0x000150, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, CallFunc_Less_IntInt_ReturnValue_1) == 0x000160, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun, K2Node_Event_HitColor) == 0x000164, "Member 'Crosshair_Shotgun_C_ExecuteUbergraph_Crosshair_Shotgun::K2Node_Event_HitColor' has a wrong offset!");

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.ShowHitFeedback
// 0x0010 (0x0010 - 0x0000)
struct Crosshair_Shotgun_C_ShowHitFeedback final
{
public:
	struct FLinearColor                           HitColor;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crosshair_Shotgun_C_ShowHitFeedback) == 0x000004, "Wrong alignment on Crosshair_Shotgun_C_ShowHitFeedback");
static_assert(sizeof(Crosshair_Shotgun_C_ShowHitFeedback) == 0x000010, "Wrong size on Crosshair_Shotgun_C_ShowHitFeedback");
static_assert(offsetof(Crosshair_Shotgun_C_ShowHitFeedback, HitColor) == 0x000000, "Member 'Crosshair_Shotgun_C_ShowHitFeedback::HitColor' has a wrong offset!");

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.UpdateCrosshairColor
// 0x0004 (0x0004 - 0x0000)
struct Crosshair_Shotgun_C_UpdateCrosshairColor final
{
public:
	int32                                         ColorIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crosshair_Shotgun_C_UpdateCrosshairColor) == 0x000004, "Wrong alignment on Crosshair_Shotgun_C_UpdateCrosshairColor");
static_assert(sizeof(Crosshair_Shotgun_C_UpdateCrosshairColor) == 0x000004, "Wrong size on Crosshair_Shotgun_C_UpdateCrosshairColor");
static_assert(offsetof(Crosshair_Shotgun_C_UpdateCrosshairColor, ColorIndex) == 0x000000, "Member 'Crosshair_Shotgun_C_UpdateCrosshairColor::ColorIndex' has a wrong offset!");

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.OnSpreadChanged
// 0x0004 (0x0004 - 0x0000)
struct Crosshair_Shotgun_C_OnSpreadChanged final
{
public:
	float                                         Spread;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crosshair_Shotgun_C_OnSpreadChanged) == 0x000004, "Wrong alignment on Crosshair_Shotgun_C_OnSpreadChanged");
static_assert(sizeof(Crosshair_Shotgun_C_OnSpreadChanged) == 0x000004, "Wrong size on Crosshair_Shotgun_C_OnSpreadChanged");
static_assert(offsetof(Crosshair_Shotgun_C_OnSpreadChanged, Spread) == 0x000000, "Member 'Crosshair_Shotgun_C_OnSpreadChanged::Spread' has a wrong offset!");

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.Tick
// 0x003C (0x003C - 0x0000)
struct Crosshair_Shotgun_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Crosshair_Shotgun_C_Tick) == 0x000004, "Wrong alignment on Crosshair_Shotgun_C_Tick");
static_assert(sizeof(Crosshair_Shotgun_C_Tick) == 0x00003C, "Wrong size on Crosshair_Shotgun_C_Tick");
static_assert(offsetof(Crosshair_Shotgun_C_Tick, MyGeometry) == 0x000000, "Member 'Crosshair_Shotgun_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Crosshair_Shotgun_C_Tick, InDeltaTime) == 0x000038, "Member 'Crosshair_Shotgun_C_Tick::InDeltaTime' has a wrong offset!");

// Function Crosshair_Shotgun.Crosshair_Shotgun_C.SetImpactCrosshair
// 0x0001 (0x0001 - 0x0000)
struct Crosshair_Shotgun_C_SetImpactCrosshair final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Crosshair_Shotgun_C_SetImpactCrosshair) == 0x000001, "Wrong alignment on Crosshair_Shotgun_C_SetImpactCrosshair");
static_assert(sizeof(Crosshair_Shotgun_C_SetImpactCrosshair) == 0x000001, "Wrong size on Crosshair_Shotgun_C_SetImpactCrosshair");
static_assert(offsetof(Crosshair_Shotgun_C_SetImpactCrosshair, Show) == 0x000000, "Member 'Crosshair_Shotgun_C_SetImpactCrosshair::Show' has a wrong offset!");

}

