#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Crosshair_Pistol

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Crosshair_Pistol.Crosshair_Pistol_C
// 0x0048 (0x0348 - 0x0300)
class UCrosshair_Pistol_C final : public UTWLinearCrosshairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HitAnim;                                           // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomLeft;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomRight;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CrossHairADS;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Center;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopLeft;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopRight;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TranslationFactor;                                 // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TranslationConstant;                               // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Crosshair_Pistol(int32 EntryPoint);
	void OnADSStartExit();
	void OnADSExit();
	void OnADSComplete();
	void OnADSEnter();
	void ShowHitFeedback(const struct FLinearColor& HitColor);
	void UpdateCrosshairColor(int32 ColorIndex);
	void OnSpreadChanged(float Spread);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetImpactCrosshair(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Crosshair_Pistol_C">();
	}
	static class UCrosshair_Pistol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrosshair_Pistol_C>();
	}
};
static_assert(alignof(UCrosshair_Pistol_C) == 0x000008, "Wrong alignment on UCrosshair_Pistol_C");
static_assert(sizeof(UCrosshair_Pistol_C) == 0x000348, "Wrong size on UCrosshair_Pistol_C");
static_assert(offsetof(UCrosshair_Pistol_C, UberGraphFrame) == 0x000300, "Member 'UCrosshair_Pistol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, HitAnim) == 0x000308, "Member 'UCrosshair_Pistol_C::HitAnim' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, BottomLeft) == 0x000310, "Member 'UCrosshair_Pistol_C::BottomLeft' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, BottomRight) == 0x000318, "Member 'UCrosshair_Pistol_C::BottomRight' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, CrossHairADS) == 0x000320, "Member 'UCrosshair_Pistol_C::CrossHairADS' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, Image_Center) == 0x000328, "Member 'UCrosshair_Pistol_C::Image_Center' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, TopLeft) == 0x000330, "Member 'UCrosshair_Pistol_C::TopLeft' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, TopRight) == 0x000338, "Member 'UCrosshair_Pistol_C::TopRight' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, TranslationFactor) == 0x000340, "Member 'UCrosshair_Pistol_C::TranslationFactor' has a wrong offset!");
static_assert(offsetof(UCrosshair_Pistol_C, TranslationConstant) == 0x000344, "Member 'UCrosshair_Pistol_C::TranslationConstant' has a wrong offset!");

}

