#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CyclicMovementComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CyclicMovementComponent.CyclicMovementComponent_C.ExecuteUbergraph_CyclicMovementComponent
// 0x0038 (0x0038 - 0x0000)
struct CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayActive_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent) == 0x000008, "Wrong alignment on CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent");
static_assert(sizeof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent) == 0x000038, "Wrong size on CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, EntryPoint) == 0x000000, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000010, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, CallFunc_IsGameplayActive_ReturnValue) == 0x000019, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::CallFunc_IsGameplayActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'CyclicMovementComponent_C_ExecuteUbergraph_CyclicMovementComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function CyclicMovementComponent.CyclicMovementComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CyclicMovementComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CyclicMovementComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on CyclicMovementComponent_C_ReceiveTick");
static_assert(sizeof(CyclicMovementComponent_C_ReceiveTick) == 0x000004, "Wrong size on CyclicMovementComponent_C_ReceiveTick");
static_assert(offsetof(CyclicMovementComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CyclicMovementComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CyclicMovementComponent.CyclicMovementComponent_C.UpdateMovement
// 0x0118 (0x0118 - 0x0000)
struct CyclicMovementComponent_C_UpdateMovement final
{
public:
	struct FVector                                Aux;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWDamageableActor*                     K2Node_DynamicCast_AsTWDamageable_Actor;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBaseMoveComponentType_C*>       CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UBaseMoveComponentType_C*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRelativePosition_NewParam;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INGDDamageable>        CallFunc_IsAlive_self_CastInput;                   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x008C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CyclicMovementComponent_C_UpdateMovement) == 0x000008, "Wrong alignment on CyclicMovementComponent_C_UpdateMovement");
static_assert(sizeof(CyclicMovementComponent_C_UpdateMovement) == 0x000118, "Wrong size on CyclicMovementComponent_C_UpdateMovement");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, Aux) == 0x000000, "Member 'CyclicMovementComponent_C_UpdateMovement::Aux' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'CyclicMovementComponent_C_UpdateMovement::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_GetOwner_ReturnValue_1) == 0x000018, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, K2Node_DynamicCast_AsTWDamageable_Actor) == 0x000020, "Member 'CyclicMovementComponent_C_UpdateMovement::K2Node_DynamicCast_AsTWDamageable_Actor' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CyclicMovementComponent_C_UpdateMovement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'CyclicMovementComponent_C_UpdateMovement::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Array_Get_Item) == 0x000040, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_GetRelativePosition_NewParam) == 0x00004C, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_GetRelativePosition_NewParam' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_IsAlive_self_CastInput) == 0x000060, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_IsAlive_self_CastInput' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_IsAlive_ReturnValue) == 0x000070, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Add_VectorVector_ReturnValue) == 0x000074, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000080, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00008C, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CyclicMovementComponent_C_UpdateMovement, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000114, "Member 'CyclicMovementComponent_C_UpdateMovement::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

