#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CyclicMovementComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CyclicMovementComponent.CyclicMovementComponent_C
// 0x0018 (0x00C8 - 0x00B0)
class UCyclicMovementComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                InitialLocation;                                   // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLookAtPlayer;                                     // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEnableMovement;                                   // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CyclicMovementComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateMovement();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CyclicMovementComponent_C">();
	}
	static class UCyclicMovementComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCyclicMovementComponent_C>();
	}
};
static_assert(alignof(UCyclicMovementComponent_C) == 0x000008, "Wrong alignment on UCyclicMovementComponent_C");
static_assert(sizeof(UCyclicMovementComponent_C) == 0x0000C8, "Wrong size on UCyclicMovementComponent_C");
static_assert(offsetof(UCyclicMovementComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UCyclicMovementComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCyclicMovementComponent_C, InitialLocation) == 0x0000B8, "Member 'UCyclicMovementComponent_C::InitialLocation' has a wrong offset!");
static_assert(offsetof(UCyclicMovementComponent_C, bLookAtPlayer) == 0x0000C4, "Member 'UCyclicMovementComponent_C::bLookAtPlayer' has a wrong offset!");
static_assert(offsetof(UCyclicMovementComponent_C, bEnableMovement) == 0x0000C5, "Member 'UCyclicMovementComponent_C::bEnableMovement' has a wrong offset!");

}

