#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyBoostItem

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyBoostItem.DailyBoostItem_C
// 0x0028 (0x02B8 - 0x0290)
class UDailyBoostItem_C final : public UDailyBoostItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_DailyIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ItemInfoText;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ItemText;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DailyBoostItem(int32 EntryPoint);
	void SetItemInfo(const class FString& ItemInfo);
	void SetIsItemCompleted(bool IsCompleted, const struct FLinearColor& WidgetColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyBoostItem_C">();
	}
	static class UDailyBoostItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyBoostItem_C>();
	}
};
static_assert(alignof(UDailyBoostItem_C) == 0x000008, "Wrong alignment on UDailyBoostItem_C");
static_assert(sizeof(UDailyBoostItem_C) == 0x0002B8, "Wrong size on UDailyBoostItem_C");
static_assert(offsetof(UDailyBoostItem_C, UberGraphFrame) == 0x000290, "Member 'UDailyBoostItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyBoostItem_C, Image_DailyIcon) == 0x000298, "Member 'UDailyBoostItem_C::Image_DailyIcon' has a wrong offset!");
static_assert(offsetof(UDailyBoostItem_C, ItemInfoText) == 0x0002A0, "Member 'UDailyBoostItem_C::ItemInfoText' has a wrong offset!");
static_assert(offsetof(UDailyBoostItem_C, ItemText) == 0x0002A8, "Member 'UDailyBoostItem_C::ItemText' has a wrong offset!");

}

