#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultKeyLabel

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultKeyLabel.DefaultKeyLabel_C
// 0x0018 (0x02B0 - 0x0298)
class UDefaultKeyLabel_C final : public UKeyLabel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconImage;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultKeyLabel(int32 EntryPoint);
	void UpdateKeyLabel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultKeyLabel_C">();
	}
	static class UDefaultKeyLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultKeyLabel_C>();
	}
};
static_assert(alignof(UDefaultKeyLabel_C) == 0x000008, "Wrong alignment on UDefaultKeyLabel_C");
static_assert(sizeof(UDefaultKeyLabel_C) == 0x0002B0, "Wrong size on UDefaultKeyLabel_C");
static_assert(offsetof(UDefaultKeyLabel_C, UberGraphFrame) == 0x000298, "Member 'UDefaultKeyLabel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultKeyLabel_C, IconImage) == 0x0002A0, "Member 'UDefaultKeyLabel_C::IconImage' has a wrong offset!");
static_assert(offsetof(UDefaultKeyLabel_C, LabelText) == 0x0002A8, "Member 'UDefaultKeyLabel_C::LabelText' has a wrong offset!");

}

