#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultBindCaptureButton_Override

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "ChromaSDKPlugin_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultBindCaptureButton_Override.DefaultBindCaptureButton_Override_C
// 0x0028 (0x0288 - 0x0260)
class UDefaultBindCaptureButton_Override_C final : public UBindCaptureButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionMapping_Override_C*       InputMappingParent;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDefaultAxisMapping_Override_C*         InputAxisParent;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultBindCaptureButton_Override(int32 EntryPoint);
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnChordCaptured(const struct FInputChord& CapturedChord);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultBindCaptureButton_Override_C">();
	}
	static class UDefaultBindCaptureButton_Override_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultBindCaptureButton_Override_C>();
	}
};
static_assert(alignof(UDefaultBindCaptureButton_Override_C) == 0x000008, "Wrong alignment on UDefaultBindCaptureButton_Override_C");
static_assert(sizeof(UDefaultBindCaptureButton_Override_C) == 0x000288, "Wrong size on UDefaultBindCaptureButton_Override_C");
static_assert(offsetof(UDefaultBindCaptureButton_Override_C, UberGraphFrame) == 0x000260, "Member 'UDefaultBindCaptureButton_Override_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_Override_C, Button_0) == 0x000268, "Member 'UDefaultBindCaptureButton_Override_C::Button_0' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_Override_C, Content) == 0x000270, "Member 'UDefaultBindCaptureButton_Override_C::Content' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_Override_C, InputMappingParent) == 0x000278, "Member 'UDefaultBindCaptureButton_Override_C::InputMappingParent' has a wrong offset!");
static_assert(offsetof(UDefaultBindCaptureButton_Override_C, InputAxisParent) == 0x000280, "Member 'UDefaultBindCaptureButton_Override_C::InputAxisParent' has a wrong offset!");

}

