#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultsButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DefaultsButton.DefaultsButton_C.ExecuteUbergraph_DefaultsButton
// 0x0098 (0x0098 - 0x0000)
struct DefaultsButton_C_ExecuteUbergraph_DefaultsButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	class UTimeWatchGameInstance*                 CallFunc_GetGameInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0068(0x0028)()
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton) == 0x000008, "Wrong alignment on DefaultsButton_C_ExecuteUbergraph_DefaultsButton");
static_assert(sizeof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton) == 0x000098, "Wrong size on DefaultsButton_C_ExecuteUbergraph_DefaultsButton");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, EntryPoint) == 0x000000, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_GetGameInstance_ReturnValue) == 0x000038, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, K2Node_MakeStruct_SlateColor_2) == 0x000068, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_IsHovered_ReturnValue) == 0x000090, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_IsPressed_ReturnValue) == 0x000091, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultsButton_C_ExecuteUbergraph_DefaultsButton, CallFunc_Not_PreBool_ReturnValue) == 0x000093, "Member 'DefaultsButton_C_ExecuteUbergraph_DefaultsButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

