#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultSpinner_Override

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultSpinner_Override.DefaultSpinner_Override_C
// 0x0030 (0x0290 - 0x0260)
class UDefaultSpinner_Override_C final : public USpinner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LeftArrow;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftButton;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightArrow;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightButton;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DefaultSpinner_Override(int32 EntryPoint);
	void BndEvt__RightButton_K2Node_ComponentBoundEvent_196_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LeftButton_K2Node_ComponentBoundEvent_178_OnButtonClickedEvent__DelegateSignature();
	class FText GetLabelText();
	struct FLinearColor GetLeftArrowColorAndOpacity();
	struct FLinearColor GetRightArrowColorAndOpacity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultSpinner_Override_C">();
	}
	static class UDefaultSpinner_Override_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultSpinner_Override_C>();
	}
};
static_assert(alignof(UDefaultSpinner_Override_C) == 0x000008, "Wrong alignment on UDefaultSpinner_Override_C");
static_assert(sizeof(UDefaultSpinner_Override_C) == 0x000290, "Wrong size on UDefaultSpinner_Override_C");
static_assert(offsetof(UDefaultSpinner_Override_C, UberGraphFrame) == 0x000260, "Member 'UDefaultSpinner_Override_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultSpinner_Override_C, LeftArrow) == 0x000268, "Member 'UDefaultSpinner_Override_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(UDefaultSpinner_Override_C, LeftButton) == 0x000270, "Member 'UDefaultSpinner_Override_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UDefaultSpinner_Override_C, RightArrow) == 0x000278, "Member 'UDefaultSpinner_Override_C::RightArrow' has a wrong offset!");
static_assert(offsetof(UDefaultSpinner_Override_C, RightButton) == 0x000280, "Member 'UDefaultSpinner_Override_C::RightButton' has a wrong offset!");
static_assert(offsetof(UDefaultSpinner_Override_C, TextBlock_0) == 0x000288, "Member 'UDefaultSpinner_Override_C::TextBlock_0' has a wrong offset!");

}

