#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultBindCaptureButton_Override

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChromaSDKPlugin_structs.hpp"


namespace SDK::Params
{

// Function DefaultBindCaptureButton_Override.DefaultBindCaptureButton_Override_C.ExecuteUbergraph_DefaultBindCaptureButton_Override
// 0x00E0 (0x00E0 - 0x0000)
struct DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FInputChord& CapturedChord)> K2Node_CreateDelegate_OutputDelegate;   // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UBindCapturePrompt*                     CallFunc_StartCapture_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            K2Node_CustomEvent_CapturedChord;                  // 0x0020(0x0020)(HasGetValueTypeHash)
	class UNGDChromaWrapper*                      CallFunc_GetChromaWrapper_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChromaSDKKeyboardKey                         CallFunc_GetKeyboardRazerKey_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetChromaActionColor_Color;               // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChromaActionColor_Success;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChromaKeyColor                        K2Node_MakeStruct_ChromaKeyColor;                  // 0x00B8(0x0028)()
};
static_assert(alignof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override) == 0x000008, "Wrong alignment on DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override");
static_assert(sizeof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override) == 0x0000E0, "Wrong size on DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, EntryPoint) == 0x000000, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::EntryPoint' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, Temp_bool_Variable) == 0x000004, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_StartCapture_ReturnValue) == 0x000018, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_StartCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, K2Node_CustomEvent_CapturedChord) == 0x000020, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::K2Node_CustomEvent_CapturedChord' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_GetChromaWrapper_ReturnValue) == 0x000040, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_GetChromaWrapper_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_GetKeyboardRazerKey_ReturnValue) == 0x000048, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_GetKeyboardRazerKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_Conv_FloatToString_ReturnValue) == 0x000050, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_Conv_NameToString_ReturnValue) == 0x000060, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, K2Node_Select_Default) == 0x000088, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000090, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_GetChromaActionColor_Color) == 0x0000A0, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_GetChromaActionColor_Color' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, CallFunc_GetChromaActionColor_Success) == 0x0000B0, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::CallFunc_GetChromaActionColor_Success' has a wrong offset!");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override, K2Node_MakeStruct_ChromaKeyColor) == 0x0000B8, "Member 'DefaultBindCaptureButton_Override_C_ExecuteUbergraph_DefaultBindCaptureButton_Override::K2Node_MakeStruct_ChromaKeyColor' has a wrong offset!");

// Function DefaultBindCaptureButton_Override.DefaultBindCaptureButton_Override_C.OnChordCaptured
// 0x0020 (0x0020 - 0x0000)
struct DefaultBindCaptureButton_Override_C_OnChordCaptured final
{
public:
	struct FInputChord                            CapturedChord;                                     // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(DefaultBindCaptureButton_Override_C_OnChordCaptured) == 0x000008, "Wrong alignment on DefaultBindCaptureButton_Override_C_OnChordCaptured");
static_assert(sizeof(DefaultBindCaptureButton_Override_C_OnChordCaptured) == 0x000020, "Wrong size on DefaultBindCaptureButton_Override_C_OnChordCaptured");
static_assert(offsetof(DefaultBindCaptureButton_Override_C_OnChordCaptured, CapturedChord) == 0x000000, "Member 'DefaultBindCaptureButton_Override_C_OnChordCaptured::CapturedChord' has a wrong offset!");

}

