#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultSliderSetting_Override

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.ExecuteUbergraph_DefaultSliderSetting_Override
// 0x04E0 (0x04E0 - 0x0000)
struct DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0050(0x0088)()
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x00D8(0x0088)()
	struct FSliderStyle                           K2Node_MakeStruct_SliderStyle;                     // 0x0160(0x0340)()
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFluxPlayerController*                  K2Node_DynamicCast_AsFlux_Player_Controller;       // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewVal;                         // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override) == 0x000008, "Wrong alignment on DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override");
static_assert(sizeof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override) == 0x0004E0, "Wrong size on DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, EntryPoint) == 0x000000, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::EntryPoint' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_GetFloatCVar_ReturnValue) == 0x000004, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_GetFloatCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_Event_MyGeometry) == 0x000008, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_Event_InDeltaTime) == 0x000040, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_MakeStruct_SlateBrush) == 0x000050, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x0000D8, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_MakeStruct_SliderStyle) == 0x000160, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_MakeStruct_SliderStyle' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_ComponentBoundEvent_Value) == 0x0004A0, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_GetPlayerController_ReturnValue) == 0x0004A8, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_DynamicCast_AsFlux_Player_Controller) == 0x0004B0, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_DynamicCast_AsFlux_Player_Controller' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_DynamicCast_bSuccess) == 0x0004B8, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_Conv_NameToString_ReturnValue) == 0x0004C0, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_SwitchName_CmpSuccess) == 0x0004D0, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, K2Node_CustomEvent_NewVal) == 0x0004D4, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::K2Node_CustomEvent_NewVal' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_MapRangeUnclamped_ReturnValue) == 0x0004D8, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override, CallFunc_MapRangeUnclamped_ReturnValue_1) == 0x0004DC, "Member 'DefaultSliderSetting_Override_C_ExecuteUbergraph_DefaultSliderSetting_Override::CallFunc_MapRangeUnclamped_ReturnValue_1' has a wrong offset!");

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.OnCvarChanged
// 0x0004 (0x0004 - 0x0000)
struct DefaultSliderSetting_Override_C_OnCvarChanged final
{
public:
	float                                         NewVal;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultSliderSetting_Override_C_OnCvarChanged) == 0x000004, "Wrong alignment on DefaultSliderSetting_Override_C_OnCvarChanged");
static_assert(sizeof(DefaultSliderSetting_Override_C_OnCvarChanged) == 0x000004, "Wrong size on DefaultSliderSetting_Override_C_OnCvarChanged");
static_assert(offsetof(DefaultSliderSetting_Override_C_OnCvarChanged, NewVal) == 0x000000, "Member 'DefaultSliderSetting_Override_C_OnCvarChanged::NewVal' has a wrong offset!");

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'DefaultSliderSetting_Override_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.Tick
// 0x003C (0x003C - 0x0000)
struct DefaultSliderSetting_Override_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DefaultSliderSetting_Override_C_Tick) == 0x000004, "Wrong alignment on DefaultSliderSetting_Override_C_Tick");
static_assert(sizeof(DefaultSliderSetting_Override_C_Tick) == 0x00003C, "Wrong size on DefaultSliderSetting_Override_C_Tick");
static_assert(offsetof(DefaultSliderSetting_Override_C_Tick, MyGeometry) == 0x000000, "Member 'DefaultSliderSetting_Override_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_Tick, InDeltaTime) == 0x000038, "Member 'DefaultSliderSetting_Override_C_Tick::InDeltaTime' has a wrong offset!");

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.PrintValueAsFloat
// 0x0020 (0x0020 - 0x0000)
struct DefaultSliderSetting_Override_C_PrintValueAsFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
};
static_assert(alignof(DefaultSliderSetting_Override_C_PrintValueAsFloat) == 0x000008, "Wrong alignment on DefaultSliderSetting_Override_C_PrintValueAsFloat");
static_assert(sizeof(DefaultSliderSetting_Override_C_PrintValueAsFloat) == 0x000020, "Wrong size on DefaultSliderSetting_Override_C_PrintValueAsFloat");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsFloat, Value) == 0x000000, "Member 'DefaultSliderSetting_Override_C_PrintValueAsFloat::Value' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsFloat, CallFunc_Conv_FloatToText_ReturnValue) == 0x000008, "Member 'DefaultSliderSetting_Override_C_PrintValueAsFloat::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function DefaultSliderSetting_Override.DefaultSliderSetting_Override_C.PrintValueAsInteger
// 0x0028 (0x0028 - 0x0000)
struct DefaultSliderSetting_Override_C_PrintValueAsInteger final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(DefaultSliderSetting_Override_C_PrintValueAsInteger) == 0x000008, "Wrong alignment on DefaultSliderSetting_Override_C_PrintValueAsInteger");
static_assert(sizeof(DefaultSliderSetting_Override_C_PrintValueAsInteger) == 0x000028, "Wrong size on DefaultSliderSetting_Override_C_PrintValueAsInteger");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsInteger, Value) == 0x000000, "Member 'DefaultSliderSetting_Override_C_PrintValueAsInteger::Value' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsInteger, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'DefaultSliderSetting_Override_C_PrintValueAsInteger::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsInteger, CallFunc_Round_ReturnValue) == 0x000008, "Member 'DefaultSliderSetting_Override_C_PrintValueAsInteger::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(DefaultSliderSetting_Override_C_PrintValueAsInteger, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'DefaultSliderSetting_Override_C_PrintValueAsInteger::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

