#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosionCompass

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ExplosionCompass.ExplosionCompass_C
// 0x0038 (0x0308 - 0x02D0)
class UExplosionCompass_C final : public UTWActorCompass
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 glow;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ArrowAnimated;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MaxVisibilityDistance;                             // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartDamageDistance;                               // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            GlowIntensity;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlinkCount;                                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ExplosionCompass(int32 EntryPoint);
	void OnUpdated(float Distance);

	bool IsCompassVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExplosionCompass_C">();
	}
	static class UExplosionCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExplosionCompass_C>();
	}
};
static_assert(alignof(UExplosionCompass_C) == 0x000008, "Wrong alignment on UExplosionCompass_C");
static_assert(sizeof(UExplosionCompass_C) == 0x000308, "Wrong size on UExplosionCompass_C");
static_assert(offsetof(UExplosionCompass_C, UberGraphFrame) == 0x0002D0, "Member 'UExplosionCompass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, glow) == 0x0002D8, "Member 'UExplosionCompass_C::glow' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, Icon) == 0x0002E0, "Member 'UExplosionCompass_C::Icon' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, Image_ArrowAnimated) == 0x0002E8, "Member 'UExplosionCompass_C::Image_ArrowAnimated' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, MaxVisibilityDistance) == 0x0002F0, "Member 'UExplosionCompass_C::MaxVisibilityDistance' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, StartDamageDistance) == 0x0002F4, "Member 'UExplosionCompass_C::StartDamageDistance' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, GlowIntensity) == 0x0002F8, "Member 'UExplosionCompass_C::GlowIntensity' has a wrong offset!");
static_assert(offsetof(UExplosionCompass_C, BlinkCount) == 0x000300, "Member 'UExplosionCompass_C::BlinkCount' has a wrong offset!");

}

