#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplodingBarrel_BP

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ExplodingBarrel_BP.ExplodingBarrel_BP_C
// 0x0158 (0x03F8 - 0x02A0)
class AExplodingBarrel_BP_C final : public AFluxExplodingBarrel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   BP_VFX_Barrel_Explosion_B;                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        NGDAk_Barrel;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Exp_lgt;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShockwaveEmitterSpawn;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Sound_BarrelExplosion;                             // 0x02C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               BarrelDynamicMaterial;                             // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ExplosionDynamicMaterial;                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SparkMaterial;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity;                                           // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       SparkMaterialArray;                                // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         NumberOfSparks;                                    // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            SparkMesh;                                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_Length__min_;                                // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_Length__max_;                                // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_Width__min_;                                 // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_Width__max_;                                 // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_angle__min_;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_angle__max_;                                 // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spark_Lifetime_Multiplier;                         // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Light_Intensity;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Sparks;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	float                                         Spark_Forward_Offset;                              // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNGDSoundConfig                        Sound_BarrelFuse;                                  // 0x0398(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	EFluxBarrelState                              OldState;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ExplodingBarrel_BP(int32 EntryPoint);
	void Cosmetic_OnFuseTimestampChange(float NewFuseTimestamp);
	void CustomEvent(EFluxCapacitorStates OldState_0, EFluxCapacitorStates NewState);
	void Cosmetic_UpdateExplosionFX(float VisualExplosionFactor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeDynamicsMaterials();
	void Construct_Particles();
	void OnStateChangeVisualupdate(EFluxBarrelState OldState_0, EFluxBarrelState NewState);
	void FakeTimeDilationSound(EFluxCapacitorStates GameState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExplodingBarrel_BP_C">();
	}
	static class AExplodingBarrel_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplodingBarrel_BP_C>();
	}
};
static_assert(alignof(AExplodingBarrel_BP_C) == 0x000008, "Wrong alignment on AExplodingBarrel_BP_C");
static_assert(sizeof(AExplodingBarrel_BP_C) == 0x0003F8, "Wrong size on AExplodingBarrel_BP_C");
static_assert(offsetof(AExplodingBarrel_BP_C, UberGraphFrame) == 0x0002A0, "Member 'AExplodingBarrel_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, BP_VFX_Barrel_Explosion_B) == 0x0002A8, "Member 'AExplodingBarrel_BP_C::BP_VFX_Barrel_Explosion_B' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, NGDAk_Barrel) == 0x0002B0, "Member 'AExplodingBarrel_BP_C::NGDAk_Barrel' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Exp_lgt) == 0x0002B8, "Member 'AExplodingBarrel_BP_C::Exp_lgt' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, ShockwaveEmitterSpawn) == 0x0002C0, "Member 'AExplodingBarrel_BP_C::ShockwaveEmitterSpawn' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Sound_BarrelExplosion) == 0x0002C8, "Member 'AExplodingBarrel_BP_C::Sound_BarrelExplosion' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, BarrelDynamicMaterial) == 0x000320, "Member 'AExplodingBarrel_BP_C::BarrelDynamicMaterial' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, ExplosionDynamicMaterial) == 0x000328, "Member 'AExplodingBarrel_BP_C::ExplosionDynamicMaterial' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, SparkMaterial) == 0x000330, "Member 'AExplodingBarrel_BP_C::SparkMaterial' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Gravity) == 0x000338, "Member 'AExplodingBarrel_BP_C::Gravity' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, SparkMaterialArray) == 0x000340, "Member 'AExplodingBarrel_BP_C::SparkMaterialArray' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, NumberOfSparks) == 0x000350, "Member 'AExplodingBarrel_BP_C::NumberOfSparks' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, SparkMesh) == 0x000358, "Member 'AExplodingBarrel_BP_C::SparkMesh' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Length__min_) == 0x000360, "Member 'AExplodingBarrel_BP_C::Spark_Length__min_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Length__max_) == 0x000364, "Member 'AExplodingBarrel_BP_C::Spark_Length__max_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Width__min_) == 0x000368, "Member 'AExplodingBarrel_BP_C::Spark_Width__min_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Width__max_) == 0x00036C, "Member 'AExplodingBarrel_BP_C::Spark_Width__max_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_angle__min_) == 0x000370, "Member 'AExplodingBarrel_BP_C::Spark_angle__min_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_angle__max_) == 0x000374, "Member 'AExplodingBarrel_BP_C::Spark_angle__max_' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Lifetime_Multiplier) == 0x000378, "Member 'AExplodingBarrel_BP_C::Spark_Lifetime_Multiplier' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Light_Intensity) == 0x00037C, "Member 'AExplodingBarrel_BP_C::Light_Intensity' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Sparks) == 0x000380, "Member 'AExplodingBarrel_BP_C::Sparks' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Spark_Forward_Offset) == 0x000390, "Member 'AExplodingBarrel_BP_C::Spark_Forward_Offset' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, Sound_BarrelFuse) == 0x000398, "Member 'AExplodingBarrel_BP_C::Sound_BarrelFuse' has a wrong offset!");
static_assert(offsetof(AExplodingBarrel_BP_C, OldState) == 0x0003F0, "Member 'AExplodingBarrel_BP_C::OldState' has a wrong offset!");

}

