#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPersonProjectile

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FirstPersonProjectile.FirstPersonProjectile_C.ExecuteUbergraph_FirstPersonProjectile
// 0x09F8 (0x09F8 - 0x0000)
struct FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCosmeticCreationTime_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCosmeticCreationLocation_ReturnValue;  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayColorScheme                   CallFunc_GetColorScheme_TeamColorsOutlines;        // 0x0028(0x0428)()
	class ANGDCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorForClone_ReturnValue;             // 0x0464(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0484(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x050D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E[0x2];                                      // 0x050E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0570(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATutorial_Target_BP_C*                  K2Node_DynamicCast_AsTutorial_Target_BP;           // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANGDCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue_1;          // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayColorScheme                   CallFunc_GetColorScheme_TeamColorsOutlines_1;      // 0x05A0(0x0428)()
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character_1;       // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0x3];                                      // 0x09D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorForClone_ReturnValue_1;           // 0x09D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x09E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCosmeticImpactTime_ReturnValue;        // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile) == 0x000008, "Wrong alignment on FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile");
static_assert(sizeof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile) == 0x0009F8, "Wrong size on FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, EntryPoint) == 0x000000, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetCosmeticCreationTime_ReturnValue) == 0x000004, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetCosmeticCreationTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetCosmeticCreationLocation_ReturnValue) == 0x000008, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetCosmeticCreationLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_IsDedicatedServer_ReturnValue) == 0x000020, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetColorScheme_TeamColorsOutlines) == 0x000028, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetColorScheme_TeamColorsOutlines' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000450, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000458, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_bSuccess) == 0x000460, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetColorForClone_ReturnValue) == 0x000464, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetColorForClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BooleanAND_ReturnValue) == 0x000474, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000478, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_Event_HitResult) == 0x000484, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_bBlockingHit) == 0x00050C, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_bInitialOverlap) == 0x00050D, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_Time) == 0x000510, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_Distance) == 0x000514, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_Location) == 0x000518, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_ImpactPoint) == 0x000524, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_Normal) == 0x000530, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_ImpactNormal) == 0x00053C, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_PhysMat) == 0x000548, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_HitActor) == 0x000550, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_HitComponent) == 0x000558, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_HitBoneName) == 0x000560, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_HitItem) == 0x000568, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_FaceIndex) == 0x00056C, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_TraceStart) == 0x000570, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_BreakHitResult_TraceEnd) == 0x00057C, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_AsTutorial_Target_BP) == 0x000588, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_AsTutorial_Target_BP' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_bSuccess_1) == 0x000590, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetOwnerCharacter_ReturnValue_1) == 0x000598, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetOwnerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetColorScheme_TeamColorsOutlines_1) == 0x0005A0, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetColorScheme_TeamColorsOutlines_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_AsTime_Watch_Character_1) == 0x0009C8, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_AsTime_Watch_Character_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, K2Node_DynamicCast_bSuccess_2) == 0x0009D0, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetColorForClone_ReturnValue_1) == 0x0009D4, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetColorForClone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_Conv_LinearColorToVector_ReturnValue_1) == 0x0009E4, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_Conv_LinearColorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile, CallFunc_GetCosmeticImpactTime_ReturnValue) == 0x0009F0, "Member 'FirstPersonProjectile_C_ExecuteUbergraph_FirstPersonProjectile::CallFunc_GetCosmeticImpactTime_ReturnValue' has a wrong offset!");

// Function FirstPersonProjectile.FirstPersonProjectile_C.OnImpactEvent
// 0x0088 (0x0088 - 0x0000)
struct FirstPersonProjectile_C_OnImpactEvent final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FirstPersonProjectile_C_OnImpactEvent) == 0x000004, "Wrong alignment on FirstPersonProjectile_C_OnImpactEvent");
static_assert(sizeof(FirstPersonProjectile_C_OnImpactEvent) == 0x000088, "Wrong size on FirstPersonProjectile_C_OnImpactEvent");
static_assert(offsetof(FirstPersonProjectile_C_OnImpactEvent, HitResult) == 0x000000, "Member 'FirstPersonProjectile_C_OnImpactEvent::HitResult' has a wrong offset!");

// Function FirstPersonProjectile.FirstPersonProjectile_C.BP_IsReadyToBeDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FirstPersonProjectile_C_BP_IsReadyToBeDestroyed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsReadyToBeDestroyed_ReturnValue;      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationComplete_NewParam;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed) == 0x000001, "Wrong alignment on FirstPersonProjectile_C_BP_IsReadyToBeDestroyed");
static_assert(sizeof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed) == 0x000008, "Wrong size on FirstPersonProjectile_C_BP_IsReadyToBeDestroyed");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, ReturnValue) == 0x000000, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_IsActive_ReturnValue) == 0x000002, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_BP_IsReadyToBeDestroyed_ReturnValue) == 0x000006, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_BP_IsReadyToBeDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_IsReadyToBeDestroyed, CallFunc_IsAnimationComplete_NewParam) == 0x000007, "Member 'FirstPersonProjectile_C_BP_IsReadyToBeDestroyed::CallFunc_IsAnimationComplete_NewParam' has a wrong offset!");

// Function FirstPersonProjectile.FirstPersonProjectile_C.BP_OnSetEnabled
// 0x0004 (0x0004 - 0x0000)
struct FirstPersonProjectile_C_BP_OnSetEnabled final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FirstPersonProjectile_C_BP_OnSetEnabled) == 0x000001, "Wrong alignment on FirstPersonProjectile_C_BP_OnSetEnabled");
static_assert(sizeof(FirstPersonProjectile_C_BP_OnSetEnabled) == 0x000004, "Wrong size on FirstPersonProjectile_C_BP_OnSetEnabled");
static_assert(offsetof(FirstPersonProjectile_C_BP_OnSetEnabled, NewState) == 0x000000, "Member 'FirstPersonProjectile_C_BP_OnSetEnabled::NewState' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_OnSetEnabled, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'FirstPersonProjectile_C_BP_OnSetEnabled::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_OnSetEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'FirstPersonProjectile_C_BP_OnSetEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonProjectile_C_BP_OnSetEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'FirstPersonProjectile_C_BP_OnSetEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

