#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPerson_AnimBP

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FP_AimingDelayFactor_structs.hpp"
#include "FPWeaponAnimSet_structs.hpp"


namespace SDK::Params
{

// Function FirstPerson_AnimBP.FirstPerson_AnimBP_C.ExecuteUbergraph_FirstPerson_AnimBP
// 0x0440 (0x0440 - 0x0000)
struct FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceStateWeight_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceTransitionTimeElapsedFraction_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_6;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_StartTime;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_7;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   K2Node_CustomEvent_NewWeapon;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_AimPointLocalTransform;         // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_ADSAimPointLocalTransform;      // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FFPWeaponAnimSet                       CallFunc_Map_Find_Value;                           // 0x0110(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue_1; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_8;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceStateWeight_ReturnValue_1;     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_9;               // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x021A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x021B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1; // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x022B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPWeaponAnimSet                       CallFunc_Map_Find_Value_1;                         // 0x0280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EF[0x1];                                      // 0x02EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCloneIndex_ReturnValue;                // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalWeapon*                        CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetAimPointLocalTransform_ReturnValue;    // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	class UMeshComponent*                         CallFunc_GetMeshTP_ReturnValue;                    // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusing_ReturnValue;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_9;                 // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35B[0x5];                                      // 0x035B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0360(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRespawning_ReturnValue;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_10;                // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue_2; // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_10;              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceStateWeight_ReturnValue_2;     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_6;                     // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x03A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterHasExtraFlag_ReturnValue;        // 0x03A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterHasLocomotionFlag_ReturnValue;   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_11;              // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_11;                // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SetIterp_Aiming_Delay_ReturnValue;        // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyThisFlags_ReturnValue;              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0xF];                                      // 0x03E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SetIterp_Aiming_Delay_ReturnValue_1;      // 0x03F0(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_TransformToString_ReturnValue;       // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Xor_IntInt_ReturnValue;                   // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_7;                     // 0x043B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP) == 0x000010, "Wrong alignment on FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP");
static_assert(sizeof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP) == 0x000440, "Wrong size on FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, EntryPoint) == 0x000000, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetInstanceStateWeight_ReturnValue) == 0x000004, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetInstanceStateWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetInstanceTransitionTimeElapsedFraction_ReturnValue) == 0x000008, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetInstanceTransitionTimeElapsedFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable) == 0x000014, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Location) == 0x000018, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000024, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Scale) == 0x000030, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_1) == 0x00003D, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003E, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable_1) == 0x000040, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000048, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_2) == 0x000049, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable_2) == 0x00004A, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_3) == 0x00004C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable_3) == 0x00004D, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_4) == 0x00004E, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable_4) == 0x00004F, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_5) == 0x000050, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_6) == 0x000051, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_6' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_Event_DeltaTimeX) == 0x000054, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue) == 0x000058, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_NegateRotator_ReturnValue) == 0x000060, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00006C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000074, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000075, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000078, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x00007C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x00007D, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Percent_IntInt_ReturnValue) == 0x000080, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Array_Get_Item) == 0x000088, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000090, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_CustomEvent_StartTime) == 0x000094, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_CustomEvent_StartTime' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_7) == 0x000098, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_7' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x0000A0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_CustomEvent_NewWeapon) == 0x0000A8, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_CustomEvent_NewWeapon' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_CustomEvent_AimPointLocalTransform) == 0x0000B0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_CustomEvent_AimPointLocalTransform' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_CustomEvent_ADSAimPointLocalTransform) == 0x0000E0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_CustomEvent_ADSAimPointLocalTransform' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Map_Find_Value) == 0x000110, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Map_Find_ReturnValue) == 0x000170, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_IsClosed_Variable_5) == 0x000171, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_IsClosed_Variable_5' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue_1) == 0x000174, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000178, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_8) == 0x00017C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_8' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000180, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000188, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x000194, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0001A0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x0001AC, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakVector_X) == 0x0001B8, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakVector_Y) == 0x0001BC, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakVector_Z) == 0x0001C0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetInstanceStateWeight_ReturnValue_1) == 0x0001C4, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetInstanceStateWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001C8, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Has_Been_Initd_Variable_9) == 0x0001C9, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Has_Been_Initd_Variable_9' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0001CC, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x0001D0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_DynamicCast_AsCharacter) == 0x0001D8, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetControlRotation_ReturnValue) == 0x0001E4, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetVelocity_ReturnValue_1) == 0x0001F0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_VSize_ReturnValue) == 0x0001FC, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_GetGameState_ReturnValue) == 0x000200, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000210, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000218, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000219, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00021A, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_SwitchEnum_CmpSuccess) == 0x00021B, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x00021C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1) == 0x000220, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue_2) == 0x000228, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x000229, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x00022A, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00022B, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00022C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x00022D, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000230, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000234, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Location_1) == 0x000238, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x000244, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x000250, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue_3) == 0x00025C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_6) == 0x00025D, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000260, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000264, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2) == 0x000268, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, Temp_float_Variable) == 0x000270, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000274, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000278, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Montage_IsPlaying_ReturnValue) == 0x000279, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue_4) == 0x00027A, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_BooleanAND_ReturnValue_7) == 0x00027B, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_MakeLiteralByte_ReturnValue) == 0x00027C, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Map_Find_Value_1) == 0x000280, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Map_Find_ReturnValue_1) == 0x0002E0, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0002E4, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0002E8, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0002E9, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_IsValid_ReturnValue_5) == 0x0002EA, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0002EB, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002EC, "Member 'FirstPerson_AnimBP_C_ExecuteUbergraph_FirstPerson_AnimBP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
