#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FluxPlayerControllerBP

#include "Basic.hpp"

#include "WeaponImpactData_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FluxPlayerControllerBP.FluxPlayerControllerBP_C.ExecuteUbergraph_FluxPlayerControllerBP
// 0x0140 (0x0140 - 0x0000)
struct FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue_1;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWeaponAccuracyTest_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FWeaponImpactData>              K2Node_CustomEvent_NewParam;                       // 0x00B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AWeaponAccuracyTest_C*                  CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AWeaponAccuracyTest_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	class AWeaponAccuracyTest_C*                  CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x00E8(0x0018)(HasGetValueTypeHash)
	TArray<class AWeaponAccuracyTest_C*>          CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	class AWeaponAccuracyTest_C*                  CallFunc_Array_Get_Item_2;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue_1;                  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP) == 0x000008, "Wrong alignment on FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP");
static_assert(sizeof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP) == 0x000140, "Wrong size on FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, EntryPoint) == 0x000000, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, K2Node_InputActionEvent_Key) == 0x000008, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Min_ReturnValue) == 0x000028, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Max_ReturnValue) == 0x00002C, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_GetGameUserSettings_ReturnValue) == 0x000030, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000070, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Conv_FloatToString_ReturnValue) == 0x000078, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000088, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_IsEditor_ReturnValue) == 0x0000A0, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_IsEditor_ReturnValue_1) == 0x0000A1, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_IsEditor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000A8, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, K2Node_CustomEvent_NewParam) == 0x0000B8, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000D0, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, K2Node_InputActionEvent_Key_1) == 0x0000E8, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000100, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_Array_Get_Item_2) == 0x000110, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000124, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_PostSound_ReturnValue) == 0x000130, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP, CallFunc_PostSound_ReturnValue_1) == 0x000138, "Member 'FluxPlayerControllerBP_C_ExecuteUbergraph_FluxPlayerControllerBP::CallFunc_PostSound_ReturnValue_1' has a wrong offset!");

// Function FluxPlayerControllerBP.FluxPlayerControllerBP_C.Client_SendAccuracyData
// 0x0010 (0x0010 - 0x0000)
struct FluxPlayerControllerBP_C_Client_SendAccuracyData final
{
public:
	TArray<struct FWeaponImpactData>              NewParam;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(FluxPlayerControllerBP_C_Client_SendAccuracyData) == 0x000008, "Wrong alignment on FluxPlayerControllerBP_C_Client_SendAccuracyData");
static_assert(sizeof(FluxPlayerControllerBP_C_Client_SendAccuracyData) == 0x000010, "Wrong size on FluxPlayerControllerBP_C_Client_SendAccuracyData");
static_assert(offsetof(FluxPlayerControllerBP_C_Client_SendAccuracyData, NewParam) == 0x000000, "Member 'FluxPlayerControllerBP_C_Client_SendAccuracyData::NewParam' has a wrong offset!");

// Function FluxPlayerControllerBP.FluxPlayerControllerBP_C.InpActEvt_QualityMax_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0");
static_assert(sizeof(FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0");
static_assert(offsetof(FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'FluxPlayerControllerBP_C_InpActEvt_QualityMax_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function FluxPlayerControllerBP.FluxPlayerControllerBP_C.InpActEvt_QualityMin_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1");
static_assert(sizeof(FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1");
static_assert(offsetof(FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'FluxPlayerControllerBP_C_InpActEvt_QualityMin_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function FluxPlayerControllerBP.FluxPlayerControllerBP_C.GetControlsWidgetContainer
// 0x0040 (0x0040 - 0x0000)
struct FluxPlayerControllerBP_C_GetControlsWidgetContainer final
{
public:
	class UNGDWidgetContainer*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchHUD*                          K2Node_DynamicCast_AsTime_Watch_HUD;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDManagedLayer*                       CallFunc_GetLayer_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDHUDState*                           CallFunc_GetState_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWC_ReplayControls_C*                   CallFunc_GetWidgetContainer_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FluxPlayerControllerBP_C_GetControlsWidgetContainer) == 0x000008, "Wrong alignment on FluxPlayerControllerBP_C_GetControlsWidgetContainer");
static_assert(sizeof(FluxPlayerControllerBP_C_GetControlsWidgetContainer) == 0x000040, "Wrong size on FluxPlayerControllerBP_C_GetControlsWidgetContainer");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, ReturnValue) == 0x000000, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, K2Node_DynamicCast_AsTime_Watch_HUD) == 0x000010, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::K2Node_DynamicCast_AsTime_Watch_HUD' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, CallFunc_GetLayer_ReturnValue) == 0x000020, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::CallFunc_GetLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, CallFunc_GetState_ReturnValue) == 0x000028, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, CallFunc_GetWidgetContainer_ReturnValue) == 0x000030, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::CallFunc_GetWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FluxPlayerControllerBP_C_GetControlsWidgetContainer, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'FluxPlayerControllerBP_C_GetControlsWidgetContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

