#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FP_AimingDelayFactor

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FP_AimingDelayFactor.FP_AimingDelayFactor
// 0x0020 (0x0020 - 0x0000)
struct FFP_AimingDelayFactor final
{
public:
	float                                         InterpSpeed_21_B7765AC2498839EA99A12AAB033BF2E1;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           AimingDelayCurve_46_8865AB354AE103084FF2BCAE043F46DF; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            RollByStafeSpeed_31_8C423CBB4632B5BF0A43439AF342E6A4; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationZRollValue_34_A44ADA9742A02B631A72B2B7DC1D3F3A; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FFP_AimingDelayFactor) == 0x000008, "Wrong alignment on FFP_AimingDelayFactor");
static_assert(sizeof(FFP_AimingDelayFactor) == 0x000020, "Wrong size on FFP_AimingDelayFactor");
static_assert(offsetof(FFP_AimingDelayFactor, InterpSpeed_21_B7765AC2498839EA99A12AAB033BF2E1) == 0x000000, "Member 'FFP_AimingDelayFactor::InterpSpeed_21_B7765AC2498839EA99A12AAB033BF2E1' has a wrong offset!");
static_assert(offsetof(FFP_AimingDelayFactor, AimingDelayCurve_46_8865AB354AE103084FF2BCAE043F46DF) == 0x000008, "Member 'FFP_AimingDelayFactor::AimingDelayCurve_46_8865AB354AE103084FF2BCAE043F46DF' has a wrong offset!");
static_assert(offsetof(FFP_AimingDelayFactor, RollByStafeSpeed_31_8C423CBB4632B5BF0A43439AF342E6A4) == 0x000010, "Member 'FFP_AimingDelayFactor::RollByStafeSpeed_31_8C423CBB4632B5BF0A43439AF342E6A4' has a wrong offset!");
static_assert(offsetof(FFP_AimingDelayFactor, LocationZRollValue_34_A44ADA9742A02B631A72B2B7DC1D3F3A) == 0x000018, "Member 'FFP_AimingDelayFactor::LocationZRollValue_34_A44ADA9742A02B631A72B2B7DC1D3F3A' has a wrong offset!");

}

