#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPWeaponAnimSet

#include "Basic.hpp"

#include "FP_AimingDelayFactor_structs.hpp"


namespace SDK
{

// UserDefinedStruct FPWeaponAnimSet.FPWeaponAnimSet
// 0x0060 (0x0060 - 0x0000)
struct FFPWeaponAnimSet final
{
public:
	class UAnimSequence*                          Fire_2_261AA78D4F937D4B7F707EA31B8C6B0F;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Reload_4_5FBF171149152D61C8006680E31CF725;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Melee_7_149570124811CFAFD670C4AD705B583B;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFP_AimingDelayFactor                  StandingAimingDelay_24_ABBF402C4C5395ED48C2B4BEDEB4F818; // 0x0018(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFP_AimingDelayFactor                  ADSAimingDelay_26_10B4CDF44FFB16FD273E039B51A706BA; // 0x0038(0x0020)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableADS_28_74C9B2354ECD822F76897B924C0A2E67;     // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FFPWeaponAnimSet) == 0x000008, "Wrong alignment on FFPWeaponAnimSet");
static_assert(sizeof(FFPWeaponAnimSet) == 0x000060, "Wrong size on FFPWeaponAnimSet");
static_assert(offsetof(FFPWeaponAnimSet, Fire_2_261AA78D4F937D4B7F707EA31B8C6B0F) == 0x000000, "Member 'FFPWeaponAnimSet::Fire_2_261AA78D4F937D4B7F707EA31B8C6B0F' has a wrong offset!");
static_assert(offsetof(FFPWeaponAnimSet, Reload_4_5FBF171149152D61C8006680E31CF725) == 0x000008, "Member 'FFPWeaponAnimSet::Reload_4_5FBF171149152D61C8006680E31CF725' has a wrong offset!");
static_assert(offsetof(FFPWeaponAnimSet, Melee_7_149570124811CFAFD670C4AD705B583B) == 0x000010, "Member 'FFPWeaponAnimSet::Melee_7_149570124811CFAFD670C4AD705B583B' has a wrong offset!");
static_assert(offsetof(FFPWeaponAnimSet, StandingAimingDelay_24_ABBF402C4C5395ED48C2B4BEDEB4F818) == 0x000018, "Member 'FFPWeaponAnimSet::StandingAimingDelay_24_ABBF402C4C5395ED48C2B4BEDEB4F818' has a wrong offset!");
static_assert(offsetof(FFPWeaponAnimSet, ADSAimingDelay_26_10B4CDF44FFB16FD273E039B51A706BA) == 0x000038, "Member 'FFPWeaponAnimSet::ADSAimingDelay_26_10B4CDF44FFB16FD273E039B51A706BA' has a wrong offset!");
static_assert(offsetof(FFPWeaponAnimSet, EnableADS_28_74C9B2354ECD822F76897B924C0A2E67) == 0x000058, "Member 'FFPWeaponAnimSet::EnableADS_28_74C9B2354ECD822F76897B924C0A2E67' has a wrong offset!");

}

