#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthPickUpBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UnrealProject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HealthPickUpBP.HealthPickUpBP_C.ExecuteUbergraph_HealthPickUpBP
// 0x0310 (0x0310 - 0x0000)
struct HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             CallFunc_GetCollisionEnabled_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedCooldownPercent_ReturnValue;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ID;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Interactor;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWCharacterBP_C*                       K2Node_DynamicCast_AsTWCharacter_BP;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_CustomEvent_HealedCharacter;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WasRevived;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INGDDamageable>        CallFunc_IsAlive_self_CastInput;                   // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetHealth_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnCooldown_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CanInteract_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentTime_ReturnValue;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x01E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FNGDDamageEvent                        K2Node_MakeStruct_NGDDamageEvent;                  // 0x01F8(0x0040)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class INGDDamageable>        CallFunc_TakeDamage_self_CastInput;                // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0257(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State_1;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentTime_ReturnValue_1;             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x029C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x02C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x02D0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetFloatCVar_ReturnValue;                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_Event_Character;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasReSynced;                         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02FC(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP) == 0x000008, "Wrong alignment on HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP");
static_assert(sizeof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP) == 0x000310, "Wrong size on HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, EntryPoint) == 0x000000, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000006, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_struct_Variable) == 0x000008, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000019, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_HasAuthority_ReturnValue_1) == 0x00001A, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001B, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetCollisionEnabled_ReturnValue) == 0x00001C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetCollisionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001E, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00001F, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000020, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000028, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetElapsedCooldownPercent_ReturnValue) == 0x00002C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetElapsedCooldownPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Event_ID) == 0x000030, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Event_ID' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Event_Interactor) == 0x000038, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Event_Interactor' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_AsTWCharacter_BP) == 0x000048, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_AsTWCharacter_BP' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_CustomEvent_HealedCharacter) == 0x000058, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_CustomEvent_HealedCharacter' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_CustomEvent_WasRevived) == 0x000060, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_CustomEvent_WasRevived' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsAlive_self_CastInput) == 0x000068, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsAlive_self_CastInput' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsAlive_ReturnValue) == 0x000078, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x000079, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BP_GetHealth_ReturnValue) == 0x00007C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BP_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000080, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x000084, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000090, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000094, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Cos_ReturnValue) == 0x00011C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000120, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_MakeVector_ReturnValue) == 0x000124, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsOnCooldown_ReturnValue) == 0x000130, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsOnCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Add_VectorVector_ReturnValue) == 0x000134, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000140, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_CanInteract_ReturnValue) == 0x0001C8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_CanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetGameState_ReturnValue) == 0x0001D0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x0001D8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_bSuccess_1) == 0x0001E0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetCurrentTime_ReturnValue) == 0x0001E4, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_struct_Variable_1) == 0x0001E8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_MakeStruct_NGDDamageEvent) == 0x0001F8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_MakeStruct_NGDDamageEvent' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetPlayerController_ReturnValue) == 0x000238, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_TakeDamage_self_CastInput) == 0x000240, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_TakeDamage_self_CastInput' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_6) == 0x000250, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_HasAuthority_ReturnValue_2) == 0x000251, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_7) == 0x000252, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_HasAuthority_ReturnValue_3) == 0x000253, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000254, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_8) == 0x000255, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_9) == 0x000256, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000257, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000258, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Not_PreBool_ReturnValue_10) == 0x000259, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BooleanOR_ReturnValue_3) == 0x00025A, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00025C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000260, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetGameState_ReturnValue_1) == 0x000268, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_FClamp_ReturnValue_1) == 0x000270, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_AsTime_Watch_Game_State_1) == 0x000278, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_AsTime_Watch_Game_State_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_DynamicCast_bSuccess_2) == 0x000280, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetCurrentTime_ReturnValue_1) == 0x000284, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetCurrentTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_struct_Variable_2) == 0x000288, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_bool_Variable) == 0x000298, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_delegate_Variable) == 0x00029C, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_PostAkEvent_ReturnValue) == 0x0002AC, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Select_Default) == 0x0002B0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_delegate_Variable_1) == 0x0002C0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, Temp_struct_Variable_3) == 0x0002D0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_GetFloatCVar_ReturnValue) == 0x0002E0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_GetFloatCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_PostAkEvent_ReturnValue_1) == 0x0002E4, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0002E8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Event_Character) == 0x0002F0, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_Event_bWasReSynced) == 0x0002F8, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_Event_bWasReSynced' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, CallFunc_BooleanOR_ReturnValue_4) == 0x0002F9, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP, K2Node_CreateDelegate_OutputDelegate) == 0x0002FC, "Member 'HealthPickUpBP_C_ExecuteUbergraph_HealthPickUpBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.BP_TriggerHealOverTime
// 0x0010 (0x0010 - 0x0000)
struct HealthPickUpBP_C_BP_TriggerHealOverTime final
{
public:
	class ATimeWatchCharacter*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasReSynced;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthPickUpBP_C_BP_TriggerHealOverTime) == 0x000008, "Wrong alignment on HealthPickUpBP_C_BP_TriggerHealOverTime");
static_assert(sizeof(HealthPickUpBP_C_BP_TriggerHealOverTime) == 0x000010, "Wrong size on HealthPickUpBP_C_BP_TriggerHealOverTime");
static_assert(offsetof(HealthPickUpBP_C_BP_TriggerHealOverTime, Character) == 0x000000, "Member 'HealthPickUpBP_C_BP_TriggerHealOverTime::Character' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_BP_TriggerHealOverTime, bWasReSynced) == 0x000008, "Member 'HealthPickUpBP_C_BP_TriggerHealOverTime::bWasReSynced' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.OnHealthPickUp
// 0x0010 (0x0010 - 0x0000)
struct HealthPickUpBP_C_OnHealthPickUp final
{
public:
	class ATimeWatchCharacter*                    HealedCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasRevived;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthPickUpBP_C_OnHealthPickUp) == 0x000008, "Wrong alignment on HealthPickUpBP_C_OnHealthPickUp");
static_assert(sizeof(HealthPickUpBP_C_OnHealthPickUp) == 0x000010, "Wrong size on HealthPickUpBP_C_OnHealthPickUp");
static_assert(offsetof(HealthPickUpBP_C_OnHealthPickUp, HealedCharacter) == 0x000000, "Member 'HealthPickUpBP_C_OnHealthPickUp::HealedCharacter' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_OnHealthPickUp, WasRevived) == 0x000008, "Member 'HealthPickUpBP_C_OnHealthPickUp::WasRevived' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.BP_Authority_OnInteraction
// 0x0010 (0x0010 - 0x0000)
struct HealthPickUpBP_C_BP_Authority_OnInteraction final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthPickUpBP_C_BP_Authority_OnInteraction) == 0x000008, "Wrong alignment on HealthPickUpBP_C_BP_Authority_OnInteraction");
static_assert(sizeof(HealthPickUpBP_C_BP_Authority_OnInteraction) == 0x000010, "Wrong size on HealthPickUpBP_C_BP_Authority_OnInteraction");
static_assert(offsetof(HealthPickUpBP_C_BP_Authority_OnInteraction, ID) == 0x000000, "Member 'HealthPickUpBP_C_BP_Authority_OnInteraction::ID' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_BP_Authority_OnInteraction, Interactor) == 0x000008, "Member 'HealthPickUpBP_C_BP_Authority_OnInteraction::Interactor' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct HealthPickUpBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthPickUpBP_C_ReceiveTick) == 0x000004, "Wrong alignment on HealthPickUpBP_C_ReceiveTick");
static_assert(sizeof(HealthPickUpBP_C_ReceiveTick) == 0x000004, "Wrong size on HealthPickUpBP_C_ReceiveTick");
static_assert(offsetof(HealthPickUpBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'HealthPickUpBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.Construction
// 0x0060 (0x0060 - 0x0000)
struct HealthPickUpBP_C_Construction final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HealthKitPickup_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthPickUpBP_C_Construction) == 0x000010, "Wrong alignment on HealthPickUpBP_C_Construction");
static_assert(sizeof(HealthPickUpBP_C_Construction) == 0x000060, "Wrong size on HealthPickUpBP_C_Construction");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'HealthPickUpBP_C_Construction::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000030, "Member 'HealthPickUpBP_C_Construction::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_FinishSpawningActor_ReturnValue) == 0x000038, "Member 'HealthPickUpBP_C_Construction::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_GetMaterial_ReturnValue) == 0x000040, "Member 'HealthPickUpBP_C_Construction::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000048, "Member 'HealthPickUpBP_C_Construction::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_Construction, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000050, "Member 'HealthPickUpBP_C_Construction::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.SetPoisonStatus
// 0x0001 (0x0001 - 0x0000)
struct HealthPickUpBP_C_SetPoisonStatus final
{
public:
	bool                                          Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthPickUpBP_C_SetPoisonStatus) == 0x000001, "Wrong alignment on HealthPickUpBP_C_SetPoisonStatus");
static_assert(sizeof(HealthPickUpBP_C_SetPoisonStatus) == 0x000001, "Wrong size on HealthPickUpBP_C_SetPoisonStatus");
static_assert(offsetof(HealthPickUpBP_C_SetPoisonStatus, Status) == 0x000000, "Member 'HealthPickUpBP_C_SetPoisonStatus::Status' has a wrong offset!");

// Function HealthPickUpBP.HealthPickUpBP_C.CosmeticOnly_UpdateColor
// 0x0002 (0x0002 - 0x0000)
struct HealthPickUpBP_C_CosmeticOnly_UpdateColor final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthPickUpBP_C_CosmeticOnly_UpdateColor) == 0x000001, "Wrong alignment on HealthPickUpBP_C_CosmeticOnly_UpdateColor");
static_assert(sizeof(HealthPickUpBP_C_CosmeticOnly_UpdateColor) == 0x000002, "Wrong size on HealthPickUpBP_C_CosmeticOnly_UpdateColor");
static_assert(offsetof(HealthPickUpBP_C_CosmeticOnly_UpdateColor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'HealthPickUpBP_C_CosmeticOnly_UpdateColor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthPickUpBP_C_CosmeticOnly_UpdateColor, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'HealthPickUpBP_C_CosmeticOnly_UpdateColor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

