#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthpackCompass

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HealthpackCompass.HealthpackCompass_C.ExecuteUbergraph_HealthpackCompass
// 0x0080 (0x0080 - 0x0000)
struct HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Distance;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0020(0x0018)()
	TArray<class AHealthPickUpBP_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass) == 0x000008, "Wrong alignment on HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass");
static_assert(sizeof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass) == 0x000080, "Wrong size on HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, EntryPoint) == 0x000000, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000010, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, K2Node_Event_Distance) == 0x000014, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::K2Node_Event_Distance' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Conv_FloatToText_ReturnValue) == 0x000020, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_GetAllActorsOfClass_OutActors) == 0x000038, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'HealthpackCompass_C_ExecuteUbergraph_HealthpackCompass::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function HealthpackCompass.HealthpackCompass_C.OnUpdated
// 0x0004 (0x0004 - 0x0000)
struct HealthpackCompass_C_OnUpdated final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthpackCompass_C_OnUpdated) == 0x000004, "Wrong alignment on HealthpackCompass_C_OnUpdated");
static_assert(sizeof(HealthpackCompass_C_OnUpdated) == 0x000004, "Wrong size on HealthpackCompass_C_OnUpdated");
static_assert(offsetof(HealthpackCompass_C_OnUpdated, Distance) == 0x000000, "Member 'HealthpackCompass_C_OnUpdated::Distance' has a wrong offset!");

// Function HealthpackCompass.HealthpackCompass_C.SetClosestHealthPack
// 0x0078 (0x0078 - 0x0000)
struct HealthpackCompass_C_SetClosestHealthPack final
{
public:
	float                                         SquaredDistAux;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Aux;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATWHealthPackActor*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWHealthPackActor*                     CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteract_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthpackCompass_C_SetClosestHealthPack) == 0x000008, "Wrong alignment on HealthpackCompass_C_SetClosestHealthPack");
static_assert(sizeof(HealthpackCompass_C_SetClosestHealthPack) == 0x000078, "Wrong size on HealthpackCompass_C_SetClosestHealthPack");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, SquaredDistAux) == 0x000000, "Member 'HealthpackCompass_C_SetClosestHealthPack::SquaredDistAux' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, Aux) == 0x000004, "Member 'HealthpackCompass_C_SetClosestHealthPack::Aux' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, Temp_int_Variable) == 0x000008, "Member 'HealthpackCompass_C_SetClosestHealthPack::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Array_Get_Item) == 0x000010, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000019, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_CanInteract_ReturnValue) == 0x00004C, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_CanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Greater_IntInt_ReturnValue) == 0x00004D, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000050, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_VSizeSquared_ReturnValue) == 0x00006C, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000075, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_SetClosestHealthPack, CallFunc_BooleanOR_ReturnValue) == 0x000076, "Member 'HealthpackCompass_C_SetClosestHealthPack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function HealthpackCompass.HealthpackCompass_C.IsCompassVisible
// 0x0040 (0x0040 - 0x0000)
struct HealthpackCompass_C_IsCompassVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchCharacter*                    K2Node_DynamicCast_AsTime_Watch_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INGDDamageable>        CallFunc_IsAlive_self_CastInput;                   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HealthpackCompass_C_IsCompassVisible) == 0x000008, "Wrong alignment on HealthpackCompass_C_IsCompassVisible");
static_assert(sizeof(HealthpackCompass_C_IsCompassVisible) == 0x000040, "Wrong size on HealthpackCompass_C_IsCompassVisible");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, ReturnValue) == 0x000000, "Member 'HealthpackCompass_C_IsCompassVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'HealthpackCompass_C_IsCompassVisible::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, CallFunc_GetViewTarget_ReturnValue) == 0x000010, "Member 'HealthpackCompass_C_IsCompassVisible::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, K2Node_DynamicCast_AsTime_Watch_Character) == 0x000018, "Member 'HealthpackCompass_C_IsCompassVisible::K2Node_DynamicCast_AsTime_Watch_Character' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HealthpackCompass_C_IsCompassVisible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, CallFunc_IsAlive_self_CastInput) == 0x000028, "Member 'HealthpackCompass_C_IsCompassVisible::CallFunc_IsAlive_self_CastInput' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, CallFunc_IsAlive_ReturnValue) == 0x000038, "Member 'HealthpackCompass_C_IsCompassVisible::CallFunc_IsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthpackCompass_C_IsCompassVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'HealthpackCompass_C_IsCompassVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

