#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthpackCompass

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HealthpackCompass.HealthpackCompass_C
// 0x0040 (0x0310 - 0x02D0)
class UHealthpackCompass_C final : public UTWActorCompass
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BlinkAnimation;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 aro_animado;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_214;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Distance;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class ATWHealthPackActor*>             AvailableHealthpacks;                              // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_HealthpackCompass(int32 EntryPoint);
	void OnPreUpdate();
	void OnUpdated(float Distance);
	void Construct();
	void SetClosestHealthPack();

	bool IsCompassVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthpackCompass_C">();
	}
	static class UHealthpackCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthpackCompass_C>();
	}
};
static_assert(alignof(UHealthpackCompass_C) == 0x000008, "Wrong alignment on UHealthpackCompass_C");
static_assert(sizeof(UHealthpackCompass_C) == 0x000310, "Wrong size on UHealthpackCompass_C");
static_assert(offsetof(UHealthpackCompass_C, UberGraphFrame) == 0x0002D0, "Member 'UHealthpackCompass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, BlinkAnimation) == 0x0002D8, "Member 'UHealthpackCompass_C::BlinkAnimation' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, aro_animado) == 0x0002E0, "Member 'UHealthpackCompass_C::aro_animado' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, Image_0) == 0x0002E8, "Member 'UHealthpackCompass_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, Image_214) == 0x0002F0, "Member 'UHealthpackCompass_C::Image_214' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, Text_Distance) == 0x0002F8, "Member 'UHealthpackCompass_C::Text_Distance' has a wrong offset!");
static_assert(offsetof(UHealthpackCompass_C, AvailableHealthpacks) == 0x000300, "Member 'UHealthpackCompass_C::AvailableHealthpacks' has a wrong offset!");

}

