#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardSlotWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardSlotWidget.LeaderboardSlotWidget_C
// 0x0040 (0x02C0 - 0x0280)
class ULeaderboardSlotWidget_C final : public UWidgetContainerLeaderboardSlot
{
public:
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_80;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_82;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_88;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_89;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboardSlotWidget_C">();
	}
	static class ULeaderboardSlotWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardSlotWidget_C>();
	}
};
static_assert(alignof(ULeaderboardSlotWidget_C) == 0x000008, "Wrong alignment on ULeaderboardSlotWidget_C");
static_assert(sizeof(ULeaderboardSlotWidget_C) == 0x0002C0, "Wrong size on ULeaderboardSlotWidget_C");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_0) == 0x000280, "Member 'ULeaderboardSlotWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_1) == 0x000288, "Member 'ULeaderboardSlotWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_60) == 0x000290, "Member 'ULeaderboardSlotWidget_C::Image_60' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_80) == 0x000298, "Member 'ULeaderboardSlotWidget_C::Image_80' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_82) == 0x0002A0, "Member 'ULeaderboardSlotWidget_C::Image_82' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_87) == 0x0002A8, "Member 'ULeaderboardSlotWidget_C::Image_87' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_88) == 0x0002B0, "Member 'ULeaderboardSlotWidget_C::Image_88' has a wrong offset!");
static_assert(offsetof(ULeaderboardSlotWidget_C, Image_89) == 0x0002B8, "Member 'ULeaderboardSlotWidget_C::Image_89' has a wrong offset!");

}

