#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreenWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadingScreenWidget.LoadingScreenWidget_C
// 0x0030 (0x0328 - 0x02F8)
class ULoadingScreenWidget_C final : public UTWLoadingScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_GameModeInfoBG;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LoadingBG;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_LoadAnimation_C*                LoadingThrobber;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ThrobberRotation;                                  // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LoadingScreenWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadingScreenWidget_C">();
	}
	static class ULoadingScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenWidget_C>();
	}
};
static_assert(alignof(ULoadingScreenWidget_C) == 0x000008, "Wrong alignment on ULoadingScreenWidget_C");
static_assert(sizeof(ULoadingScreenWidget_C) == 0x000328, "Wrong size on ULoadingScreenWidget_C");
static_assert(offsetof(ULoadingScreenWidget_C, UberGraphFrame) == 0x0002F8, "Member 'ULoadingScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWidget_C, Loading) == 0x000300, "Member 'ULoadingScreenWidget_C::Loading' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWidget_C, Image_GameModeInfoBG) == 0x000308, "Member 'ULoadingScreenWidget_C::Image_GameModeInfoBG' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWidget_C, Image_LoadingBG) == 0x000310, "Member 'ULoadingScreenWidget_C::Image_LoadingBG' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWidget_C, LoadingThrobber) == 0x000318, "Member 'ULoadingScreenWidget_C::LoadingThrobber' has a wrong offset!");
static_assert(offsetof(ULoadingScreenWidget_C, ThrobberRotation) == 0x000320, "Member 'ULoadingScreenWidget_C::ThrobberRotation' has a wrong offset!");

}

