#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapAudio

#include "Basic.hpp"


namespace SDK::Params
{

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.SetOnAudioJackPluggedDelegate
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate final
{
public:
	TDelegate<void()>                             ResultDelegate;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate) == 0x000004, "Wrong alignment on MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate");
static_assert(sizeof(MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate) == 0x000014, "Wrong size on MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate");
static_assert(offsetof(MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate, ResultDelegate) == 0x000000, "Member 'MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate::ResultDelegate' has a wrong offset!");
static_assert(offsetof(MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate, ReturnValue) == 0x000010, "Member 'MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate::ReturnValue' has a wrong offset!");

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.SetOnAudioJackUnpluggedDelegate
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate final
{
public:
	TDelegate<void()>                             ResultDelegate;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate) == 0x000004, "Wrong alignment on MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate");
static_assert(sizeof(MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate) == 0x000014, "Wrong size on MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate");
static_assert(offsetof(MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate, ResultDelegate) == 0x000000, "Member 'MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate::ResultDelegate' has a wrong offset!");
static_assert(offsetof(MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate, ReturnValue) == 0x000010, "Member 'MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate::ReturnValue' has a wrong offset!");

}

