#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapPlanes

#include "Basic.hpp"

#include "MagicLeapPlanes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MagicLeapPlanes.MagicLeapPlanesComponent.RequestPlanesAsync
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesComponent_RequestPlanesAsync final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesComponent_RequestPlanesAsync) == 0x000001, "Wrong alignment on MagicLeapPlanesComponent_RequestPlanesAsync");
static_assert(sizeof(MagicLeapPlanesComponent_RequestPlanesAsync) == 0x000001, "Wrong size on MagicLeapPlanesComponent_RequestPlanesAsync");
static_assert(offsetof(MagicLeapPlanesComponent_RequestPlanesAsync, ReturnValue) == 0x000000, "Member 'MagicLeapPlanesComponent_RequestPlanesAsync::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.CreateTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_CreateTracker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_CreateTracker) == 0x000001, "Wrong alignment on MagicLeapPlanesFunctionLibrary_CreateTracker");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_CreateTracker) == 0x000001, "Wrong size on MagicLeapPlanesFunctionLibrary_CreateTracker");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_CreateTracker, ReturnValue) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_CreateTracker::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.DestroyTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_DestroyTracker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_DestroyTracker) == 0x000001, "Wrong alignment on MagicLeapPlanesFunctionLibrary_DestroyTracker");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_DestroyTracker) == 0x000001, "Wrong size on MagicLeapPlanesFunctionLibrary_DestroyTracker");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_DestroyTracker, ReturnValue) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_DestroyTracker::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.GetContentScale
// 0x0090 (0x0090 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_GetContentScale final
{
public:
	const class AActor*                           ContentActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapPlaneResult                  PlaneResult;                                       // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_GetContentScale) == 0x000010, "Wrong alignment on MagicLeapPlanesFunctionLibrary_GetContentScale");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_GetContentScale) == 0x000090, "Wrong size on MagicLeapPlanesFunctionLibrary_GetContentScale");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_GetContentScale, ContentActor) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_GetContentScale::ContentActor' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_GetContentScale, PlaneResult) == 0x000008, "Member 'MagicLeapPlanesFunctionLibrary_GetContentScale::PlaneResult' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_GetContentScale, ReturnValue) == 0x000060, "Member 'MagicLeapPlanesFunctionLibrary_GetContentScale::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.IsTrackerValid
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_IsTrackerValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_IsTrackerValid) == 0x000001, "Wrong alignment on MagicLeapPlanesFunctionLibrary_IsTrackerValid");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_IsTrackerValid) == 0x000001, "Wrong size on MagicLeapPlanesFunctionLibrary_IsTrackerValid");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_IsTrackerValid, ReturnValue) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_IsTrackerValid::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.PlanesQueryBeginAsync
// 0x0070 (0x0070 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync final
{
public:
	struct FMagicLeapPlanesQuery                  Query;                                             // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(const bool bSuccess, const TArray<struct FMagicLeapPlaneResult>& Planes, const TArray<struct FMagicLeapPlaneBoundaries>& Polygons)> ResultDelegate; // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync) == 0x000010, "Wrong alignment on MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync) == 0x000070, "Wrong size on MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync, Query) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync::Query' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync, ResultDelegate) == 0x000050, "Member 'MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync::ResultDelegate' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync, ReturnValue) == 0x000060, "Member 'MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync::ReturnValue' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.RemoveFlagsNotInQuery
// 0x0030 (0x0030 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery final
{
public:
	TArray<EMagicLeapPlaneQueryFlags>             InQueryFlags;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             InResultFlags;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             OutFlags;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery) == 0x000008, "Wrong alignment on MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery) == 0x000030, "Wrong size on MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery, InQueryFlags) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery::InQueryFlags' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery, InResultFlags) == 0x000010, "Member 'MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery::InResultFlags' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery, OutFlags) == 0x000020, "Member 'MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery::OutFlags' has a wrong offset!");

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.ReorderPlaneFlags
// 0x0030 (0x0030 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags final
{
public:
	TArray<EMagicLeapPlaneQueryFlags>             InPriority;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             InFlagsToReorder;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             OutReorderedFlags;                                 // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags) == 0x000008, "Wrong alignment on MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags");
static_assert(sizeof(MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags) == 0x000030, "Wrong size on MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags, InPriority) == 0x000000, "Member 'MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags::InPriority' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags, InFlagsToReorder) == 0x000010, "Member 'MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags::InFlagsToReorder' has a wrong offset!");
static_assert(offsetof(MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags, OutReorderedFlags) == 0x000020, "Member 'MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags::OutReorderedFlags' has a wrong offset!");

}

