#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuButton_Big

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StandardButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenuButton_Big.MainMenuButton_Big_C
// 0x0020 (0x0AE0 - 0x0AC0)
class UMainMenuButton_Big_C final : public UStandardButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Button_Hovered;                                    // 0x0AC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_gradient;                                    // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_white_border;                                // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenuButton_Big(int32 EntryPoint);
	void BndEvt__Button_Selection_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Selection_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BP_TWFocusLostEvent();
	void BP_TWFocusReceivedEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenuButton_Big_C">();
	}
	static class UMainMenuButton_Big_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenuButton_Big_C>();
	}
};
static_assert(alignof(UMainMenuButton_Big_C) == 0x000008, "Wrong alignment on UMainMenuButton_Big_C");
static_assert(sizeof(UMainMenuButton_Big_C) == 0x000AE0, "Wrong size on UMainMenuButton_Big_C");
static_assert(offsetof(UMainMenuButton_Big_C, UberGraphFrame) == 0x000AC0, "Member 'UMainMenuButton_Big_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenuButton_Big_C, Button_Hovered) == 0x000AC8, "Member 'UMainMenuButton_Big_C::Button_Hovered' has a wrong offset!");
static_assert(offsetof(UMainMenuButton_Big_C, Image_gradient) == 0x000AD0, "Member 'UMainMenuButton_Big_C::Image_gradient' has a wrong offset!");
static_assert(offsetof(UMainMenuButton_Big_C, Image_white_border) == 0x000AD8, "Member 'UMainMenuButton_Big_C::Image_white_border' has a wrong offset!");

}

