#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MainMenu.MainMenu_C.ExecuteUbergraph_MainMenu
// 0x0060 (0x0060 - 0x0000)
struct MainMenu_C_ExecuteUbergraph_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CallFunc_GetCineCameraComponent_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000008, "Wrong alignment on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(sizeof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000060, "Wrong size on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, EntryPoint) == 0x000000, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Array_Get_Item) == 0x000020, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetViewportSize_ReturnValue) == 0x00002C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_BreakVector2D_X) == 0x000034, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetCineCameraComponent_ReturnValue) == 0x000040, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetCineCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000050, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetCineCameraComponent_ReturnValue_1) == 0x000058, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetCineCameraComponent_ReturnValue_1' has a wrong offset!");

// Function MainMenu.MainMenu_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MainMenu_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_ReceiveTick) == 0x000004, "Wrong alignment on MainMenu_C_ReceiveTick");
static_assert(sizeof(MainMenu_C_ReceiveTick) == 0x000004, "Wrong size on MainMenu_C_ReceiveTick");
static_assert(offsetof(MainMenu_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MainMenu_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

