#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuHUD_BP

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainMenuHUD_BP.MainMenuHUD_BP_C
// 0x0018 (0x0558 - 0x0540)
class AMainMenuHUD_BP_C final : public AMainMenuHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ALevelSequenceActor*                    ArrowsAndNamesSequence;                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    CameraTransitionSequence;                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenuHUD_BP(int32 EntryPoint);
	void PlayTransitionSequence_CustomizationToStyleSelection(bool bInReverse);
	void PlayTransitionSequence_ArrowsToNames(bool bInReverse);
	void PlayTransitionSequence_MenuToCustomization(bool bInReverse);
	void BP_ShowFirstPerson();
	void BP_ShowVersusPictures();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenuHUD_BP_C">();
	}
	static class AMainMenuHUD_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainMenuHUD_BP_C>();
	}
};
static_assert(alignof(AMainMenuHUD_BP_C) == 0x000008, "Wrong alignment on AMainMenuHUD_BP_C");
static_assert(sizeof(AMainMenuHUD_BP_C) == 0x000558, "Wrong size on AMainMenuHUD_BP_C");
static_assert(offsetof(AMainMenuHUD_BP_C, UberGraphFrame) == 0x000540, "Member 'AMainMenuHUD_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMainMenuHUD_BP_C, ArrowsAndNamesSequence) == 0x000548, "Member 'AMainMenuHUD_BP_C::ArrowsAndNamesSequence' has a wrong offset!");
static_assert(offsetof(AMainMenuHUD_BP_C, CameraTransitionSequence) == 0x000550, "Member 'AMainMenuHUD_BP_C::CameraTransitionSequence' has a wrong offset!");

}

