#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchSettingSlider

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchSettingSlider.MatchSettingSlider_C
// 0x0018 (0x02B0 - 0x0298)
class UMatchSettingSlider_C final : public UNativeSliderSetting
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextValue;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchSettingSlider(int32 EntryPoint);
	void UpdateSliderAndText(float RawValue);
	void BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void OnSliderValueUpdated(float NormalizedValue, float RawValue);
	void Construct();
	float GetPercent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchSettingSlider_C">();
	}
	static class UMatchSettingSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchSettingSlider_C>();
	}
};
static_assert(alignof(UMatchSettingSlider_C) == 0x000008, "Wrong alignment on UMatchSettingSlider_C");
static_assert(sizeof(UMatchSettingSlider_C) == 0x0002B0, "Wrong size on UMatchSettingSlider_C");
static_assert(offsetof(UMatchSettingSlider_C, UberGraphFrame) == 0x000298, "Member 'UMatchSettingSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchSettingSlider_C, TextValue) == 0x0002A0, "Member 'UMatchSettingSlider_C::TextValue' has a wrong offset!");
static_assert(offsetof(UMatchSettingSlider_C, DynamicMaterial) == 0x0002A8, "Member 'UMatchSettingSlider_C::DynamicMaterial' has a wrong offset!");

}

