#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchLobbyPlayerSlotWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MatchLobbyPlayerSlotWidget.MatchLobbyPlayerSlotWidget_C.ExecuteUbergraph_MatchLobbyPlayerSlotWidget
// 0x00B8 (0x00B8 - 0x0000)
struct MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWPartyMember*                         K2Node_Event_PartyMember;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0090(0x0028)()
};
static_assert(alignof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget) == 0x000008, "Wrong alignment on MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget");
static_assert(sizeof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget) == 0x0000B8, "Wrong size on MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, EntryPoint) == 0x000000, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, K2Node_Event_PartyMember) == 0x000008, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::K2Node_Event_PartyMember' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_Mid_ReturnValue) == 0x000010, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_Len_ReturnValue) == 0x000038, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_SelectString_ReturnValue) == 0x000040, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget, K2Node_MakeStruct_SlateColor_1) == 0x000090, "Member 'MatchLobbyPlayerSlotWidget_C_ExecuteUbergraph_MatchLobbyPlayerSlotWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function MatchLobbyPlayerSlotWidget.MatchLobbyPlayerSlotWidget_C.BP_FillPlayer
// 0x0008 (0x0008 - 0x0000)
struct MatchLobbyPlayerSlotWidget_C_BP_FillPlayer final
{
public:
	class UTWPartyMember*                         PartyMember_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchLobbyPlayerSlotWidget_C_BP_FillPlayer) == 0x000008, "Wrong alignment on MatchLobbyPlayerSlotWidget_C_BP_FillPlayer");
static_assert(sizeof(MatchLobbyPlayerSlotWidget_C_BP_FillPlayer) == 0x000008, "Wrong size on MatchLobbyPlayerSlotWidget_C_BP_FillPlayer");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_BP_FillPlayer, PartyMember_0) == 0x000000, "Member 'MatchLobbyPlayerSlotWidget_C_BP_FillPlayer::PartyMember_0' has a wrong offset!");

// Function MatchLobbyPlayerSlotWidget.MatchLobbyPlayerSlotWidget_C.SetSlotNameLeftPadding
// 0x0028 (0x0028 - 0x0000)
struct MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding final
{
public:
	float                                         LeftPadding;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           K2Node_DynamicCast_AsSize_Box_Slot;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding) == 0x000008, "Wrong alignment on MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding");
static_assert(sizeof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding) == 0x000028, "Wrong size on MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding, LeftPadding) == 0x000000, "Member 'MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding::LeftPadding' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding, K2Node_MakeStruct_Margin) == 0x000004, "Member 'MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding, K2Node_DynamicCast_AsSize_Box_Slot) == 0x000018, "Member 'MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding::K2Node_DynamicCast_AsSize_Box_Slot' has a wrong offset!");
static_assert(offsetof(MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MatchLobbyPlayerSlotWidget_C_SetSlotNameLeftPadding::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

