#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchSettingSpinner

#include "Basic.hpp"

#include "AutoSettings_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchSettingSpinner.MatchSettingSpinner_C
// 0x0030 (0x0290 - 0x0260)
class UMatchSettingSpinner_C final : public USpinner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LeftArrow;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftButton;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightArrow;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightButton;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchSettingSpinner(int32 EntryPoint);
	void BndEvt__LeftButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__RightButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	struct FLinearColor GetLeftArrowColorAndOpacitya();
	struct FLinearColor GetRightArrowColorAndOpacitya();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchSettingSpinner_C">();
	}
	static class UMatchSettingSpinner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchSettingSpinner_C>();
	}
};
static_assert(alignof(UMatchSettingSpinner_C) == 0x000008, "Wrong alignment on UMatchSettingSpinner_C");
static_assert(sizeof(UMatchSettingSpinner_C) == 0x000290, "Wrong size on UMatchSettingSpinner_C");
static_assert(offsetof(UMatchSettingSpinner_C, UberGraphFrame) == 0x000260, "Member 'UMatchSettingSpinner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchSettingSpinner_C, LeftArrow) == 0x000268, "Member 'UMatchSettingSpinner_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(UMatchSettingSpinner_C, LeftButton) == 0x000270, "Member 'UMatchSettingSpinner_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UMatchSettingSpinner_C, RightArrow) == 0x000278, "Member 'UMatchSettingSpinner_C::RightArrow' has a wrong offset!");
static_assert(offsetof(UMatchSettingSpinner_C, RightButton) == 0x000280, "Member 'UMatchSettingSpinner_C::RightButton' has a wrong offset!");
static_assert(offsetof(UMatchSettingSpinner_C, TextBlock_0) == 0x000288, "Member 'UMatchSettingSpinner_C::TextBlock_0' has a wrong offset!");

}

