#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchSettingSpinner

#include "Basic.hpp"

#include "AutoSettings_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MatchSettingSpinner.MatchSettingSpinner_C.ExecuteUbergraph_MatchSettingSpinner
// 0x0004 (0x0004 - 0x0000)
struct MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner) == 0x000004, "Wrong alignment on MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner");
static_assert(sizeof(MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner) == 0x000004, "Wrong size on MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner");
static_assert(offsetof(MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner, EntryPoint) == 0x000000, "Member 'MatchSettingSpinner_C_ExecuteUbergraph_MatchSettingSpinner::EntryPoint' has a wrong offset!");

// Function MatchSettingSpinner.MatchSettingSpinner_C.GetLeftArrowColorAndOpacitya
// 0x0034 (0x0034 - 0x0000)
struct MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidPrevious_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya) == 0x000004, "Wrong alignment on MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya");
static_assert(sizeof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya) == 0x000034, "Wrong size on MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, ReturnValue) == 0x000000, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, Temp_bool_Variable) == 0x000010, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, Temp_float_Variable) == 0x000014, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, Temp_float_Variable_1) == 0x000018, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, CallFunc_HasValidPrevious_ReturnValue) == 0x00001C, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::CallFunc_HasValidPrevious_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, K2Node_Select_Default) == 0x000020, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya, K2Node_MakeStruct_LinearColor) == 0x000024, "Member 'MatchSettingSpinner_C_GetLeftArrowColorAndOpacitya::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function MatchSettingSpinner.MatchSettingSpinner_C.GetRightArrowColorAndOpacitya
// 0x0034 (0x0034 - 0x0000)
struct MatchSettingSpinner_C_GetRightArrowColorAndOpacitya final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidNext_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya) == 0x000004, "Wrong alignment on MatchSettingSpinner_C_GetRightArrowColorAndOpacitya");
static_assert(sizeof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya) == 0x000034, "Wrong size on MatchSettingSpinner_C_GetRightArrowColorAndOpacitya");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, ReturnValue) == 0x000000, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, Temp_bool_Variable) == 0x000010, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, Temp_float_Variable) == 0x000014, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, Temp_float_Variable_1) == 0x000018, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, CallFunc_HasValidNext_ReturnValue) == 0x00001C, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::CallFunc_HasValidNext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, K2Node_Select_Default) == 0x000020, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetRightArrowColorAndOpacitya, K2Node_MakeStruct_LinearColor) == 0x000024, "Member 'MatchSettingSpinner_C_GetRightArrowColorAndOpacitya::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function MatchSettingSpinner.MatchSettingSpinner_C.GetText_0
// 0x0058 (0x0058 - 0x0000)
struct MatchSettingSpinner_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FSettingOption                         CallFunc_GetCurrentOption_ReturnValue;             // 0x0018(0x0028)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0040(0x0018)()
};
static_assert(alignof(MatchSettingSpinner_C_GetText_0) == 0x000008, "Wrong alignment on MatchSettingSpinner_C_GetText_0");
static_assert(sizeof(MatchSettingSpinner_C_GetText_0) == 0x000058, "Wrong size on MatchSettingSpinner_C_GetText_0");
static_assert(offsetof(MatchSettingSpinner_C_GetText_0, ReturnValue) == 0x000000, "Member 'MatchSettingSpinner_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetText_0, CallFunc_GetCurrentOption_ReturnValue) == 0x000018, "Member 'MatchSettingSpinner_C_GetText_0::CallFunc_GetCurrentOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSpinner_C_GetText_0, CallFunc_TextToUpper_ReturnValue) == 0x000040, "Member 'MatchSettingSpinner_C_GetText_0::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

