#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchLobbyPlayerSlotWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchLobbyPlayerSlotWidget.MatchLobbyPlayerSlotWidget_C
// 0x0048 (0x02D8 - 0x0290)
class UMatchLobbyPlayerSlotWidget_C final : public UMatchLobbyPlayerSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Container;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crown;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SwitchLeft;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SwitchRight;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_AvatarContainer;                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerName;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTWPartyMember*                         PartyMember;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchLobbyPlayerSlotWidget(int32 EntryPoint);
	void BP_ClearPlayerInfo();
	void BP_FillPlayer(class UTWPartyMember* PartyMember_0);
	void Construct();
	void SetSlotNameLeftPadding(float LeftPadding);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchLobbyPlayerSlotWidget_C">();
	}
	static class UMatchLobbyPlayerSlotWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchLobbyPlayerSlotWidget_C>();
	}
};
static_assert(alignof(UMatchLobbyPlayerSlotWidget_C) == 0x000008, "Wrong alignment on UMatchLobbyPlayerSlotWidget_C");
static_assert(sizeof(UMatchLobbyPlayerSlotWidget_C) == 0x0002D8, "Wrong size on UMatchLobbyPlayerSlotWidget_C");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, UberGraphFrame) == 0x000290, "Member 'UMatchLobbyPlayerSlotWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Image_Background) == 0x000298, "Member 'UMatchLobbyPlayerSlotWidget_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Image_Container) == 0x0002A0, "Member 'UMatchLobbyPlayerSlotWidget_C::Image_Container' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Image_Crown) == 0x0002A8, "Member 'UMatchLobbyPlayerSlotWidget_C::Image_Crown' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Image_SwitchLeft) == 0x0002B0, "Member 'UMatchLobbyPlayerSlotWidget_C::Image_SwitchLeft' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Image_SwitchRight) == 0x0002B8, "Member 'UMatchLobbyPlayerSlotWidget_C::Image_SwitchRight' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, RetainerBox_AvatarContainer) == 0x0002C0, "Member 'UMatchLobbyPlayerSlotWidget_C::RetainerBox_AvatarContainer' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, Text_PlayerName) == 0x0002C8, "Member 'UMatchLobbyPlayerSlotWidget_C::Text_PlayerName' has a wrong offset!");
static_assert(offsetof(UMatchLobbyPlayerSlotWidget_C, PartyMember) == 0x0002D0, "Member 'UMatchLobbyPlayerSlotWidget_C::PartyMember' has a wrong offset!");

}

