#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchSettingSlider

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MatchSettingSlider.MatchSettingSlider_C.ExecuteUbergraph_MatchSettingSlider
// 0x04B8 (0x04B8 - 0x0000)
struct MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0088)()
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x0098(0x0088)()
	struct FSliderStyle                           K2Node_MakeStruct_SliderStyle;                     // 0x0120(0x0340)()
	float                                         CallFunc_GetFloatCVar_ReturnValue;                 // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NormalizedValue;                      // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RawValue_1;                           // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0470(0x0018)()
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RawValue;                             // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0498(0x0018)()
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider) == 0x000008, "Wrong alignment on MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider");
static_assert(sizeof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider) == 0x0004B8, "Wrong size on MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, EntryPoint) == 0x000000, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x000098, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_MakeStruct_SliderStyle) == 0x000120, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_MakeStruct_SliderStyle' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_GetFloatCVar_ReturnValue) == 0x000460, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_GetFloatCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_Event_NormalizedValue) == 0x000464, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_Event_NormalizedValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_Event_RawValue_1) == 0x000468, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_Event_RawValue_1' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_Round_ReturnValue) == 0x00046C, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_Conv_IntToText_ReturnValue) == 0x000470, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_ComponentBoundEvent_Value) == 0x000488, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, K2Node_Event_RawValue) == 0x00048C, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::K2Node_Event_RawValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000490, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_Round_ReturnValue_1) == 0x000494, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000498, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider, CallFunc_MapRangeUnclamped_ReturnValue_1) == 0x0004B0, "Member 'MatchSettingSlider_C_ExecuteUbergraph_MatchSettingSlider::CallFunc_MapRangeUnclamped_ReturnValue_1' has a wrong offset!");

// Function MatchSettingSlider.MatchSettingSlider_C.UpdateSliderAndText
// 0x0004 (0x0004 - 0x0000)
struct MatchSettingSlider_C_UpdateSliderAndText final
{
public:
	float                                         RawValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSlider_C_UpdateSliderAndText) == 0x000004, "Wrong alignment on MatchSettingSlider_C_UpdateSliderAndText");
static_assert(sizeof(MatchSettingSlider_C_UpdateSliderAndText) == 0x000004, "Wrong size on MatchSettingSlider_C_UpdateSliderAndText");
static_assert(offsetof(MatchSettingSlider_C_UpdateSliderAndText, RawValue) == 0x000000, "Member 'MatchSettingSlider_C_UpdateSliderAndText::RawValue' has a wrong offset!");

// Function MatchSettingSlider.MatchSettingSlider_C.BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'MatchSettingSlider_C_BndEvt__Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function MatchSettingSlider.MatchSettingSlider_C.OnSliderValueUpdated
// 0x0008 (0x0008 - 0x0000)
struct MatchSettingSlider_C_OnSliderValueUpdated final
{
public:
	float                                         NormalizedValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RawValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSlider_C_OnSliderValueUpdated) == 0x000004, "Wrong alignment on MatchSettingSlider_C_OnSliderValueUpdated");
static_assert(sizeof(MatchSettingSlider_C_OnSliderValueUpdated) == 0x000008, "Wrong size on MatchSettingSlider_C_OnSliderValueUpdated");
static_assert(offsetof(MatchSettingSlider_C_OnSliderValueUpdated, NormalizedValue) == 0x000000, "Member 'MatchSettingSlider_C_OnSliderValueUpdated::NormalizedValue' has a wrong offset!");
static_assert(offsetof(MatchSettingSlider_C_OnSliderValueUpdated, RawValue) == 0x000004, "Member 'MatchSettingSlider_C_OnSliderValueUpdated::RawValue' has a wrong offset!");

// Function MatchSettingSlider.MatchSettingSlider_C.GetPercent_0
// 0x0004 (0x0004 - 0x0000)
struct MatchSettingSlider_C_GetPercent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchSettingSlider_C_GetPercent_0) == 0x000004, "Wrong alignment on MatchSettingSlider_C_GetPercent_0");
static_assert(sizeof(MatchSettingSlider_C_GetPercent_0) == 0x000004, "Wrong size on MatchSettingSlider_C_GetPercent_0");
static_assert(offsetof(MatchSettingSlider_C_GetPercent_0, ReturnValue) == 0x000000, "Member 'MatchSettingSlider_C_GetPercent_0::ReturnValue' has a wrong offset!");

}

