#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextClonesHealthBarItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function NextClonesHealthBarItem.NextClonesHealthBarItem_C.ExecuteUbergraph_NextClonesHealthBarItem
// 0x0018 (0x0018 - 0x0000)
struct NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialCloneInfo_PlayerInfo_C*          K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem) == 0x000008, "Wrong alignment on NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem");
static_assert(sizeof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem) == 0x000018, "Wrong size on NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem");
static_assert(offsetof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem, EntryPoint) == 0x000000, "Member 'NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem, K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info) == 0x000008, "Member 'NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem::K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info' has a wrong offset!");
static_assert(offsetof(NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'NextClonesHealthBarItem_C_ExecuteUbergraph_NextClonesHealthBarItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function NextClonesHealthBarItem.NextClonesHealthBarItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct NextClonesHealthBarItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextClonesHealthBarItem_C_PreConstruct) == 0x000001, "Wrong alignment on NextClonesHealthBarItem_C_PreConstruct");
static_assert(sizeof(NextClonesHealthBarItem_C_PreConstruct) == 0x000001, "Wrong size on NextClonesHealthBarItem_C_PreConstruct");
static_assert(offsetof(NextClonesHealthBarItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'NextClonesHealthBarItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

