#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NGDOnlineService

#include "Basic.hpp"


namespace SDK::Params
{

// Function NGDOnlineService.NGDOnlineBeaconClient.Server_Announce
// 0x0030 (0x0030 - 0x0000)
struct NGDOnlineBeaconClient_Server_Announce final
{
public:
	class FString                                 InSessionId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InHexNetId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPersonaName;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDOnlineBeaconClient_Server_Announce) == 0x000008, "Wrong alignment on NGDOnlineBeaconClient_Server_Announce");
static_assert(sizeof(NGDOnlineBeaconClient_Server_Announce) == 0x000030, "Wrong size on NGDOnlineBeaconClient_Server_Announce");
static_assert(offsetof(NGDOnlineBeaconClient_Server_Announce, InSessionId) == 0x000000, "Member 'NGDOnlineBeaconClient_Server_Announce::InSessionId' has a wrong offset!");
static_assert(offsetof(NGDOnlineBeaconClient_Server_Announce, InHexNetId) == 0x000010, "Member 'NGDOnlineBeaconClient_Server_Announce::InHexNetId' has a wrong offset!");
static_assert(offsetof(NGDOnlineBeaconClient_Server_Announce, InPersonaName) == 0x000020, "Member 'NGDOnlineBeaconClient_Server_Announce::InPersonaName' has a wrong offset!");

}

