#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParadoxicalExplosion_BP

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ParadoxicalExplosion_BP.ParadoxicalExplosion_BP_C.ExecuteUbergraph_ParadoxicalExplosion_BP
// 0x0478 (0x0478 - 0x0000)
struct ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayColorScheme                   CallFunc_GetColorScheme_TeamColorsOutlines;        // 0x0008(0x0428)()
	class ATimeWatchCharacter*                    K2Node_Event_ExplosionOwner;                       // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorForClone_ReturnValue;             // 0x0440(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorForClone_ReturnValue_1;           // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetExplosionFactor_ReturnValue;           // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP) == 0x000008, "Wrong alignment on ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP");
static_assert(sizeof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP) == 0x000478, "Wrong size on ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, EntryPoint) == 0x000000, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_GetColorScheme_TeamColorsOutlines) == 0x000008, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_GetColorScheme_TeamColorsOutlines' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, K2Node_Event_ExplosionOwner) == 0x000430, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::K2Node_Event_ExplosionOwner' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, K2Node_Event_DeltaSeconds) == 0x000438, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_IsValid_ReturnValue) == 0x00043C, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_GetColorForClone_ReturnValue) == 0x000440, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_GetColorForClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_GetColorForClone_ReturnValue_1) == 0x000450, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_GetColorForClone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_GetExplosionFactor_ReturnValue) == 0x000460, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_GetExplosionFactor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_IsValid_ReturnValue_1) == 0x000464, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_GetMaterial_ReturnValue) == 0x000468, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000470, "Member 'ParadoxicalExplosion_BP_C_ExecuteUbergraph_ParadoxicalExplosion_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function ParadoxicalExplosion_BP.ParadoxicalExplosion_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ParadoxicalExplosion_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParadoxicalExplosion_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on ParadoxicalExplosion_BP_C_ReceiveTick");
static_assert(sizeof(ParadoxicalExplosion_BP_C_ReceiveTick) == 0x000004, "Wrong size on ParadoxicalExplosion_BP_C_ReceiveTick");
static_assert(offsetof(ParadoxicalExplosion_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ParadoxicalExplosion_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ParadoxicalExplosion_BP.ParadoxicalExplosion_BP_C.Cosmetic_Setup
// 0x0008 (0x0008 - 0x0000)
struct ParadoxicalExplosion_BP_C_Cosmetic_Setup final
{
public:
	class ATimeWatchCharacter*                    ExplosionOwner;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ParadoxicalExplosion_BP_C_Cosmetic_Setup) == 0x000008, "Wrong alignment on ParadoxicalExplosion_BP_C_Cosmetic_Setup");
static_assert(sizeof(ParadoxicalExplosion_BP_C_Cosmetic_Setup) == 0x000008, "Wrong size on ParadoxicalExplosion_BP_C_Cosmetic_Setup");
static_assert(offsetof(ParadoxicalExplosion_BP_C_Cosmetic_Setup, ExplosionOwner) == 0x000000, "Member 'ParadoxicalExplosion_BP_C_Cosmetic_Setup::ExplosionOwner' has a wrong offset!");

}

