#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PastClonesHealthBarItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function PastClonesHealthBarItem.PastClonesHealthBarItem_C.ExecuteUbergraph_PastClonesHealthBarItem
// 0x0018 (0x0018 - 0x0000)
struct PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadialCloneInfo_PlayerInfo_C*          K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem) == 0x000008, "Wrong alignment on PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem");
static_assert(sizeof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem) == 0x000018, "Wrong size on PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem");
static_assert(offsetof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem, EntryPoint) == 0x000000, "Member 'PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem, K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info) == 0x000008, "Member 'PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem::K2Node_DynamicCast_AsRadial_Clone_Info_Player_Info' has a wrong offset!");
static_assert(offsetof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem, K2Node_Event_IsDesignTime) == 0x000011, "Member 'PastClonesHealthBarItem_C_ExecuteUbergraph_PastClonesHealthBarItem::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PastClonesHealthBarItem.PastClonesHealthBarItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PastClonesHealthBarItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PastClonesHealthBarItem_C_PreConstruct) == 0x000001, "Wrong alignment on PastClonesHealthBarItem_C_PreConstruct");
static_assert(sizeof(PastClonesHealthBarItem_C_PreConstruct) == 0x000001, "Wrong size on PastClonesHealthBarItem_C_PreConstruct");
static_assert(offsetof(PastClonesHealthBarItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PastClonesHealthBarItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

