#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PingCompass

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PingCompass.PingCompass_C.ExecuteUbergraph_PingCompass
// 0x0058 (0x0058 - 0x0000)
struct PingCompass_C_ExecuteUbergraph_PingCompass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
};
static_assert(alignof(PingCompass_C_ExecuteUbergraph_PingCompass) == 0x000008, "Wrong alignment on PingCompass_C_ExecuteUbergraph_PingCompass");
static_assert(sizeof(PingCompass_C_ExecuteUbergraph_PingCompass) == 0x000058, "Wrong size on PingCompass_C_ExecuteUbergraph_PingCompass");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, EntryPoint) == 0x000000, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::EntryPoint' has a wrong offset!");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, CallFunc_GetCameraLocation_ReturnValue) == 0x000010, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, CallFunc_PostSound_ReturnValue) == 0x000028, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(PingCompass_C_ExecuteUbergraph_PingCompass, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'PingCompass_C_ExecuteUbergraph_PingCompass::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

