#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReplayFluxPlayerControllerBP

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.ExecuteUbergraph_ReplayFluxPlayerControllerBP
// 0x00D0 (0x00D0 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAllowReplayActions_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0020(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x0068(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x00B0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_ShouldAllowReplayActions_ReturnValue_1;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAllowReplayActions_ReturnValue_2;   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAllowReplayActions_ReturnValue_3;   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldAllowReplayActions_ReturnValue_4;   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP) == 0x0000D0, "Wrong size on ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, EntryPoint) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_ShouldAllowReplayActions_ReturnValue) == 0x000004, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_ShouldAllowReplayActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Max_ReturnValue) == 0x000010, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, K2Node_InputActionEvent_Key) == 0x000020, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Min_ReturnValue) == 0x000038, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Array_Get_Item) == 0x00003C, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Conv_FloatToString_ReturnValue) == 0x000040, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, K2Node_InputActionEvent_Key_1) == 0x000068, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, K2Node_InputActionEvent_Key_2) == 0x000080, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, K2Node_InputActionEvent_Key_3) == 0x000098, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, K2Node_InputActionEvent_Key_4) == 0x0000B0, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_ShouldAllowReplayActions_ReturnValue_1) == 0x0000C8, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_ShouldAllowReplayActions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_ShouldAllowReplayActions_ReturnValue_2) == 0x0000C9, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_ShouldAllowReplayActions_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_ShouldAllowReplayActions_ReturnValue_3) == 0x0000CA, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_ShouldAllowReplayActions_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP, CallFunc_ShouldAllowReplayActions_ReturnValue_4) == 0x0000CB, "Member 'ReplayFluxPlayerControllerBP_C_ExecuteUbergraph_ReplayFluxPlayerControllerBP::CallFunc_ShouldAllowReplayActions_ReturnValue_4' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_ToggleHud_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.InpActEvt_Replay_Pause_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Pause_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.InpActEvt_Replay_Speed+_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_SpeedNormal_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.InpActEvt_Replay_Speed-_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_InpActEvt_Replay_Speed__K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.SetControlMenuVisibility
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDWidgetContainer*                    CallFunc_GetMenuWidgetContainer_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility, InVisibility) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility::InVisibility' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility, CallFunc_GetMenuWidgetContainer_ReturnValue) == 0x000008, "Member 'ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility::CallFunc_GetMenuWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ReplayFluxPlayerControllerBP_C_SetControlMenuVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.GetMenuWidgetContainer
// 0x0040 (0x0040 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer final
{
public:
	class UNGDWidgetContainer*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReplayHUD_BP_C*                        K2Node_DynamicCast_AsReplay_HUD_BP;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDManagedLayer*                       CallFunc_GetLayer_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDHUDState*                           CallFunc_GetState_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWC_ReplayControls_C*                   CallFunc_GetWidgetContainer_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer) == 0x000040, "Wrong size on ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, ReturnValue) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, K2Node_DynamicCast_AsReplay_HUD_BP) == 0x000010, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::K2Node_DynamicCast_AsReplay_HUD_BP' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, CallFunc_GetLayer_ReturnValue) == 0x000020, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::CallFunc_GetLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, CallFunc_GetState_ReturnValue) == 0x000028, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, CallFunc_GetWidgetContainer_ReturnValue) == 0x000030, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::CallFunc_GetWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ReplayFluxPlayerControllerBP_C_GetMenuWidgetContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ReplayFluxPlayerControllerBP.ReplayFluxPlayerControllerBP_C.ShouldAllowReplayActions
// 0x0018 (0x0018 - 0x0000)
struct ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeWatchGameInstance*                 CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingReplay_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions) == 0x000008, "Wrong alignment on ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions");
static_assert(sizeof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions) == 0x000018, "Wrong size on ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions, ReturnValue) == 0x000000, "Member 'ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions, CallFunc_IsPlayingReplay_ReturnValue) == 0x000010, "Member 'ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions::CallFunc_IsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'ReplayFluxPlayerControllerBP_C_ShouldAllowReplayActions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

