#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RevivedCloneCompass

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RevivedCloneCompass.RevivedCloneCompass_C
// 0x0048 (0x0318 - 0x02D0)
class URevivedCloneCompass_C final : public UTWActorCompass
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnStartBeat;                                       // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BlinkAnimation;                                    // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ArrowAnimated;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 stroke;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 RevivedTWChar;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldPlayBeat;                                   // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RevivedCloneCompass(int32 EntryPoint);
	void OnPreUpdate();
	void OnReset(const class AActor* OwnerActor);

	bool IsCompassVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RevivedCloneCompass_C">();
	}
	static class URevivedCloneCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevivedCloneCompass_C>();
	}
};
static_assert(alignof(URevivedCloneCompass_C) == 0x000008, "Wrong alignment on URevivedCloneCompass_C");
static_assert(sizeof(URevivedCloneCompass_C) == 0x000318, "Wrong size on URevivedCloneCompass_C");
static_assert(offsetof(URevivedCloneCompass_C, UberGraphFrame) == 0x0002D0, "Member 'URevivedCloneCompass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, OnStartBeat) == 0x0002D8, "Member 'URevivedCloneCompass_C::OnStartBeat' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, BlinkAnimation) == 0x0002E0, "Member 'URevivedCloneCompass_C::BlinkAnimation' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, Background) == 0x0002E8, "Member 'URevivedCloneCompass_C::Background' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, Icon) == 0x0002F0, "Member 'URevivedCloneCompass_C::Icon' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, Image_ArrowAnimated) == 0x0002F8, "Member 'URevivedCloneCompass_C::Image_ArrowAnimated' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, stroke) == 0x000300, "Member 'URevivedCloneCompass_C::stroke' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, RevivedTWChar) == 0x000308, "Member 'URevivedCloneCompass_C::RevivedTWChar' has a wrong offset!");
static_assert(offsetof(URevivedCloneCompass_C, bShouldPlayBeat) == 0x000310, "Member 'URevivedCloneCompass_C::bShouldPlayBeat' has a wrong offset!");

}

