#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardTrackPreviewActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RewardTrackPreviewActor.RewardTrackPreviewActor_C.ExecuteUbergraph_RewardTrackPreviewActor
// 0x0030 (0x0030 - 0x0000)
struct RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisKeyEvent_AxisValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor) == 0x000008, "Wrong alignment on RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor");
static_assert(sizeof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor) == 0x000030, "Wrong size on RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, EntryPoint) == 0x000000, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000028, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor, K2Node_InputAxisKeyEvent_AxisValue) == 0x00002C, "Member 'RewardTrackPreviewActor_C_ExecuteUbergraph_RewardTrackPreviewActor::K2Node_InputAxisKeyEvent_AxisValue' has a wrong offset!");

// Function RewardTrackPreviewActor.RewardTrackPreviewActor_C.InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0
// 0x0004 (0x0004 - 0x0000)
struct RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0) == 0x000004, "Wrong alignment on RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0");
static_assert(sizeof(RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0) == 0x000004, "Wrong size on RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0");
static_assert(offsetof(RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0, AxisValue) == 0x000000, "Member 'RewardTrackPreviewActor_C_InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0::AxisValue' has a wrong offset!");

// Function RewardTrackPreviewActor.RewardTrackPreviewActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RewardTrackPreviewActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardTrackPreviewActor_C_ReceiveTick) == 0x000004, "Wrong alignment on RewardTrackPreviewActor_C_ReceiveTick");
static_assert(sizeof(RewardTrackPreviewActor_C_ReceiveTick) == 0x000004, "Wrong size on RewardTrackPreviewActor_C_ReceiveTick");
static_assert(offsetof(RewardTrackPreviewActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RewardTrackPreviewActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RewardTrackPreviewActor.RewardTrackPreviewActor_C.PlayUnlockVFX
// 0x0088 (0x0088 - 0x0000)
struct RewardTrackPreviewActor_C_PlayUnlockVFX final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Hel_Customization_C*                K2Node_DynamicCast_AsBP_Hel_Customization;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Axel_Customization_C*               K2Node_DynamicCast_AsBP_Axel_Customization;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Violet_Customization_C*             K2Node_DynamicCast_AsBP_Violet_Customization;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Toure_Customization_C*              K2Node_DynamicCast_AsBP_Toure_Customization;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Justin_Customization_C*             K2Node_DynamicCast_AsBP_Justin_Customization;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Levka_Customization_C*              K2Node_DynamicCast_AsBP_Levka_Customization;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Jackie_Customization_C*             K2Node_DynamicCast_AsBP_Jackie_Customization;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Bjarne_Customization_C*             K2Node_DynamicCast_AsBP_Bjarne_Customization;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardTrackPreviewActor_C_PlayUnlockVFX) == 0x000008, "Wrong alignment on RewardTrackPreviewActor_C_PlayUnlockVFX");
static_assert(sizeof(RewardTrackPreviewActor_C_PlayUnlockVFX) == 0x000088, "Wrong size on RewardTrackPreviewActor_C_PlayUnlockVFX");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Hel_Customization) == 0x000008, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Hel_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Axel_Customization) == 0x000018, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Axel_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Violet_Customization) == 0x000028, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Violet_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Toure_Customization) == 0x000038, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Toure_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_3) == 0x000040, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Justin_Customization) == 0x000048, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Justin_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_4) == 0x000050, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Levka_Customization) == 0x000058, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Levka_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_5) == 0x000060, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Jackie_Customization) == 0x000068, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Jackie_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_6) == 0x000070, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_AsBP_Bjarne_Customization) == 0x000078, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_AsBP_Bjarne_Customization' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_PlayUnlockVFX, K2Node_DynamicCast_bSuccess_7) == 0x000080, "Member 'RewardTrackPreviewActor_C_PlayUnlockVFX::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

// Function RewardTrackPreviewActor.RewardTrackPreviewActor_C.SetUpUnlockVFX
// 0x0114 (0x0114 - 0x0000)
struct RewardTrackPreviewActor_C_SetUpUnlockVFX final
{
public:
	bool                                          bIsCharStyle;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x008C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RewardTrackPreviewActor_C_SetUpUnlockVFX) == 0x000004, "Wrong alignment on RewardTrackPreviewActor_C_SetUpUnlockVFX");
static_assert(sizeof(RewardTrackPreviewActor_C_SetUpUnlockVFX) == 0x000114, "Wrong size on RewardTrackPreviewActor_C_SetUpUnlockVFX");
static_assert(offsetof(RewardTrackPreviewActor_C_SetUpUnlockVFX, bIsCharStyle) == 0x000000, "Member 'RewardTrackPreviewActor_C_SetUpUnlockVFX::bIsCharStyle' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_SetUpUnlockVFX, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000004, "Member 'RewardTrackPreviewActor_C_SetUpUnlockVFX::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RewardTrackPreviewActor_C_SetUpUnlockVFX, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00008C, "Member 'RewardTrackPreviewActor_C_SetUpUnlockVFX::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

}

