#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardWidget.RewardWidget_C
// 0x0070 (0x03C8 - 0x0358)
class URewardWidget_C final : public UTWRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Stroke;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_back_light;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientbottom;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientcenter;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientupper;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_small_gradient_bottom;                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_small_gradient_top;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_1;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_2;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_3;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_4;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RewardWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardWidget_C">();
	}
	static class URewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardWidget_C>();
	}
};
static_assert(alignof(URewardWidget_C) == 0x000008, "Wrong alignment on URewardWidget_C");
static_assert(sizeof(URewardWidget_C) == 0x0003C8, "Wrong size on URewardWidget_C");
static_assert(offsetof(URewardWidget_C, UberGraphFrame) == 0x000358, "Member 'URewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Image_Stroke) == 0x000360, "Member 'URewardWidget_C::Image_Stroke' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_back_light) == 0x000368, "Member 'URewardWidget_C::leg_back_light' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_gradientbottom) == 0x000370, "Member 'URewardWidget_C::leg_gradientbottom' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_gradientcenter) == 0x000378, "Member 'URewardWidget_C::leg_gradientcenter' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_gradientupper) == 0x000380, "Member 'URewardWidget_C::leg_gradientupper' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_small_gradient_bottom) == 0x000388, "Member 'URewardWidget_C::leg_small_gradient_bottom' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, leg_small_gradient_top) == 0x000390, "Member 'URewardWidget_C::leg_small_gradient_top' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, Overlay_0) == 0x000398, "Member 'URewardWidget_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, rare_gradient1) == 0x0003A0, "Member 'URewardWidget_C::rare_gradient1' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, rare_gradient1_1) == 0x0003A8, "Member 'URewardWidget_C::rare_gradient1_1' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, rare_gradient1_2) == 0x0003B0, "Member 'URewardWidget_C::rare_gradient1_2' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, rare_gradient1_3) == 0x0003B8, "Member 'URewardWidget_C::rare_gradient1_3' has a wrong offset!");
static_assert(offsetof(URewardWidget_C, rare_gradient1_4) == 0x0003C0, "Member 'URewardWidget_C::rare_gradient1_4' has a wrong offset!");

}

