#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardTrackWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RewardTrackWidget.RewardTrackWidget_C
// 0x0070 (0x03C8 - 0x0358)
class URewardTrackWidget_C final : public UTWRewardWidget
{
public:
	class UImage*                                 Image_ProgressBarStroke;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Stroke;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_back_light;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientbottom;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientcenter;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_gradientupper;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_small_gradient_bottom;                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 leg_small_gradient_top;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_1;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_2;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_3;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 rare_gradient1_4;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardTrackWidget_C">();
	}
	static class URewardTrackWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardTrackWidget_C>();
	}
};
static_assert(alignof(URewardTrackWidget_C) == 0x000008, "Wrong alignment on URewardTrackWidget_C");
static_assert(sizeof(URewardTrackWidget_C) == 0x0003C8, "Wrong size on URewardTrackWidget_C");
static_assert(offsetof(URewardTrackWidget_C, Image_ProgressBarStroke) == 0x000358, "Member 'URewardTrackWidget_C::Image_ProgressBarStroke' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, Image_Stroke) == 0x000360, "Member 'URewardTrackWidget_C::Image_Stroke' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_back_light) == 0x000368, "Member 'URewardTrackWidget_C::leg_back_light' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_gradientbottom) == 0x000370, "Member 'URewardTrackWidget_C::leg_gradientbottom' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_gradientcenter) == 0x000378, "Member 'URewardTrackWidget_C::leg_gradientcenter' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_gradientupper) == 0x000380, "Member 'URewardTrackWidget_C::leg_gradientupper' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_small_gradient_bottom) == 0x000388, "Member 'URewardTrackWidget_C::leg_small_gradient_bottom' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, leg_small_gradient_top) == 0x000390, "Member 'URewardTrackWidget_C::leg_small_gradient_top' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, Overlay_0) == 0x000398, "Member 'URewardTrackWidget_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, rare_gradient1) == 0x0003A0, "Member 'URewardTrackWidget_C::rare_gradient1' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, rare_gradient1_1) == 0x0003A8, "Member 'URewardTrackWidget_C::rare_gradient1_1' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, rare_gradient1_2) == 0x0003B0, "Member 'URewardTrackWidget_C::rare_gradient1_2' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, rare_gradient1_3) == 0x0003B8, "Member 'URewardTrackWidget_C::rare_gradient1_3' has a wrong offset!");
static_assert(offsetof(URewardTrackWidget_C, rare_gradient1_4) == 0x0003C0, "Member 'URewardTrackWidget_C::rare_gradient1_4' has a wrong offset!");

}

