#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RewardWidget.RewardWidget_C.ExecuteUbergraph_RewardWidget
// 0x0040 (0x0040 - 0x0000)
struct RewardWidget_C_ExecuteUbergraph_RewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardWidget_C_ExecuteUbergraph_RewardWidget) == 0x000004, "Wrong alignment on RewardWidget_C_ExecuteUbergraph_RewardWidget");
static_assert(sizeof(RewardWidget_C_ExecuteUbergraph_RewardWidget) == 0x000040, "Wrong size on RewardWidget_C_ExecuteUbergraph_RewardWidget");
static_assert(offsetof(RewardWidget_C_ExecuteUbergraph_RewardWidget, EntryPoint) == 0x000000, "Member 'RewardWidget_C_ExecuteUbergraph_RewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardWidget_C_ExecuteUbergraph_RewardWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'RewardWidget_C_ExecuteUbergraph_RewardWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(RewardWidget_C_ExecuteUbergraph_RewardWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'RewardWidget_C_ExecuteUbergraph_RewardWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function RewardWidget.RewardWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct RewardWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardWidget_C_Tick) == 0x000004, "Wrong alignment on RewardWidget_C_Tick");
static_assert(sizeof(RewardWidget_C_Tick) == 0x00003C, "Wrong size on RewardWidget_C_Tick");
static_assert(offsetof(RewardWidget_C_Tick, MyGeometry) == 0x000000, "Member 'RewardWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(RewardWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'RewardWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

