#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TemporalWeapon_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TemporalWeapon_BP.TemporalWeapon_BP_C.ExecuteUbergraph_TemporalWeapon_BP
// 0x0030 (0x0030 - 0x0000)
struct TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetMeshTP_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewAmmoCount;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClipSize_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP) == 0x000008, "Wrong alignment on TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP");
static_assert(sizeof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP) == 0x000030, "Wrong size on TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, EntryPoint) == 0x000000, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_GetMeshTP_ReturnValue) == 0x000008, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_GetMeshTP_ReturnValue' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, K2Node_Event_NewAmmoCount) == 0x000010, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::K2Node_Event_NewAmmoCount' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_GetClipSize_ReturnValue) == 0x000014, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_GetClipSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'TemporalWeapon_BP_C_ExecuteUbergraph_TemporalWeapon_BP::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function TemporalWeapon_BP.TemporalWeapon_BP_C.OnAmmoChanged
// 0x0004 (0x0004 - 0x0000)
struct TemporalWeapon_BP_C_OnAmmoChanged final
{
public:
	int32                                         NewAmmoCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TemporalWeapon_BP_C_OnAmmoChanged) == 0x000004, "Wrong alignment on TemporalWeapon_BP_C_OnAmmoChanged");
static_assert(sizeof(TemporalWeapon_BP_C_OnAmmoChanged) == 0x000004, "Wrong size on TemporalWeapon_BP_C_OnAmmoChanged");
static_assert(offsetof(TemporalWeapon_BP_C_OnAmmoChanged, NewAmmoCount) == 0x000000, "Member 'TemporalWeapon_BP_C_OnAmmoChanged::NewAmmoCount' has a wrong offset!");

}

