#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TemporalTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TemporalTrail.TemporalTrail_C
// 0x0020 (0x0238 - 0x0218)
class ATemporalTrail_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFluxTimelineCharacter*                 Timeline;                                          // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TemporalTrail(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TemporalTrail_C">();
	}
	static class ATemporalTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATemporalTrail_C>();
	}
};
static_assert(alignof(ATemporalTrail_C) == 0x000008, "Wrong alignment on ATemporalTrail_C");
static_assert(sizeof(ATemporalTrail_C) == 0x000238, "Wrong size on ATemporalTrail_C");
static_assert(offsetof(ATemporalTrail_C, UberGraphFrame) == 0x000218, "Member 'ATemporalTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATemporalTrail_C, ParticleSystem) == 0x000220, "Member 'ATemporalTrail_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ATemporalTrail_C, Sphere) == 0x000228, "Member 'ATemporalTrail_C::Sphere' has a wrong offset!");
static_assert(offsetof(ATemporalTrail_C, Timeline) == 0x000230, "Member 'ATemporalTrail_C::Timeline' has a wrong offset!");

}

