#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThirdPerson_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ThirdPerson_AnimBP.ThirdPerson_AnimBP_C
// 0x8220 (0x8690 - 0x0470)
class UThirdPerson_AnimBP_C : public UFluxAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_685D1CC643800DC0071D28AD368BF404; // 0x0478(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B0532C7E4EA16E8115A9249E9C8565B5; // 0x04A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37FE7FB5445749D0118AE0A146B568F7; // 0x04D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8B0CB6634328EB308626889DB0562469; // 0x04F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147F67EA48C56D436EE56A8922B47F9E; // 0x0520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CDD90282412D82EFFFE043B81998B61F; // 0x0548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6EC0419D4E7881BB2D0033897CF9E943; // 0x0570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_770BB1144C10E8AEB9772682F3950905; // 0x0598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69A60ECD4B1A503D763091B5B6D35F10; // 0x05C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95F7F97C409EFA284F98EFB99100CE15; // 0x05E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C0410CA3460C6516CA863B8C33738305; // 0x0610(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88B0E589458EE1AD5DD3A9BBA5FA634C; // 0x0640(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BB1B79C244B4C7752B526CA0D9E3A208; // 0x0668(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73096B4B46546231C3953CA9FDFFA349; // 0x0690(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45FD757A49731EE1F3AA2DA896B3611D; // 0x06B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C6F2C4E64F657D87DEDF148E586C6393; // 0x06E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75DDEC0341D158DB798F418960E3953A; // 0x0708(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_553653D94706CB47D30D00B7907037BF; // 0x0730(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_C9C813A14DC0D6DD86298AAA019FBDF4; // 0x08B8(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_7299A9A04CDD6FA0A41D6C85EE456F43; // 0x0A40(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_D32B5E354571BA8C6E2154ABBBB3047D; // 0x0BC8(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_0B341B4547A2EAB051D685B8BB2C1C38; // 0x0D50(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_CE6D68294E54E217460BE09C8A20D446; // 0x0ED8(0x0188)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_A36F4FD0482DE2C331E03A8E56CC4538; // 0x1060(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A24F85E54B481AC153A9C6B1D623A10A; // 0x1110(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2D1EDD384CD02BB19A6C189528AF59D6; // 0x1140(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_33A4F96E4BED02D277AA92ADDB746E63; // 0x1168(0x0188)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B851F9934279C2E89E6F0DBAFCBE633A; // 0x12F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EF3B24FD44CA70CA5EF1F096740EAB83; // 0x1318(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D1CFB2A04F9272AA16688D8FBDB5514C; // 0x1340(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12451D2E40418DB938B6EDA299D1CBB8; // 0x1368(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0F329A3E4DD34151B80A2887372B61D6; // 0x1390(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_109C83E743749E0B298F42AD60AF8478; // 0x13B8(0x00B0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_E568B65F439DF32E4FA795B7EBF325B0; // 0x1468(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_D9E9622D4FD598E3D04FF4AA88CDBAD5; // 0x15F0(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_87DA1D7346B6867BDBBFBC8CAA817947; // 0x1778(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_3101794944EA5066D10571BDABCADBE4; // 0x1900(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_6AF0CCDE421A7E2D1B54F0B2A9CD39E1; // 0x1A88(0x0188)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2D11FB3241697C4B0A4C59A54E06351D; // 0x1C10(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37EEEEC04A83B0AA5B279CA0505B09D2; // 0x1C40(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_E342D5904F4C28CBC978F9A48E161DA8; // 0x1C68(0x0188)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E8D982A44B343F665D043AB9E8B8C5B1; // 0x1DF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5AC2EB5E40F1789BD34E139194E7666C; // 0x1E18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68788A05463AB1235A5CDFB71E5AE89C; // 0x1E40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EEB8819648C790C648C5EBA5127310D5; // 0x1E68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7ECC121B481CBE5F0B25B6AD45CFB509; // 0x1E90(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_DE093EB84D78463A314BB6B84D992071; // 0x1EB8(0x00B0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_637AE9C74B8A6CD4153910AFB53F01C4; // 0x1F68(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_EB650232447AA165CE5F2992302769B2; // 0x20F0(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_232D261643B0608E845181B2AF366FC5; // 0x2278(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_CE6CB7A842A7D6A958F01880ECB9CBF7; // 0x2400(0x0188)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_BF664B9D41C186141A06D7965E452E3A; // 0x2588(0x0188)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_717B110D481BCECFF6F4DFBA57DF7967; // 0x2710(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3AC06B67447F269C7AFD998FC85F76AB; // 0x2740(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_CCC71DDE4662175362356DB9F6E3E053; // 0x2770(0x00B0)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_B37363DC4408105AC1D19D972D553798; // 0x2820(0x0090)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_33236BA542B6B2FF4B6DC0BAEADA4D07; // 0x28B0(0x00C8)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot_8F2C3BC849EC013B416E30A797B02B2E; // 0x2978(0x0090)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28635E5D4327AD1AE7FB88957AC301E7; // 0x2A08(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8C727CEC4A54A4AA0D62999CA58F6CD4; // 0x2AA8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7DEFEA77476B5E6E6218348368233830; // 0x2AC8(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E66BEE7D4BA955C886BFB390F4F966C6; // 0x2BD0(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABCB061D4CEBADFA5F609AAA1A9C96AE; // 0x2C88(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6DD83249408919DCA2F3958838E8F9AA; // 0x2CA8(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0C16187F4D84EBFA43B11D90B085DFC3; // 0x2D60(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_61B24B1A42CFEA743D3C5E9D4CF10741; // 0x2DA8(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87D2AA794A46E77C0299FFA64438485D; // 0x2E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_02BAEE564FBD11D8A43FB591F67D528E; // 0x2E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3E94BAF94A1B0FBB8CB7E0B137A8B5A7; // 0x2EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4EC67E294737241179DB57B1B247CF3E; // 0x2EE0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_535575F4416CDA000AC798B2E5C1291D; // 0x2F08(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_B8BB0EAD4FD0A7870871B6B69EEC7EAC; // 0x2F80(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9DB3FA784CBA2795684F76AA453DCC4B; // 0x3030(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_250835DA4768E3C2346D188DAA826386; // 0x30A8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_781581A847BA74B7702EF98C997F4617; // 0x3120(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E52D500A4BB408B79E034E893534C2D4; // 0x3198(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5A0663EE4DABF9B89BF3AAA27D0BCF70; // 0x3210(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41CDD60143B211C47AE860920A7BF331; // 0x3288(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1DA5E02D4238A869B851349703659653; // 0x32B8(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2594CF3B4C0D6C61605CC688E16A244C; // 0x3330(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CF3DB99945FCD82E2F30B48CF4BFF780; // 0x33E0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BEB5DB9A409F3966D87C528A6D42B700; // 0x3458(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FEB67637434ECED9D5938CA0764AA13C; // 0x34D0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C88726F04D84D25F22E30985C6EB2B20; // 0x3548(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_110613EF4E5A6AC811C8B38B0E215657; // 0x35C0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0300C32249C6B88C20A3F288668F5F29; // 0x3638(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A4D738B44CD26FDF785EE1A96987A5F2; // 0x3668(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3CA26F1A4CB1C21CC30AD88C2EFC1A4B; // 0x3748(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_597F57044CE4044021B570A3028083C5; // 0x37F8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A17C61E941954997207CA08BA9D00540; // 0x38D8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_BE57CC344619CB7B1F457483508533DD; // 0x39B8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_678AA40A443372B8CD6893BAD4A4A215; // 0x3A98(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_BE09B73542468A55F2C431A42EEAAA6A; // 0x3B78(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D26D133443F83F6789837CAC3720CFC3; // 0x3C58(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ED9C28C54A8CFBFD9A9F7599D1CEA547; // 0x3C88(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0438A6514B113D000A8AF3A3DD3B29AF; // 0x3D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96C38A424AAB9580B596AB8C4661D4CB; // 0x3D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_531FC6C14664FE658B1914A86322475A; // 0x3D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4AEF1FD445C3E73F268AF8B1457DC841; // 0x3DB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6A20DC244A21D593B91357B24674F8CC; // 0x3DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EBF0543C4BB2D68E5C149AACEB408AEA; // 0x3E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1AB574CA4AAC45DDE80110806F30E0E5; // 0x3E28(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68485DE64C9C9E6315422F846A8F2823; // 0x3E50(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_D9FAA3184DD8F8497BCAEA9C69A66366; // 0x3EC8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A838F01A426DDA6E0BA99581E4A1DBA9; // 0x3F78(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6FF52EA041D03ADAD2CF5BAB9BF09020; // 0x3FF0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D0C076454BA918228BAFB299DE0D4CA7; // 0x4068(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B5D2D3354A9CCCCA78FCCB8A42EA9DE7; // 0x40E0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56D313A54D5C5020BCDF79BC34203A95; // 0x4158(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A52091D746D8FD6F107F6A8A11C1D88A; // 0x41D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5C0B8AA445AA8CF6CA42D297D7B2C107; // 0x4200(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_FCCEAADE446C5A29E439B5BF8F1150F8; // 0x4278(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81EBC52745A1BD0456AE1E8427393F1A; // 0x4328(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E31BE6C0468E0BA4BE59F5A38AC4F454; // 0x43A0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FC36D7C04B143D5407952E85DE5301DB; // 0x4418(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A2AEDDA140B2C6A5B0DEF59D928C0F10; // 0x4490(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_980AAEBF43B1A3D10B806FA887A927DF; // 0x4508(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_021314BC4ECFB05B14E625BE0DD0EAE2; // 0x4580(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_337AEF6F472286FAA7B937B983D1686B; // 0x45B0(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5E3D0E434C406A1BA87855BA9F091D84; // 0x4690(0x00E0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_0AAF31F943E2A82EF95BBCB0BF0B44B3; // 0x4770(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_E004E0FE406081BBF1D68793C705FABE; // 0x47B8(0x00B0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_EB32A6CB444B65781D5B43AF60C36F3A; // 0x4868(0x00B0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32579D6449AE16F76F1C41847BA49CB3; // 0x4918(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_73AD163D4CEFC8FF6806AB83BF4A22D1; // 0x49F8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9EADB021480E33A815C6D38D285F4F35; // 0x4AD8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5823E404474D9EB927D32EABE2FC13F8; // 0x4BB8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6F216B594B8CB5224334A89DCF68B697; // 0x4C98(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_0410F0EB4CF0402C7BF27880AFC87D12; // 0x4D78(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A320421A47601D10E689AF9484EDF5D0; // 0x4E18(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_C51C24044292AD984A7C918FA754086F; // 0x4EF8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B9BAC928458585E61AC660802D74ED5B; // 0x4FD8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_FB2C5EBE4632414F7B318F81E44E35EC; // 0x50B8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0D7BF37642725048F8C5BDB2FDF77D30; // 0x5198(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9B3C3C764D4F22A3FA6C5A9EBDB83FC6; // 0x5278(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_320FFBAC408942AE55422994831AB108; // 0x5358(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_91305CC945B6DF3BFC2982A6A6042A2E; // 0x5388(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_51B924F74FCD7D7AE65ED398DE95A225; // 0x5468(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_AA4B452741F0ADEC75EF7796738B1D83; // 0x5548(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B8E9F48D4B15C311111085A96782FF38; // 0x5628(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_75284B7C49B1032A59345684957BFD67; // 0x5708(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_AF0E836A4BE379B6E9C1B796F868F0AB; // 0x57E8(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_CFB7D22F4FC01CEDE40928A7A14D494C; // 0x58C8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14B88E18466006000D051DB727653086; // 0x5978(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_48FE3FAA42B614175DAAC78A7C3F31A6; // 0x59A8(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B36EFF77492A0A27EE793382C93FBA2C; // 0x5A88(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B9C111F34C32220DC08437B5578C2F2D; // 0x5B68(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_285208CD4B4BB76795B2C388BFF9D323; // 0x5C48(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8DA7DCFB43818E4FB6A15D8916C8BF6E; // 0x5D28(0x00E0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_EE9E61204E5EA18FF987C1A01A972388; // 0x5E08(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_A3D3DD514E5950E8A08F7CA40713A7AD; // 0x5EE8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C3B4E8F9427381438F8AA88B56A43FEB; // 0x5F98(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A87AC0684D8E72934EB9CDAEB136E882; // 0x5FC8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_603E603343442086B4EDA49208441314; // 0x6078(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2B69092A46BB3793386CA496E01D4FDB; // 0x60A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E7B5FBB5498F40890E06B981EFF256DF; // 0x60C8(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DCE03BE34424E7B63D8E5FB8174EC847; // 0x6180(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_C4D008E84C6DE18D0583668B54FC25EA; // 0x61C8(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_99BE54B44FFE2B70FDE66CB9F457A891; // 0x6288(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B661506E493C2CC82A2073AED17E3CD7; // 0x6340(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A2DF6C944CB6F095C1E7DC9B91B15E5B; // 0x6368(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18379A2A42CC6C4ED312A28740B4C81A; // 0x6390(0x0020)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_A7C1FB214A0DA552F886B0977F3EC811; // 0x63B0(0x00F0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_771DA26841DF7068711064BC772861AB; // 0x64A0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_FE5F1F85411B5655C2BB55BB742DE903; // 0x64C0(0x00B8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_65E6CBE04DE95FF44517C882873E8E06; // 0x6578(0x0188)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_218E29A2401B035FF30C27845D09D563; // 0x6700(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DAF694314590DDBEBA31EAB27AB0D155; // 0x6778(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6A52852D4F20168D9F7A8EA2CBA971AC; // 0x67F0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FB5DFA11480B46AC4606408B1279BE76; // 0x6868(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75FFE0A74624E9B2CAAA159B21FBB7B0; // 0x68E0(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_670F40054BDEF12D60E77C8AFFA14D3F; // 0x6958(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1B6FC85F49F10B1B4948A396C1359D3C; // 0x6A08(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BFFB472E49AD1825EE061BBC403355DF; // 0x6A80(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_65997C464D956D8BBFA25E8FC9F8FCBB; // 0x6AB0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39EC173941E59206630B9BB947B3CC41; // 0x6B60(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2E05849B40D8147BB2792991F99064C5; // 0x6B88(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19A28A754EC5ACBA081459BEFDCBC4F5; // 0x6BD0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2FB3782149E408F4A34087A281D16FDF; // 0x6C90(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8F120FAD4929143B5C36839A11FD319A; // 0x6CB8(0x00B8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_EF6C3378453B54AE45470C92EB02EF46; // 0x6D70(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_3BFF5DF946066281D29507A355318C8A; // 0x6F50(0x01E0)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting_1734799F4DA9AE926354C29D8A4216E5; // 0x7130(0x0120)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_682031214DA7ECF5212F2A9312F19191; // 0x7250(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_ED111EFC4745F754443290824092329E; // 0x7400(0x01B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_0181EE24491C77FCA79672B54EA65577; // 0x75B0(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7A1B72B844095B6E5024A9AF9E56BBB5; // 0x76A0(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2CE8ACC041A774C5119124B89EF5F9BB; // 0x7740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_224EBC8E43C995CC3DF34EB8A453B93E; // 0x7768(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2E41B0A94F607E5D4B6B9DB1DAC278B6; // 0x7790(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4E73FEFA4607960DD6B4E789D460D438; // 0x77D8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_DCB2CC36403704DE35FA128E09157DEF; // 0x7820(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_EAF242F74C2A2669BA80AC9EED1FDA07; // 0x7868(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_914390EA48D3F40D7ABB8AAB3DE64DE1; // 0x78B0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_BC6E70B146FC330FEFA19F92D94D0DAA; // 0x78F8(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_E51EE7114A905917EE9DBFAF6315D4A8; // 0x79A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E77904074FC4BACD4C8AAF8CA4F6A685; // 0x79F0(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_0BA4ED8B4C5AAD19C851CE981B761C09; // 0x7A20(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2C0A75CE423962604F55FCBE5C35E996; // 0x7A38(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_474806C04CE73BD6544618A8E3627086; // 0x7A68(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_CD533FA3412E66398D186AAF3B7286EE; // 0x7B18(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5734520F4EDE0B25DD2AFFB65701A612; // 0x7BE0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41A4122D4BB69A31C8CFF689EC0549E4; // 0x7CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FF760ABF4843BBDBD2A77D94096F373D; // 0x7CD0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D50476E9418967FEE3C6519D590B54D3; // 0x7CF8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_D4D5979B4E7B896BB1455F8401010F01; // 0x7D40(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_73FC37EA4BE33C95B1771E8C247E7C0E; // 0x7D88(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_A6B497CC4F0FD8FCCF012D9C21B6A6AA; // 0x7DD0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_42D8DF0141E861C55C426F94EF891328; // 0x7E18(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_FDF4902146BDFCFB7BC1CBAC4663D26C; // 0x7E60(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_14DDF88B4760700B0BE6B3B60F034EC8; // 0x7F10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F152D2E048E0638E7C4A98981B0B3960; // 0x7F58(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_F405B88A42D11B73619C50936DDCA538; // 0x7F88(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ADE93EB9492E1945EAE40CB97EC1D4A1; // 0x7FA0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1A988E9A473CD5DE03D2C19EA2279C58; // 0x7FD0(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7A77C1034095FC1C18AE52909B672082; // 0x8080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AD5A1D5842E0BAC00B7551983C1D9498; // 0x80A8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_E231A41648C519964B43C386FEB98880; // 0x80D0(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_36FBFC314B750622B2F468AAD3F71ECE; // 0x8118(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_A8A1D97F4D0B947D157BD2B09D31381B; // 0x8160(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_0AEE552844ACBC4BBCC04DBDCC3FCC80; // 0x81A8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_482E1695443AEC54BF14F8A4951CCF8B; // 0x81F0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_CBED710F4F58935003F21AAC2A5EABB6; // 0x8238(0x00B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_0A40CB3340C9AD2D86079DAD5A7E0B53; // 0x82E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CBD255114B3ABE0688D30B90D5C1D207; // 0x8330(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_02260DE348D2B529CEBDC1A2A7B14E15; // 0x8360(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F9FBC0B1424A8DEBB075CF90AC07F251; // 0x8378(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B926616E493B37D0C66681B28248DFB7; // 0x83A8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_366BEC1A43CACE46754DF58ADC7AE80F; // 0x8458(0x00C8)()
	float                                         RotationRate;                                      // 0x8520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcelerationH;                                      // 0x8524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AcelerationV;                                      // 0x8528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CharacterLocation;                                 // 0x852C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraRotator;                                     // 0x8538(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Prints;                                            // 0x8544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PerformMeele;                                      // 0x8545(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EWeaponType                                   PrevWeapon;                                        // 0x8546(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8547[0x1];                                     // 0x8547(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           PrevWeaponMontage;                                 // 0x8548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CurrentWeaponMontage;                              // 0x8550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouching;                                       // 0x8558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8559[0x3];                                     // 0x8559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MontangePlayWeight;                                // 0x855C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EWeaponType, class UAnimMontage*>        WeaponMontage;                                     // 0x8560(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Direction2;                                        // 0x85B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationRate2;                                     // 0x85B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            LeanRotationBySpeed;                               // 0x85B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSliding;                                         // 0x85C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85C1[0x3];                                     // 0x85C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GlobalAdditivePoseAlpha;                           // 0x85C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      GlobalAdditivePose;                                // 0x85C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloorPitch;                                        // 0x85D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloorRoll;                                         // 0x85D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SlidingLegsRotation;                               // 0x85D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SlidingLegsYaw;                                    // 0x85E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingLegsYawMapped;                              // 0x85E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevFrameLocationZ;                                // 0x85EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingCharacterVelocityZ;                         // 0x85F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingLegsYawTurnTarget;                          // 0x85F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlidingLegsYawTurnTargetLerp;                      // 0x85F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85FC[0x4];                                     // 0x85FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            SlidingAimingMap;                                  // 0x8600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FloorNormal;                                       // 0x8608(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalNormalInterp;                                // 0x8614(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandRetargetingFKWeight;                           // 0x8620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NormalizedFallSpeed_BP;                            // 0x8624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAlive;                                           // 0x8628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8629[0x7];                                     // 0x8629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWeaponType, class UAnimSequence*>       MeleeAnims;                                        // 0x8630(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          ADS;                                               // 0x8680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8681[0x3];                                     // 0x8681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ADSAlpha;                                          // 0x8684(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x8688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ThirdPerson_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_D9E9622D4FD598E3D04FF4AA88CDBAD5();
	void PlayMelee(float StartTime);
	void AnimNotify_Land_R();
	void AnimNotify_Land_L();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_87DA1D7346B6867BDBBFBC8CAA817947();
	void AnimNotify_TurnEnded();
	void AnimNotify_Step_R();
	void AnimNotify_Step_L();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ThirdPerson_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_3101794944EA5066D10571BDABCADBE4();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
