#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeWatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "NGDBackend_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// Enum TimeWatch.EGameModeType
// NumValues: 0x0006
enum class EGameModeType : uint8
{
	Undefined                                = 0,
	DeathMatch                               = 1,
	Capture                                  = 2,
	Tutorial                                 = 3,
	Domination                               = 4,
	EGameModeType_MAX                        = 5,
};

// Enum TimeWatch.ETWCauseOfDeath
// NumValues: 0x0005
enum class ETWCauseOfDeath : uint8
{
	Explosion                                = 0,
	Damage_Enemy                             = 1,
	Damage_Friendly                          = 2,
	Damage_Paradox                           = 3,
	ETWCauseOfDeath_MAX                      = 4,
};

// Enum TimeWatch.ETWBasicPlayerAction
// NumValues: 0x0008
enum class ETWBasicPlayerAction : uint8
{
	None                                     = 0,
	Crouch                                   = 1,
	Slide                                    = 2,
	RightClickUse                            = 4,
	Jump                                     = 8,
	LeftClickUse                             = 22,
	Sprint                                   = 50,
	ETWBasicPlayerAction_MAX                 = 51,
};

// Enum TimeWatch.EFluxCapacitorStates
// NumValues: 0x000D
enum class EFluxCapacitorStates : uint8
{
	WAITING_DATA                             = 0,
	CHAR_SELECTION                           = 1,
	PRE_MATCH                                = 2,
	START                                    = 3,
	FORWARD                                  = 4,
	REVERSE                                  = 5,
	CURLING                                  = 6,
	PREPARE_LOOP                             = 7,
	LASTLOOP_REVIEW                          = 8,
	GAME_ENDED                               = 9,
	RESTART                                  = 10,
	AFTER_CURL                               = 11,
	EFluxCapacitorStates_MAX                 = 12,
};

// Enum TimeWatch.EChatChannel
// NumValues: 0x0004
enum class EChatChannel : uint8
{
	All                                      = 0,
	Team                                     = 1,
	NONE                                     = 2,
	EChatChannel_MAX                         = 3,
};

// Enum TimeWatch.ERuleAcceptType
// NumValues: 0x0004
enum class ERuleAcceptType : uint8
{
	LESS                                     = 0,
	EQUAL                                    = 1,
	MORE                                     = 2,
	ERuleAcceptType_MAX                      = 3,
};

// Enum TimeWatch.ETWMatchmakingType
// NumValues: 0x000C
enum class ETWMatchmakingType : uint8
{
	CasualSinglesFlexmatchPoll               = 0,
	CasualDoublesFlexmatchPoll               = 1,
	CasualDoublesWithPartyLobbyPoll          = 2,
	CasualDoublesWithPartyFlexmatchPoll      = 3,
	RankedSinglesFlexmatchPoll               = 4,
	RankedDoublesFlexmatchPoll               = 5,
	RankedDoublesWithPartyLobbyPoll          = 6,
	RankedDoublesWithPartyFlexmatchPoll      = 7,
	CustomMatchLobbyPoll                     = 8,
	CustomMatchGameSessionPoll               = 9,
	None                                     = 10,
	ETWMatchmakingType_MAX                   = 11,
};

// Enum TimeWatch.ELobbyReplicableField
// NumValues: 0x000B
enum class ELobbyReplicableField : uint32
{
	Map                                      = 0,
	PlayersSetup                             = 1,
	MatchPoints                              = 2,
	ClonesCount                              = 3,
	HealthPackMode                           = 4,
	WeaponMode                               = 5,
	OvertimeMode                             = 6,
	PassiveAbilitiesMode                     = 7,
	LoopLength                               = 8,
	HealingMode                              = 9,
	ELobbyReplicableField_MAX                = 10,
};

// Enum TimeWatch.ECameraPointType
// NumValues: 0x0003
enum class ECameraPointType : uint8
{
	Spectator                                = 0,
	LoopReview                               = 1,
	ECameraPointType_MAX                     = 2,
};

// Enum TimeWatch.EEndGameReason
// NumValues: 0x0006
enum class EEndGameReason : uint32
{
	None                                     = 0,
	MatchComplete                            = 1,
	Forfeit                                  = 2,
	Suspended                                = 3,
	COUNT                                    = 4,
	EEndGameReason_MAX                       = 5,
};

// Enum TimeWatch.EFluxBarrelState
// NumValues: 0x0005
enum class EFluxBarrelState : uint8
{
	ARMED                                    = 0,
	FUSE                                     = 1,
	EXPLODING                                = 2,
	USED                                     = 3,
	EFluxBarrelState_MAX                     = 4,
};

// Enum TimeWatch.EFluxTimelineState
// NumValues: 0x0005
enum class EFluxTimelineState : uint8
{
	STOPPED                                  = 0,
	FORWARD                                  = 1,
	REWINDING                                = 2,
	PREFORWARD                               = 3,
	EFluxTimelineState_MAX                   = 4,
};

// Enum TimeWatch.EProjectileState
// NumValues: 0x0005
enum class EProjectileState : uint8
{
	Created                                  = 0,
	Simulating                               = 1,
	PendingDestruction                       = 2,
	Destroyed                                = 3,
	EProjectileState_MAX                     = 4,
};

// Enum TimeWatch.EFriendState
// NumValues: 0x0004
enum class EFriendState : uint8
{
	Online                                   = 0,
	Offline                                  = 1,
	Party                                    = 2,
	EFriendState_MAX                         = 3,
};

// Enum TimeWatch.EWeaponType
// NumValues: 0x0008
enum class EWeaponType : uint8
{
	WT_None                                  = 0,
	WT_HandGun                               = 1,
	WT_Rifle                                 = 2,
	WT_SMG                                   = 3,
	WT_GrenadeLauncher                       = 4,
	WT_Shotgun                               = 5,
	WT_LaserBeam                             = 6,
	WT_MAX                                   = 7,
};

// Enum TimeWatch.EADSStates
// NumValues: 0x0006
enum class EADSStates : uint8
{
	NONE                                     = 0,
	START_SHOWING                            = 1,
	SHOWN                                    = 2,
	START_HIDING                             = 3,
	HIDDEN                                   = 4,
	EADSStates_MAX                           = 5,
};

// Enum TimeWatch.EFluxLoopResult
// NumValues: 0x0004
enum class EFluxLoopResult : uint8
{
	Continue                                 = 0,
	Reset                                    = 1,
	GameFinished                             = 2,
	EFluxLoopResult_MAX                      = 3,
};

// Enum TimeWatch.ETWTargetDataFilterTeam
// NumValues: 0x0004
enum class ETWTargetDataFilterTeam : uint8
{
	TW_TDFT_Any                              = 0,
	TW_TDFT_NoAlly                           = 1,
	TW_TDFT_NoEnemy                          = 2,
	TW_TDFT_MAX                              = 3,
};

// Enum TimeWatch.ETWTargetDataFilterSelf
// NumValues: 0x0004
enum class ETWTargetDataFilterSelf : uint8
{
	TW_TDFS_Any                              = 0,
	TW_TDFS_NoSelf                           = 1,
	TW_TDFS_NoOthers                         = 2,
	TW_TDFS_MAX                              = 3,
};

// Enum TimeWatch.ETWAbilityForwardEndPolicy
// NumValues: 0x0004
enum class ETWAbilityForwardEndPolicy : uint8
{
	Interrupted                              = 0,
	PauseAndResume                           = 1,
	PauseAndResumeForCaster                  = 2,
	ETWAbilityForwardEndPolicy_MAX           = 3,
};

// Enum TimeWatch.ETWAbilityNetExecutionPolicy
// NumValues: 0x0005
enum class ETWAbilityNetExecutionPolicy : uint8
{
	LocallyPredicted                         = 0,
	LocallyPredictedAndServerInitiated       = 1,
	ServerInitiated                          = 2,
	ServerOnly                               = 3,
	ETWAbilityNetExecutionPolicy_MAX         = 4,
};

// Enum TimeWatch.ETWAbilityInstancingPolicy
// NumValues: 0x0005
enum class ETWAbilityInstancingPolicy : uint8
{
	InstancedPerWorld                        = 0,
	InstancedPerPlayer                       = 1,
	InstancedPerAvatar                       = 2,
	InstancedPerExecution                    = 3,
	ETWAbilityInstancingPolicy_MAX           = 4,
};

// Enum TimeWatch.ETWAbilityReExecutionPolicy
// NumValues: 0x0004
enum class ETWAbilityReExecutionPolicy : uint8
{
	LogicAndCosmetics                        = 0,
	CosmeticsOnly                            = 1,
	Unrecorded                               = 2,
	ETWAbilityReExecutionPolicy_MAX          = 3,
};

// Enum TimeWatch.ETWAbilityCastPolicy
// NumValues: 0x0004
enum class ETWAbilityCastPolicy : uint8
{
	AliveCasterOnly                          = 0,
	DeadCasterOnly                           = 1,
	AlwaysCast                               = 2,
	ETWAbilityCastPolicy_MAX                 = 3,
};

// Enum TimeWatch.ECaptureState
// NumValues: 0x0005
enum class ECaptureState : uint8
{
	Reach                                    = 0,
	Contested                                = 1,
	Clear                                    = 2,
	Defend                                   = 3,
	ECaptureState_MAX                        = 4,
};

// Enum TimeWatch.EButtonStyle
// NumValues: 0x0006
enum class EButtonStyle : uint8
{
	EMPTY                                    = 0,
	UNSELECTED                               = 1,
	SELECTED                                 = 2,
	ACTIVE                                   = 3,
	FORCEHOVER                               = 4,
	EButtonStyle_MAX                         = 5,
};

// Enum TimeWatch.EDMScoreState
// NumValues: 0x0005
enum class EDMScoreState : uint32
{
	Locked                                   = 0,
	Empty                                    = 1,
	Full                                     = 2,
	None                                     = 3,
	EDMScoreState_MAX                        = 4,
};

// Enum TimeWatch.EAnnouncerEventTypes
// NumValues: 0x0006
enum class EAnnouncerEventTypes : uint8
{
	Generic                                  = 0,
	Positive                                 = 1,
	Negative                                 = 2,
	NegativeForOthers                        = 3,
	PositiveForOthers                        = 4,
	EAnnouncerEventTypes_MAX                 = 5,
};

// Enum TimeWatch.ETWCrowdReactionScoringCriteria
// NumValues: 0x0005
enum class ETWCrowdReactionScoringCriteria : uint8
{
	None                                     = 0,
	Event                                    = 1,
	Clone                                    = 2,
	LoopStack                                = 4,
	ETWCrowdReactionScoringCriteria_MAX      = 5,
};

// Enum TimeWatch.ETWLocalizedLanguage
// NumValues: 0x000D
enum class ETWLocalizedLanguage : uint8
{
	None                                     = 0,
	English                                  = 1,
	Spanish                                  = 2,
	Portuguese                               = 3,
	French                                   = 4,
	German                                   = 5,
	Italian                                  = 6,
	Russian                                  = 7,
	Korean                                   = 8,
	Japanese                                 = 9,
	ChineseTraditional                       = 10,
	ChineseSimplified                        = 11,
	ETWLocalizedLanguage_MAX                 = 12,
};

// Enum TimeWatch.ETWChallengeBackendRequirementType
// NumValues: 0x0003
enum class ETWChallengeBackendRequirementType : uint8
{
	None                                     = 0,
	PlayerLevel                              = 2,
	ETWChallengeBackendRequirementType_MAX   = 3,
};

// Enum TimeWatch.EChallengeDifficulty
// NumValues: 0x0005
enum class EChallengeDifficulty : uint32
{
	Begginer                                 = 0,
	Medium                                   = 1,
	Advanced                                 = 2,
	GameModes                                = 3,
	EChallengeDifficulty_MAX                 = 4,
};

// Enum TimeWatch.ETWMatchQueueType
// NumValues: 0x000A
enum class ETWMatchQueueType : uint8
{
	None                                     = 0,
	CasualSingles                            = 1,
	CasualDoubles                            = 2,
	CasualDoublesWithParty                   = 3,
	RankedSingles                            = 4,
	RankedDoubles                            = 5,
	RankedDoublesWithParty                   = 6,
	Newcomer                                 = 7,
	Custom                                   = 8,
	ETWMatchQueueType_MAX                    = 9,
};

// Enum TimeWatch.EOvertimeMode
// NumValues: 0x0004
enum class EOvertimeMode : uint8
{
	Normal                                   = 0,
	ResetClones                              = 1,
	ResetEverything                          = 2,
	EOvertimeMode_MAX                        = 3,
};

// Enum TimeWatch.EHealthPackHealingMode
// NumValues: 0x0004
enum class EHealthPackHealingMode : uint8
{
	Instant                                  = 0,
	HealOverTime                             = 1,
	AreaHealing                              = 2,
	EHealthPackHealingMode_MAX               = 3,
};

// Enum TimeWatch.EHealthPackMode
// NumValues: 0x0004
enum class EHealthPackMode : uint8
{
	Normal                                   = 0,
	None                                     = 1,
	Refilling                                = 2,
	EHealthPackMode_MAX                      = 3,
};

// Enum TimeWatch.ETWMatchType
// NumValues: 0x0008
enum class ETWMatchType : uint8
{
	None                                     = 0,
	Casual_1v1                               = 1,
	Casual_2v2                               = 2,
	Ranked_1v1                               = 4,
	Ranked_2v2                               = 8,
	NewcomerMatch                            = 16,
	CustomMatch                              = 32,
	ETWMatchType_MAX                         = 33,
};

// Enum TimeWatch.ETWQualitySettings
// NumValues: 0x0006
enum class ETWQualitySettings : uint8
{
	None                                     = 0,
	LOW                                      = 1,
	MEDIUM                                   = 2,
	HIGH                                     = 4,
	EPIC                                     = 8,
	ETWQualitySettings_MAX                   = 9,
};

// Enum TimeWatch.EQuickChatCategory
// NumValues: 0x0005
enum class EQuickChatCategory : uint8
{
	Information                              = 0,
	Exclamations                             = 1,
	Compliments                              = 2,
	Categories                               = 3,
	EQuickChatCategory_MAX                   = 4,
};

// Enum TimeWatch.ELaserSoundEventType
// NumValues: 0x0005
enum class ELaserSoundEventType : uint8
{
	Charge                                   = 0,
	Start                                    = 1,
	End                                      = 2,
	Terminate                                = 3,
	ELaserSoundEventType_MAX                 = 4,
};

// Enum TimeWatch.ELoopState
// NumValues: 0x0004
enum class ELoopState : uint8
{
	Past                                     = 0,
	Current                                  = 1,
	Future                                   = 2,
	ELoopState_MAX                           = 3,
};

// Enum TimeWatch.EPostProcessType
// NumValues: 0x0002
enum class EPostProcessType : uint8
{
	Damage                                   = 0,
	EPostProcessType_MAX                     = 1,
};

// Enum TimeWatch.ETransitionState
// NumValues: 0x0004
enum class ETransitionState : uint8
{
	None                                     = 0,
	SwitchingClones                          = 1,
	LastLoopReview                           = 2,
	ETransitionState_MAX                     = 3,
};

// Enum TimeWatch.EFirstUserExperienceSteps
// NumValues: 0x001B
enum class EFirstUserExperienceSteps : uint8
{
	Undefined                                = 0,
	IntroVideo                               = 1,
	CongratulationsAcademy                   = 2,
	CasualUnlocked                           = 3,
	DailyBoost                               = 4,
	GetReadyCasual                           = 5,
	RankedUnlocked                           = 6,
	GetReadyRanked                           = 7,
	FirstOnlineMatch_Matchmaking             = 8,
	FirstOnlineMatch_Started                 = 9,
	FirstOnlineMatch_FirstClonEver           = 10,
	FirstOnlineMatch_SecondClonEver          = 11,
	FirstOnlineMatch_ThirdClonEver           = 12,
	FirstOnlineMatch_FirstRoundComplete      = 13,
	FirstOnlineMatch_SecondRoundComplete     = 14,
	FirstOnlineMatch_Completed               = 15,
	SecondOnlineMatch_Started                = 16,
	SecondOnlineMatch_Completed              = 17,
	UserReachedLevelTwo                      = 18,
	UserReachedLevelThree                    = 19,
	UserReachedLevelFour                     = 20,
	UserReachedLevelFive                     = 21,
	FirstRankedMatch_Matchmaking             = 22,
	FirstRankedMatch_Started                 = 23,
	FirstRankedMatch_Completed               = 24,
	TournamentCap_Reached                    = 25,
	EFirstUserExperienceSteps_MAX            = 26,
};

// Enum TimeWatch.EBannerSize
// NumValues: 0x0004
enum class EBannerSize : uint8
{
	Big                                      = 0,
	Medium                                   = 1,
	Small                                    = 2,
	EBannerSize_MAX                          = 3,
};

// Enum TimeWatch.EWidgetSize
// NumValues: 0x0003
enum class EWidgetSize : uint8
{
	Small                                    = 0,
	Big                                      = 1,
	EWidgetSize_MAX                          = 2,
};

// Enum TimeWatch.ESpectatorModes
// NumValues: 0x0004
enum class ESpectatorModes : uint8
{
	FREELOOK                                 = 0,
	FIRSTPERSON                              = 1,
	THIRDPERSON                              = 2,
	ESpectatorModes_MAX                      = 3,
};

// Enum TimeWatch.ECharSelectionState
// NumValues: 0x0003
enum class ECharSelectionState : uint8
{
	PLAYER_VIEW                              = 0,
	SPECTATOR_VIEW                           = 1,
	ECharSelectionState_MAX                  = 2,
};

// Enum TimeWatch.ECustomizationFlowState
// NumValues: 0x0003
enum class ECustomizationFlowState : uint8
{
	CHARACTER_SELECTION                      = 0,
	STYLE_SELECTION                          = 1,
	ECustomizationFlowState_MAX              = 2,
};

// Enum TimeWatch.ERewardConditionType
// NumValues: 0x0003
enum class ERewardConditionType : uint8
{
	Condition_Win                            = 0,
	Condition_Play                           = 1,
	Condition_MAX                            = 2,
};

// Enum TimeWatch.EMatchTallyFlowState
// NumValues: 0x0004
enum class EMatchTallyFlowState : uint8
{
	WaitingForResults                        = 0,
	ShowingResults                           = 1,
	TierUpPopup                              = 2,
	EMatchTallyFlowState_MAX                 = 3,
};

// Enum TimeWatch.ELeaderboardProperties
// NumValues: 0x0009
enum class ELeaderboardProperties : uint8
{
	LP_UserName                              = 0,
	LP_Rank                                  = 1,
	LP_WinRate                               = 2,
	LP_Win                                   = 3,
	LP_Lose                                  = 4,
	LP_Elo                                   = 5,
	LP_Score                                 = 6,
	LP_RankDifference                        = 7,
	LP_MAX                                   = 8,
};

// Enum TimeWatch.ELeaderboardPeriod
// NumValues: 0x0005
enum class ELeaderboardPeriod : uint8
{
	AllTime                                  = 0,
	Monthly                                  = 1,
	Weekly                                   = 2,
	Daily                                    = 3,
	ELeaderboardPeriod_MAX                   = 4,
};

// Enum TimeWatch.EPlaySelectionState
// NumValues: 0x0003
enum class EPlaySelectionState : uint8
{
	OneVOne                                  = 0,
	TwoVTwo                                  = 1,
	EPlaySelectionState_MAX                  = 2,
};

// Enum TimeWatch.EFeedbackType
// NumValues: 0x0004
enum class EFeedbackType : uint8
{
	HitFeedback                              = 0,
	ExplosionFeedback                        = 1,
	CriticalHitFeedback                      = 2,
	EFeedbackType_MAX                        = 3,
};

// Enum TimeWatch.ERewardTrackState
// NumValues: 0x0003
enum class ERewardTrackState : uint8
{
	REWARD_TRACK                             = 0,
	ITEM_PREVIEW                             = 1,
	ERewardTrackState_MAX                    = 2,
};

// Enum TimeWatch.EDailyStoreFlowState
// NumValues: 0x0005
enum class EDailyStoreFlowState : uint8
{
	DAILY_STORE                              = 0,
	ITEM_PREVIEW                             = 1,
	QUARKS_BUNDLES                           = 2,
	WAITING_DATA                             = 3,
	EDailyStoreFlowState_MAX                 = 4,
};

// Enum TimeWatch.ETipNotificationType
// NumValues: 0x0003
enum class ETipNotificationType : uint8
{
	InGame_Default                           = 0,
	MainMenu_Default                         = 1,
	ETipNotificationType_MAX                 = 2,
};

// Enum TimeWatch.EWeaponIconType
// NumValues: 0x0005
enum class EWeaponIconType : uint8
{
	FullImage_Selected                       = 0,
	FullImage_UnSelected                     = 1,
	SmallImage_Selected                      = 2,
	SmallImage_UnSelected                    = 3,
	EWeaponIconType_MAX                      = 4,
};

// ScriptStruct TimeWatch.TWAbilityCustomDataBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FTWAbilityCustomDataBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTWAbilityCustomDataBase) == 0x000008, "Wrong alignment on FTWAbilityCustomDataBase");
static_assert(sizeof(FTWAbilityCustomDataBase) == 0x000008, "Wrong size on FTWAbilityCustomDataBase");

// ScriptStruct TimeWatch.TWInteractableTimelineRecordData
// 0x0018 (0x0018 - 0x0000)
struct FTWInteractableTimelineRecordData final
{
public:
	float                                         Timestamp;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingCooldown;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasUsedOnce;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsingInitialCooldown;                             // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Interactor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTWInteractableTimelineRecordData) == 0x000008, "Wrong alignment on FTWInteractableTimelineRecordData");
static_assert(sizeof(FTWInteractableTimelineRecordData) == 0x000018, "Wrong size on FTWInteractableTimelineRecordData");
static_assert(offsetof(FTWInteractableTimelineRecordData, Timestamp) == 0x000000, "Member 'FTWInteractableTimelineRecordData::Timestamp' has a wrong offset!");
static_assert(offsetof(FTWInteractableTimelineRecordData, RemainingCooldown) == 0x000004, "Member 'FTWInteractableTimelineRecordData::RemainingCooldown' has a wrong offset!");
static_assert(offsetof(FTWInteractableTimelineRecordData, bWasUsedOnce) == 0x000008, "Member 'FTWInteractableTimelineRecordData::bWasUsedOnce' has a wrong offset!");
static_assert(offsetof(FTWInteractableTimelineRecordData, bUsingInitialCooldown) == 0x000009, "Member 'FTWInteractableTimelineRecordData::bUsingInitialCooldown' has a wrong offset!");
static_assert(offsetof(FTWInteractableTimelineRecordData, Interactor) == 0x000010, "Member 'FTWInteractableTimelineRecordData::Interactor' has a wrong offset!");

// ScriptStruct TimeWatch.CharacterSelectionEntry
// 0x0028 (0x0028 - 0x0000)
struct FCharacterSelectionEntry final
{
public:
	class FString                                 CharacterSKU;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StyleSKU;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntroPosesIndex;                                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InternalChangeCount;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCharacterSelectionEntry) == 0x000008, "Wrong alignment on FCharacterSelectionEntry");
static_assert(sizeof(FCharacterSelectionEntry) == 0x000028, "Wrong size on FCharacterSelectionEntry");
static_assert(offsetof(FCharacterSelectionEntry, CharacterSKU) == 0x000000, "Member 'FCharacterSelectionEntry::CharacterSKU' has a wrong offset!");
static_assert(offsetof(FCharacterSelectionEntry, StyleSKU) == 0x000010, "Member 'FCharacterSelectionEntry::StyleSKU' has a wrong offset!");
static_assert(offsetof(FCharacterSelectionEntry, IntroPosesIndex) == 0x000020, "Member 'FCharacterSelectionEntry::IntroPosesIndex' has a wrong offset!");
static_assert(offsetof(FCharacterSelectionEntry, InternalChangeCount) == 0x000024, "Member 'FCharacterSelectionEntry::InternalChangeCount' has a wrong offset!");

// ScriptStruct TimeWatch.WeaponSelectionEntry
// 0x0028 (0x0028 - 0x0000)
struct FWeaponSelectionEntry final
{
public:
	class FString                                 WeaponSKU;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StyleSKU;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InternalChangeCount;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWeaponSelectionEntry) == 0x000008, "Wrong alignment on FWeaponSelectionEntry");
static_assert(sizeof(FWeaponSelectionEntry) == 0x000028, "Wrong size on FWeaponSelectionEntry");
static_assert(offsetof(FWeaponSelectionEntry, WeaponSKU) == 0x000000, "Member 'FWeaponSelectionEntry::WeaponSKU' has a wrong offset!");
static_assert(offsetof(FWeaponSelectionEntry, StyleSKU) == 0x000010, "Member 'FWeaponSelectionEntry::StyleSKU' has a wrong offset!");
static_assert(offsetof(FWeaponSelectionEntry, InternalChangeCount) == 0x000020, "Member 'FWeaponSelectionEntry::InternalChangeCount' has a wrong offset!");

// ScriptStruct TimeWatch.WeaponLoadoutEntry
// 0x0020 (0x0020 - 0x0000)
struct FWeaponLoadoutEntry final
{
public:
	int32                                         LoadoutID;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponSelectionEntry>          Loadout;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         InternalChangeCount;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWeaponLoadoutEntry) == 0x000008, "Wrong alignment on FWeaponLoadoutEntry");
static_assert(sizeof(FWeaponLoadoutEntry) == 0x000020, "Wrong size on FWeaponLoadoutEntry");
static_assert(offsetof(FWeaponLoadoutEntry, LoadoutID) == 0x000000, "Member 'FWeaponLoadoutEntry::LoadoutID' has a wrong offset!");
static_assert(offsetof(FWeaponLoadoutEntry, Loadout) == 0x000008, "Member 'FWeaponLoadoutEntry::Loadout' has a wrong offset!");
static_assert(offsetof(FWeaponLoadoutEntry, InternalChangeCount) == 0x000018, "Member 'FWeaponLoadoutEntry::InternalChangeCount' has a wrong offset!");

// ScriptStruct TimeWatch.PlayerTitleEntry
// 0x0018 (0x0018 - 0x0000)
struct FPlayerTitleEntry final
{
public:
	class FString                                 SKU;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InternalChangeCount;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPlayerTitleEntry) == 0x000008, "Wrong alignment on FPlayerTitleEntry");
static_assert(sizeof(FPlayerTitleEntry) == 0x000018, "Wrong size on FPlayerTitleEntry");
static_assert(offsetof(FPlayerTitleEntry, SKU) == 0x000000, "Member 'FPlayerTitleEntry::SKU' has a wrong offset!");
static_assert(offsetof(FPlayerTitleEntry, InternalChangeCount) == 0x000010, "Member 'FPlayerTitleEntry::InternalChangeCount' has a wrong offset!");

// ScriptStruct TimeWatch.CustomizationEntry
// 0x0068 (0x0068 - 0x0000)
struct FCustomizationEntry final
{
public:
	struct FCharacterSelectionEntry               CharacterEntry;                                    // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FWeaponLoadoutEntry                    LoadoutEntry;                                      // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FPlayerTitleEntry                      PlayerTitleEntry;                                  // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         InternalChangeCount;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomizationEntry) == 0x000008, "Wrong alignment on FCustomizationEntry");
static_assert(sizeof(FCustomizationEntry) == 0x000068, "Wrong size on FCustomizationEntry");
static_assert(offsetof(FCustomizationEntry, CharacterEntry) == 0x000000, "Member 'FCustomizationEntry::CharacterEntry' has a wrong offset!");
static_assert(offsetof(FCustomizationEntry, LoadoutEntry) == 0x000028, "Member 'FCustomizationEntry::LoadoutEntry' has a wrong offset!");
static_assert(offsetof(FCustomizationEntry, PlayerTitleEntry) == 0x000048, "Member 'FCustomizationEntry::PlayerTitleEntry' has a wrong offset!");
static_assert(offsetof(FCustomizationEntry, InternalChangeCount) == 0x000060, "Member 'FCustomizationEntry::InternalChangeCount' has a wrong offset!");

// ScriptStruct TimeWatch.PingMarker
// 0x0040 (0x0040 - 0x0000)
struct FPingMarker final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFluxPlayerState*                       Reporter;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x002C(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPingMarker) == 0x000008, "Wrong alignment on FPingMarker");
static_assert(sizeof(FPingMarker) == 0x000040, "Wrong size on FPingMarker");
static_assert(offsetof(FPingMarker, ID) == 0x000000, "Member 'FPingMarker::ID' has a wrong offset!");
static_assert(offsetof(FPingMarker, Reporter) == 0x000008, "Member 'FPingMarker::Reporter' has a wrong offset!");
static_assert(offsetof(FPingMarker, Time) == 0x000010, "Member 'FPingMarker::Time' has a wrong offset!");
static_assert(offsetof(FPingMarker, Location) == 0x000014, "Member 'FPingMarker::Location' has a wrong offset!");
static_assert(offsetof(FPingMarker, Normal) == 0x000020, "Member 'FPingMarker::Normal' has a wrong offset!");
static_assert(offsetof(FPingMarker, Color) == 0x00002C, "Member 'FPingMarker::Color' has a wrong offset!");

// ScriptStruct TimeWatch.TWGameplayTargetDataFilter
// 0x0028 (0x0028 - 0x0000)
struct FTWGameplayTargetDataFilter final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SelfActor;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETWTargetDataFilterTeam                       TeamFilter;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETWTargetDataFilterSelf                       SelfFilter;                                        // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceTypeQuery;                                    // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     RequiredActorClass;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseFilter;                                    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTWGameplayTargetDataFilter) == 0x000008, "Wrong alignment on FTWGameplayTargetDataFilter");
static_assert(sizeof(FTWGameplayTargetDataFilter) == 0x000028, "Wrong size on FTWGameplayTargetDataFilter");
static_assert(offsetof(FTWGameplayTargetDataFilter, SelfActor) == 0x000008, "Member 'FTWGameplayTargetDataFilter::SelfActor' has a wrong offset!");
static_assert(offsetof(FTWGameplayTargetDataFilter, TeamFilter) == 0x000010, "Member 'FTWGameplayTargetDataFilter::TeamFilter' has a wrong offset!");
static_assert(offsetof(FTWGameplayTargetDataFilter, SelfFilter) == 0x000011, "Member 'FTWGameplayTargetDataFilter::SelfFilter' has a wrong offset!");
static_assert(offsetof(FTWGameplayTargetDataFilter, TraceTypeQuery) == 0x000012, "Member 'FTWGameplayTargetDataFilter::TraceTypeQuery' has a wrong offset!");
static_assert(offsetof(FTWGameplayTargetDataFilter, RequiredActorClass) == 0x000018, "Member 'FTWGameplayTargetDataFilter::RequiredActorClass' has a wrong offset!");
static_assert(offsetof(FTWGameplayTargetDataFilter, bReverseFilter) == 0x000020, "Member 'FTWGameplayTargetDataFilter::bReverseFilter' has a wrong offset!");

// ScriptStruct TimeWatch.GameplayAbilityCollection
// 0x0010 (0x0010 - 0x0000)
struct FGameplayAbilityCollection final
{
public:
	TArray<class UTWGameplayTask*>                GameplayTaskCollection;                            // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameplayAbilityCollection) == 0x000008, "Wrong alignment on FGameplayAbilityCollection");
static_assert(sizeof(FGameplayAbilityCollection) == 0x000010, "Wrong size on FGameplayAbilityCollection");
static_assert(offsetof(FGameplayAbilityCollection, GameplayTaskCollection) == 0x000000, "Member 'FGameplayAbilityCollection::GameplayTaskCollection' has a wrong offset!");

// ScriptStruct TimeWatch.TWAbilityCustomDataHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FTWAbilityCustomDataHandle final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTWAbilityCustomDataHandle) == 0x000008, "Wrong alignment on FTWAbilityCustomDataHandle");
static_assert(sizeof(FTWAbilityCustomDataHandle) == 0x000020, "Wrong size on FTWAbilityCustomDataHandle");

// ScriptStruct TimeWatch.TWAbilityExecutionData
// 0x0028 (0x0028 - 0x0000)
struct FTWAbilityExecutionData final
{
public:
	class UTWAbilitiesComponent*                  Caster;                                            // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATimeWatchCharacter*                    avatar;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTWAbility>                 AbilityClass;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExecutionTime;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalExecutionTime;                                // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentCloneIndex;                                 // 0x0020(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFirstExecution;                                   // 0x0024(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTWAbilityExecutionData) == 0x000008, "Wrong alignment on FTWAbilityExecutionData");
static_assert(sizeof(FTWAbilityExecutionData) == 0x000028, "Wrong size on FTWAbilityExecutionData");
static_assert(offsetof(FTWAbilityExecutionData, Caster) == 0x000000, "Member 'FTWAbilityExecutionData::Caster' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, avatar) == 0x000008, "Member 'FTWAbilityExecutionData::avatar' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, AbilityClass) == 0x000010, "Member 'FTWAbilityExecutionData::AbilityClass' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, ExecutionTime) == 0x000018, "Member 'FTWAbilityExecutionData::ExecutionTime' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, LocalExecutionTime) == 0x00001C, "Member 'FTWAbilityExecutionData::LocalExecutionTime' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, CurrentCloneIndex) == 0x000020, "Member 'FTWAbilityExecutionData::CurrentCloneIndex' has a wrong offset!");
static_assert(offsetof(FTWAbilityExecutionData, bFirstExecution) == 0x000024, "Member 'FTWAbilityExecutionData::bFirstExecution' has a wrong offset!");

// ScriptStruct TimeWatch.MatchEvent
// 0x0028 (0x0028 - 0x0000)
struct FMatchEvent final
{
public:
	float                                         Timestamp;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    Killed;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATimeWatchCharacter*                    Killer;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             WeaponTexture;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConfirmed;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiscarded;                                        // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMatchEvent) == 0x000008, "Wrong alignment on FMatchEvent");
static_assert(sizeof(FMatchEvent) == 0x000028, "Wrong size on FMatchEvent");
static_assert(offsetof(FMatchEvent, Timestamp) == 0x000000, "Member 'FMatchEvent::Timestamp' has a wrong offset!");
static_assert(offsetof(FMatchEvent, Killed) == 0x000008, "Member 'FMatchEvent::Killed' has a wrong offset!");
static_assert(offsetof(FMatchEvent, Killer) == 0x000010, "Member 'FMatchEvent::Killer' has a wrong offset!");
static_assert(offsetof(FMatchEvent, WeaponTexture) == 0x000018, "Member 'FMatchEvent::WeaponTexture' has a wrong offset!");
static_assert(offsetof(FMatchEvent, bConfirmed) == 0x000020, "Member 'FMatchEvent::bConfirmed' has a wrong offset!");
static_assert(offsetof(FMatchEvent, bDiscarded) == 0x000021, "Member 'FMatchEvent::bDiscarded' has a wrong offset!");

// ScriptStruct TimeWatch.StateDebugInfo
// 0x0028 (0x0028 - 0x0000)
struct FStateDebugInfo final
{
public:
	class FString                                 DebugIdentifier;                                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTime;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewCurrentTime;                                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentState;                                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStateDebugInfo) == 0x000008, "Wrong alignment on FStateDebugInfo");
static_assert(sizeof(FStateDebugInfo) == 0x000028, "Wrong size on FStateDebugInfo");
static_assert(offsetof(FStateDebugInfo, DebugIdentifier) == 0x000000, "Member 'FStateDebugInfo::DebugIdentifier' has a wrong offset!");
static_assert(offsetof(FStateDebugInfo, CurrentTime) == 0x000010, "Member 'FStateDebugInfo::CurrentTime' has a wrong offset!");
static_assert(offsetof(FStateDebugInfo, NewCurrentTime) == 0x000014, "Member 'FStateDebugInfo::NewCurrentTime' has a wrong offset!");
static_assert(offsetof(FStateDebugInfo, CurrentState) == 0x000018, "Member 'FStateDebugInfo::CurrentState' has a wrong offset!");

// ScriptStruct TimeWatch.PhysicEventRegistry
// 0x0018 (0x0018 - 0x0000)
struct FPhysicEventRegistry final
{
public:
	TArray<int32>                                 RecordsPendingConfirmation;                        // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UFluxTimelineStaticActor*               OwnerTimeline;                                     // 0x0010(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FPhysicEventRegistry) == 0x000008, "Wrong alignment on FPhysicEventRegistry");
static_assert(sizeof(FPhysicEventRegistry) == 0x000018, "Wrong size on FPhysicEventRegistry");
static_assert(offsetof(FPhysicEventRegistry, RecordsPendingConfirmation) == 0x000000, "Member 'FPhysicEventRegistry::RecordsPendingConfirmation' has a wrong offset!");
static_assert(offsetof(FPhysicEventRegistry, OwnerTimeline) == 0x000010, "Member 'FPhysicEventRegistry::OwnerTimeline' has a wrong offset!");

// ScriptStruct TimeWatch.RewardData
// 0x0028 (0x0028 - 0x0000)
struct FRewardData final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumValue;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringValue;                                       // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRewardData) == 0x000008, "Wrong alignment on FRewardData");
static_assert(sizeof(FRewardData) == 0x000028, "Wrong size on FRewardData");
static_assert(offsetof(FRewardData, Type) == 0x000000, "Member 'FRewardData::Type' has a wrong offset!");
static_assert(offsetof(FRewardData, NumValue) == 0x000010, "Member 'FRewardData::NumValue' has a wrong offset!");
static_assert(offsetof(FRewardData, StringValue) == 0x000018, "Member 'FRewardData::StringValue' has a wrong offset!");

// ScriptStruct TimeWatch.RewardTrackTier
// 0x0018 (0x0018 - 0x0000)
struct FRewardTrackTier final
{
public:
	int32                                         PointsRequired;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRewardData>                    Rewards;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRewardTrackTier) == 0x000008, "Wrong alignment on FRewardTrackTier");
static_assert(sizeof(FRewardTrackTier) == 0x000018, "Wrong size on FRewardTrackTier");
static_assert(offsetof(FRewardTrackTier, PointsRequired) == 0x000000, "Member 'FRewardTrackTier::PointsRequired' has a wrong offset!");
static_assert(offsetof(FRewardTrackTier, Rewards) == 0x000008, "Member 'FRewardTrackTier::Rewards' has a wrong offset!");

// ScriptStruct TimeWatch.MatchResultDataResponse
// 0x0058 (0x0058 - 0x0000)
struct FMatchResultDataResponse final
{
public:
	int32                                         Xp;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Coins;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoardScore;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoardLevel;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BattlePassPoints;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRewardTrackActive;                              // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AccessStatus;                                      // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RewardTrackCurrentTier;                            // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RewardTrackPreviousTier;                           // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviousTierRequiredPoints;                        // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRewardTrackTier>               RewardTrackTiers;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         AwardedItemsSKUs;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FRewardData>                    DailyBoostClaimedRewards;                          // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMatchResultDataResponse) == 0x000008, "Wrong alignment on FMatchResultDataResponse");
static_assert(sizeof(FMatchResultDataResponse) == 0x000058, "Wrong size on FMatchResultDataResponse");
static_assert(offsetof(FMatchResultDataResponse, Xp) == 0x000000, "Member 'FMatchResultDataResponse::Xp' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, Coins) == 0x000004, "Member 'FMatchResultDataResponse::Coins' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, BoardScore) == 0x000008, "Member 'FMatchResultDataResponse::BoardScore' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, BoardLevel) == 0x00000C, "Member 'FMatchResultDataResponse::BoardLevel' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, BattlePassPoints) == 0x000010, "Member 'FMatchResultDataResponse::BattlePassPoints' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, bIsRewardTrackActive) == 0x000014, "Member 'FMatchResultDataResponse::bIsRewardTrackActive' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, AccessStatus) == 0x000018, "Member 'FMatchResultDataResponse::AccessStatus' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, RewardTrackCurrentTier) == 0x00001C, "Member 'FMatchResultDataResponse::RewardTrackCurrentTier' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, RewardTrackPreviousTier) == 0x000020, "Member 'FMatchResultDataResponse::RewardTrackPreviousTier' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, PreviousTierRequiredPoints) == 0x000024, "Member 'FMatchResultDataResponse::PreviousTierRequiredPoints' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, RewardTrackTiers) == 0x000028, "Member 'FMatchResultDataResponse::RewardTrackTiers' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, AwardedItemsSKUs) == 0x000038, "Member 'FMatchResultDataResponse::AwardedItemsSKUs' has a wrong offset!");
static_assert(offsetof(FMatchResultDataResponse, DailyBoostClaimedRewards) == 0x000048, "Member 'FMatchResultDataResponse::DailyBoostClaimedRewards' has a wrong offset!");

// ScriptStruct TimeWatch.TWAbilityInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FTWAbilityInstanceData final
{
public:
	class UTWAbilitiesComponent*                  Caster;                                            // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATimeWatchCharacter*                    OwningCharacter;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingDuration;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalExecutionTime;                                // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTWAbilityInstanceData) == 0x000008, "Wrong alignment on FTWAbilityInstanceData");
static_assert(sizeof(FTWAbilityInstanceData) == 0x000018, "Wrong size on FTWAbilityInstanceData");
static_assert(offsetof(FTWAbilityInstanceData, Caster) == 0x000000, "Member 'FTWAbilityInstanceData::Caster' has a wrong offset!");
static_assert(offsetof(FTWAbilityInstanceData, OwningCharacter) == 0x000008, "Member 'FTWAbilityInstanceData::OwningCharacter' has a wrong offset!");
static_assert(offsetof(FTWAbilityInstanceData, RemainingDuration) == 0x000010, "Member 'FTWAbilityInstanceData::RemainingDuration' has a wrong offset!");
static_assert(offsetof(FTWAbilityInstanceData, LocalExecutionTime) == 0x000014, "Member 'FTWAbilityInstanceData::LocalExecutionTime' has a wrong offset!");

// ScriptStruct TimeWatch.TeamColorConfig
// 0x0028 (0x0028 - 0x0000)
struct FTeamColorConfig final
{
public:
	TArray<struct FLinearColor>                   Colors;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bUseAlternativeColorsOnFixedColorsMode;            // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
