#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeWatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "TimeWatch_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NGDUI_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "UnrealProject_structs.hpp"
#include "UnrealProject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "NGDBackend_structs.hpp"
#include "AIModule_classes.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "NGDOnlineService_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class TimeWatch.TWItemDataAsset
// 0x0090 (0x00C0 - 0x0030)
class UTWItemDataAsset : public UDataAsset
{
public:
	TSoftObjectPtr<class UTexture2D>              RewardIcon;                                        // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   RewardType;                                        // 0x0058(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UTexture2D*                             StoreIconLarge;                                    // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             StoreIconSmall;                                    // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTWItemDataAsset*                       RootItem;                                          // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DomainSKU;                                         // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 GroupSKU;                                          // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DebugStoreState;                                   // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAvailableInOfflineMode;                           // 0x00AC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SKU;                                               // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FText GetDisplayName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWItemDataAsset">();
	}
	static class UTWItemDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWItemDataAsset>();
	}
};
static_assert(alignof(UTWItemDataAsset) == 0x000008, "Wrong alignment on UTWItemDataAsset");
static_assert(sizeof(UTWItemDataAsset) == 0x0000C0, "Wrong size on UTWItemDataAsset");
static_assert(offsetof(UTWItemDataAsset, RewardIcon) == 0x000030, "Member 'UTWItemDataAsset::RewardIcon' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, RewardType) == 0x000058, "Member 'UTWItemDataAsset::RewardType' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, StoreIconLarge) == 0x000070, "Member 'UTWItemDataAsset::StoreIconLarge' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, StoreIconSmall) == 0x000078, "Member 'UTWItemDataAsset::StoreIconSmall' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, RootItem) == 0x000080, "Member 'UTWItemDataAsset::RootItem' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, DomainSKU) == 0x000088, "Member 'UTWItemDataAsset::DomainSKU' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, GroupSKU) == 0x000098, "Member 'UTWItemDataAsset::GroupSKU' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, DebugStoreState) == 0x0000A8, "Member 'UTWItemDataAsset::DebugStoreState' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, bAvailableInOfflineMode) == 0x0000AC, "Member 'UTWItemDataAsset::bAvailableInOfflineMode' has a wrong offset!");
static_assert(offsetof(UTWItemDataAsset, SKU) == 0x0000B0, "Member 'UTWItemDataAsset::SKU' has a wrong offset!");

// Class TimeWatch.TWPlayerTitleDataAsset
// 0x0020 (0x00E0 - 0x00C0)
class UTWPlayerTitleDataAsset final : public UTWItemDataAsset
{
public:
	class FText                                   DisplayText;                                       // 0x00C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsDevTitle;                                       // 0x00D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWPlayerTitleDataAsset">();
	}
	static class UTWPlayerTitleDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWPlayerTitleDataAsset>();
	}
};
static_assert(alignof(UTWPlayerTitleDataAsset) == 0x000008, "Wrong alignment on UTWPlayerTitleDataAsset");
static_assert(sizeof(UTWPlayerTitleDataAsset) == 0x0000E0, "Wrong size on UTWPlayerTitleDataAsset");
static_assert(offsetof(UTWPlayerTitleDataAsset, DisplayText) == 0x0000C0, "Member 'UTWPlayerTitleDataAsset::DisplayText' has a wrong offset!");
static_assert(offsetof(UTWPlayerTitleDataAsset, bIsDevTitle) == 0x0000D8, "Member 'UTWPlayerTitleDataAsset::bIsDevTitle' has a wrong offset!");

// Class TimeWatch.HUDStatePlayerProfile
// 0x0000 (0x0268 - 0x0268)
class UHUDStatePlayerProfile : public UNGDHUDState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDStatePlayerProfile">();
	}
	static class UHUDStatePlayerProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDStatePlayerProfile>();
	}
};
static_assert(alignof(UHUDStatePlayerProfile) == 0x000008, "Wrong alignment on UHUDStatePlayerProfile");
static_assert(sizeof(UHUDStatePlayerProfile) == 0x000268, "Wrong size on UHUDStatePlayerProfile");

// Class TimeWatch.TWGameplayAbilityTargetActor
// 0x0060 (0x0278 - 0x0218)
class ATWGameplayAbilityTargetActor : public AActor
{
public:
	TMulticastInlineDelegate<void(const struct FTWAbilityCustomDataHandle& OutDataHandle)> OnConfirmedDelegate; // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FTWAbilityCustomDataHandle& OutDataHandle)> OnCancelledDelegate; // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bAutoDestroyOnConfirm;                             // 0x0238(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWAbility*                             OwningAbility;                                     // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTWGameplayTask*                        OwningTask;                                        // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             TargetData;                                        // 0x0250(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	class UTWAbilitiesComponent*                  CasterComp;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CancelTargeting();
	void ConfirmTargeting();
	void GenericAxisChanged(float NewValue);
	void OnGenericLocalCancel();
	void OnGenericLocalConfirm();
	void StartTargeting(class UTWAbility* Ability);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWGameplayAbilityTargetActor">();
	}
	static class ATWGameplayAbilityTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATWGameplayAbilityTargetActor>();
	}
};
static_assert(alignof(ATWGameplayAbilityTargetActor) == 0x000008, "Wrong alignment on ATWGameplayAbilityTargetActor");
static_assert(sizeof(ATWGameplayAbilityTargetActor) == 0x000278, "Wrong size on ATWGameplayAbilityTargetActor");
static_assert(offsetof(ATWGameplayAbilityTargetActor, OnConfirmedDelegate) == 0x000218, "Member 'ATWGameplayAbilityTargetActor::OnConfirmedDelegate' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, OnCancelledDelegate) == 0x000228, "Member 'ATWGameplayAbilityTargetActor::OnCancelledDelegate' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, bAutoDestroyOnConfirm) == 0x000238, "Member 'ATWGameplayAbilityTargetActor::bAutoDestroyOnConfirm' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, OwningAbility) == 0x000240, "Member 'ATWGameplayAbilityTargetActor::OwningAbility' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, OwningTask) == 0x000248, "Member 'ATWGameplayAbilityTargetActor::OwningTask' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, TargetData) == 0x000250, "Member 'ATWGameplayAbilityTargetActor::TargetData' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor, CasterComp) == 0x000270, "Member 'ATWGameplayAbilityTargetActor::CasterComp' has a wrong offset!");

// Class TimeWatch.TWGameplayAbilityTargetActor_Projectile
// 0x0030 (0x02A8 - 0x0278)
class ATWGameplayAbilityTargetActor_Projectile final : public ATWGameplayAbilityTargetActor
{
public:
	TSubclassOf<class ATWPhysicalProjectile>      ProjectileClass;                                   // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PlaceableActorMesh;                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlaceableMeshOffset;                               // 0x0288(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATemporalWeapon*                        CurrentWeapon;                                     // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaunchSpeed;                                       // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileRadius;                                  // 0x02A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWGameplayAbilityTargetActor_Projectile">();
	}
	static class ATWGameplayAbilityTargetActor_Projectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATWGameplayAbilityTargetActor_Projectile>();
	}
};
static_assert(alignof(ATWGameplayAbilityTargetActor_Projectile) == 0x000008, "Wrong alignment on ATWGameplayAbilityTargetActor_Projectile");
static_assert(sizeof(ATWGameplayAbilityTargetActor_Projectile) == 0x0002A8, "Wrong size on ATWGameplayAbilityTargetActor_Projectile");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, ProjectileClass) == 0x000278, "Member 'ATWGameplayAbilityTargetActor_Projectile::ProjectileClass' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, PlaceableActorMesh) == 0x000280, "Member 'ATWGameplayAbilityTargetActor_Projectile::PlaceableActorMesh' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, PlaceableMeshOffset) == 0x000288, "Member 'ATWGameplayAbilityTargetActor_Projectile::PlaceableMeshOffset' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, CurrentWeapon) == 0x000298, "Member 'ATWGameplayAbilityTargetActor_Projectile::CurrentWeapon' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, LaunchSpeed) == 0x0002A0, "Member 'ATWGameplayAbilityTargetActor_Projectile::LaunchSpeed' has a wrong offset!");
static_assert(offsetof(ATWGameplayAbilityTargetActor_Projectile, ProjectileRadius) == 0x0002A4, "Member 'ATWGameplayAbilityTargetActor_Projectile::ProjectileRadius' has a wrong offset!");

// Class TimeWatch.Tween
// 0x0038 (0x0060 - 0x0028)
class UTween final : public UObject
{
public:
	TMulticastInlineDelegate<void(float CurrentValue)> OnTweenTick;                                  // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnTweenFinished;                                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Tween">();
	}
	static class UTween* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTween>();
	}
};
static_assert(alignof(UTween) == 0x000008, "Wrong alignment on UTween");
static_assert(sizeof(UTween) == 0x000060, "Wrong size on UTween");
static_assert(offsetof(UTween, OnTweenTick) == 0x000028, "Member 'UTween::OnTweenTick' has a wrong offset!");
static_assert(offsetof(UTween, OnTweenFinished) == 0x000038, "Member 'UTween::OnTweenFinished' has a wrong offset!");

// Class TimeWatch.HUDStatePlaySelection
// 0x0000 (0x0268 - 0x0268)
class UHUDStatePlaySelection : public UNGDHUDState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDStatePlaySelection">();
	}
	static class UHUDStatePlaySelection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDStatePlaySelection>();
	}
};
static_assert(alignof(UHUDStatePlaySelection) == 0x000008, "Wrong alignment on UHUDStatePlaySelection");
static_assert(sizeof(UHUDStatePlaySelection) == 0x000268, "Wrong size on UHUDStatePlaySelection");

// Class TimeWatch.Actuate
// 0x0010 (0x0228 - 0x0218)
class AActuate final : public AActor
{
public:
	TArray<class UTween*>                         Tweens;                                            // 0x0218(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	class UTween* Animate(float InAnimDuration, float InInitialState, float InFinalState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Actuate">();
	}
	static class AActuate* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActuate>();
	}
};
static_assert(alignof(AActuate) == 0x000008, "Wrong alignment on AActuate");
static_assert(sizeof(AActuate) == 0x000228, "Wrong size on AActuate");
static_assert(offsetof(AActuate, Tweens) == 0x000218, "Member 'AActuate::Tweens' has a wrong offset!");

// Class TimeWatch.TWGenericPopup
// 0x0508 (0x07C8 - 0x02C0)
class UTWGenericPopup : public UNGDGenericPopup
{
public:
	class URichTextBlock*                         RichTextBlock_Title;                               // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideConfirmButttonStyle;                      // 0x02C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ConfirmButttonStyleOverride;                       // 0x02D0(0x0278)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideCancelButttonStyle;                       // 0x0548(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           CancelButttonStyleOverride;                        // 0x0550(0x0278)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWGenericPopup">();
	}
	static class UTWGenericPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWGenericPopup>();
	}
};
static_assert(alignof(UTWGenericPopup) == 0x000008, "Wrong alignment on UTWGenericPopup");
static_assert(sizeof(UTWGenericPopup) == 0x0007C8, "Wrong size on UTWGenericPopup");
static_assert(offsetof(UTWGenericPopup, RichTextBlock_Title) == 0x0002C0, "Member 'UTWGenericPopup::RichTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UTWGenericPopup, bOverrideConfirmButttonStyle) == 0x0002C8, "Member 'UTWGenericPopup::bOverrideConfirmButttonStyle' has a wrong offset!");
static_assert(offsetof(UTWGenericPopup, ConfirmButttonStyleOverride) == 0x0002D0, "Member 'UTWGenericPopup::ConfirmButttonStyleOverride' has a wrong offset!");
static_assert(offsetof(UTWGenericPopup, bOverrideCancelButttonStyle) == 0x000548, "Member 'UTWGenericPopup::bOverrideCancelButttonStyle' has a wrong offset!");
static_assert(offsetof(UTWGenericPopup, CancelButttonStyleOverride) == 0x000550, "Member 'UTWGenericPopup::CancelButttonStyleOverride' has a wrong offset!");

// Class TimeWatch.HUDStateRedeemCode
// 0x0000 (0x0268 - 0x0268)
class UHUDStateRedeemCode : public UNGDHUDState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDStateRedeemCode">();
	}
	static class UHUDStateRedeemCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDStateRedeemCode>();
	}
};
static_assert(alignof(UHUDStateRedeemCode) == 0x000008, "Wrong alignment on UHUDStateRedeemCode");
static_assert(sizeof(UHUDStateRedeemCode) == 0x000268, "Wrong size on UHUDStateRedeemCode");

// Class TimeWatch.TWChallengeRuleData
// 0x0018 (0x0048 - 0x0030)
class UTWChallengeRuleData final : public UDataAsset
{
public:
	struct FTWChallengeRule                       Rule;                                              // 0x0030(0x0014)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWChallengeRuleData">();
	}
	static class UTWChallengeRuleData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWChallengeRuleData>();
	}
};
static_assert(alignof(UTWChallengeRuleData) == 0x000008, "Wrong alignment on UTWChallengeRuleData");
static_assert(sizeof(UTWChallengeRuleData) == 0x000048, "Wrong size on UTWChallengeRuleData");
static_assert(offsetof(UTWChallengeRuleData, Rule) == 0x000030, "Member 'UTWChallengeRuleData::Rule' has a wrong offset!");

// Class TimeWatch.AutomaticTurretBase
// 0x0030 (0x0248 - 0x0218)
class AAutomaticTurretBase final : public AActor
{
public:
	class USceneComponent*                        MuzzleLocation;                                    // 0x0218(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                          ShootTriggerArea;                                  // 0x0220(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class ATimeWatchProjectile>       ProjectileClass;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootCooldown;                                     // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    CurrentTarget;                                     // 0x0238(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentCooldown;                                   // 0x0240(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnShootTriggerOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnShootTriggerOverlapEnd(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

	float GetRelativeCooldown() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomaticTurretBase">();
	}
	static class AAutomaticTurretBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutomaticTurretBase>();
	}
};
static_assert(alignof(AAutomaticTurretBase) == 0x000008, "Wrong alignment on AAutomaticTurretBase");
static_assert(sizeof(AAutomaticTurretBase) == 0x000248, "Wrong size on AAutomaticTurretBase");
static_assert(offsetof(AAutomaticTurretBase, MuzzleLocation) == 0x000218, "Member 'AAutomaticTurretBase::MuzzleLocation' has a wrong offset!");
static_assert(offsetof(AAutomaticTurretBase, ShootTriggerArea) == 0x000220, "Member 'AAutomaticTurretBase::ShootTriggerArea' has a wrong offset!");
static_assert(offsetof(AAutomaticTurretBase, ProjectileClass) == 0x000228, "Member 'AAutomaticTurretBase::ProjectileClass' has a wrong offset!");
static_assert(offsetof(AAutomaticTurretBase, ShootCooldown) == 0x000230, "Member 'AAutomaticTurretBase::ShootCooldown' has a wrong offset!");
static_assert(offsetof(AAutomaticTurretBase, CurrentTarget) == 0x000238, "Member 'AAutomaticTurretBase::CurrentTarget' has a wrong offset!");
static_assert(offsetof(AAutomaticTurretBase, CurrentCooldown) == 0x000240, "Member 'AAutomaticTurretBase::CurrentCooldown' has a wrong offset!");

// Class TimeWatch.HUDStateRewardTrack
// 0x0000 (0x0268 - 0x0268)
class UHUDStateRewardTrack : public UNGDHUDState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HUDStateRewardTrack">();
	}
	static class UHUDStateRewardTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDStateRewardTrack>();
	}
};
static_assert(alignof(UHUDStateRewardTrack) == 0x000008, "Wrong alignment on UHUDStateRewardTrack");
static_assert(sizeof(UHUDStateRewardTrack) == 0x000268, "Wrong size on UHUDStateRewardTrack");

// Class TimeWatch.TimeWatchGameModeBase
// 0x0048 (0x03F8 - 0x03B0)
class ATimeWatchGameModeBase : public ANGDGameMode
{
public:
	TSubclassOf<class ATimeWatchCharacter>        TWCharacterClass;                                  // 0x03B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFluxCloneController>       CloneController;                                   // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFluxAIController>          FluxAIControllerClass;                             // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x10];                                     // 0x03C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GameEndedAutoCloseSeconds;                         // 0x03D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DC[0x1C];                                     // 0x03DC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSeamlessTravelPlayerReady(class AFluxPlayerController* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimeWatchGameModeBase">();
	}
	static class ATimeWatchGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATimeWatchGameModeBase>();
	}
};
static_assert(alignof(ATimeWatchGameModeBase) == 0x000008, "Wrong alignment on ATimeWatchGameModeBase");
static_assert(sizeof(ATimeWatchGameModeBase) == 0x0003F8, "Wrong size on ATimeWatchGameModeBase");
static_assert(offsetof(ATimeWatchGameModeBase, TWCharacterClass) == 0x0003B0, "Member 'ATimeWatchGameModeBase::TWCharacterClass' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameModeBase, CloneController) == 0x0003B8, "Member 'ATimeWatchGameModeBase::CloneController' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameModeBase, FluxAIControllerClass) == 0x0003C0, "Member 'ATimeWatchGameModeBase::FluxAIControllerClass' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameModeBase, GameEndedAutoCloseSeconds) == 0x0003D8, "Member 'ATimeWatchGameModeBase::GameEndedAutoCloseSeconds' has a wrong offset!");

// Class TimeWatch.TimeWatchGameMode
// 0x0078 (0x0470 - 0x03F8)
class ATimeWatchGameMode : public ATimeWatchGameModeBase
{
public:
	uint8                                         Pad_3F8[0xC];                                      // 0x03F8(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopCooldown;                                      // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CloneCooldown;                                     // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GameCooldown;                                      // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UTimeWatchEvent>, struct FTWEventGameData> TWEventsGameData;              // 0x0410(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_460[0x10];                                     // 0x0460(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetScoreIncrement();
	void MatchResultUpdateCompleted(const class FString& MatchResultJsonString, bool bWasSuccessful, const class FString& ErrorString);
	void OnGameReadyCoolDownCompleted();
	void ProcessTWEvent(class UTimeWatchEvent* Event);
	void SetupNewPlayer(class APlayerController* NewPlayer);
	void SwitchToSpectatorMode(class APlayerController* Player);

	int32 GetScoringTeamID() const;
	class ATimeWatchGameState* GetTWGameState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimeWatchGameMode">();
	}
	static class ATimeWatchGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATimeWatchGameMode>();
	}
};
static_assert(alignof(ATimeWatchGameMode) == 0x000008, "Wrong alignment on ATimeWatchGameMode");
static_assert(sizeof(ATimeWatchGameMode) == 0x000470, "Wrong size on ATimeWatchGameMode");
static_assert(offsetof(ATimeWatchGameMode, LoopCooldown) == 0x000404, "Member 'ATimeWatchGameMode::LoopCooldown' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameMode, CloneCooldown) == 0x000408, "Member 'ATimeWatchGameMode::CloneCooldown' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameMode, GameCooldown) == 0x00040C, "Member 'ATimeWatchGameMode::GameCooldown' has a wrong offset!");
static_assert(offsetof(ATimeWatchGameMode, TWEventsGameData) == 0x000410, "Member 'ATimeWatchGameMode::TWEventsGameData' has a wrong offset!");

// Class TimeWatch.BenchmarkGameMode
// 0x0000 (0x0470 - 0x0470)
class ABenchmarkGameMode final : public ATimeWatchGameMode
{
public:
	void BenchMarkEnd();
	void BenchMarkStart();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BenchmarkGameMode">();
	}
	static class ABenchmarkGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABenchmarkGameMode>();
	}
};
static_assert(alignof(ABenchmarkGameMode) == 0x000008, "Wrong alignment on ABenchmarkGameMode");
static_assert(sizeof(ABenchmarkGameMode) == 0x000470, "Wrong size on ABenchmarkGameMode");

// Class TimeWatch.TWGameplayAbilitySystem
// 0x0098 (0x0148 - 0x00B0)
class UTWGameplayAbilitySystem final : public UActorComponent
{
public:
	TArray<struct FTWAbilityCustomDataHandle>     ExecutionHistory;                                  // 0x00B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UTWAbility*>                     AbilitiesInstances;                                // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UTWAbility*>                     AbilitiesToRestore;                                // 0x00D0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UTWAbility*>                     PendingAbilitiesInstances;                         // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ATimeWatchCharacter*, struct FAbilityCastTimestamp> LastCastTimestamp;                // 0x00F8(0x0050)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static struct FTWAbilityCustomDataHandle AbilityCustomDataFromTargetActors(const TArray<class AActor*>& TargetActors);
	static struct FTWAbilityCustomDataHandle AbilityCustomDataFromVectors(const TArray<struct FVector>& InVectors);
	static bool CopyDataToHandle_TargetActors(struct FTWAbilityCustomDataHandle& InDataHandle, struct FTWAbilityCustomDataHandle* OutDataHandle, const struct FTWAbilityCustomData_TargetActors& InData);
	static bool CopyDataToHandle_Vectors(struct FTWAbilityCustomDataHandle& InDataHandle, struct FTWAbilityCustomDataHandle* OutDataHandle, const struct FTWAbilityCustomData_Vectors& InData);
	static bool GetDataCopyFromHandle_TargetActors(const struct FTWAbilityCustomDataHandle& InDataHandle, TArray<struct FTWAbilityCustomData_TargetActors>* OutData);
	static bool GetDataCopyFromHandle_Vectors(const struct FTWAbilityCustomDataHandle& InDataHandle, TArray<struct FTWAbilityCustomData_Vectors>* OutData);
	static bool ShouldTriggerLogic(class UTWGameplayAbilitySystem* TWAbilitySystem, class ATimeWatchCharacter* CasterAvatar, const struct FTWAbilityCustomDataHandle& AbilityDataHandle);

	struct FTWAbilityExecutionData GetAbilityExecutionData(const struct FTWAbilityCustomDataHandle& AbilityDataHandle) const;
	TArray<class AActor*> GetAbilityTargets(const struct FTWAbilityCustomDataHandle& AbilityDataHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWGameplayAbilitySystem">();
	}
	static class UTWGameplayAbilitySystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWGameplayAbilitySystem>();
	}
};
static_assert(alignof(UTWGameplayAbilitySystem) == 0x000008, "Wrong alignment on UTWGameplayAbilitySystem");
static_assert(sizeof(UTWGameplayAbilitySystem) == 0x000148, "Wrong size on UTWGameplayAbilitySystem");
static_assert(offsetof(UTWGameplayAbilitySystem, ExecutionHistory) == 0x0000B0, "Member 'UTWGameplayAbilitySystem::ExecutionHistory' has a wrong offset!");
static_assert(offsetof(UTWGameplayAbilitySystem, AbilitiesInstances) == 0x0000C0, "Member 'UTWGameplayAbilitySystem::AbilitiesInstances' has a wrong offset!");
static_assert(offsetof(UTWGameplayAbilitySystem, AbilitiesToRestore) == 0x0000D0, "Member 'UTWGameplayAbilitySystem::AbilitiesToRestore' has a wrong offset!");
static_assert(offsetof(UTWGameplayAbilitySystem, PendingAbilitiesInstances) == 0x0000E0, "Member 'UTWGameplayAbilitySystem::PendingAbilitiesInstances' has a wrong offset!");
static_assert(offsetof(UTWGameplayAbilitySystem, LastCastTimestamp) == 0x0000F8, "Member 'UTWGameplayAbilitySystem::LastCastTimestamp' has a wrong offset!");

// Class TimeWatch.CameraTransitionPoint
// 0x0008 (0x0220 - 0x0218)
class ACameraTransitionPoint final : public AActor
{
public:
	int32                                         TeamId;                                            // 0x0218(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraPointType                              CameraPointType;                                   // 0x021C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraTransitionPoint">();
	}
	static class ACameraTransitionPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraTransitionPoint>();
	}
};
static_assert(alignof(ACameraTransitionPoint) == 0x000008, "Wrong alignment on ACameraTransitionPoint");
static_assert(sizeof(ACameraTransitionPoint) == 0x000220, "Wrong size on ACameraTransitionPoint");
static_assert(offsetof(ACameraTransitionPoint, TeamId) == 0x000218, "Member 'ACameraTransitionPoint::TeamId' has a wrong offset!");
static_assert(offsetof(ACameraTransitionPoint, CameraPointType) == 0x00021C, "Member 'ACameraTransitionPoint::CameraPointType' has a wrong offset!");

// Class TimeWatch.CaptureGameMode
// 0x0008 (0x0478 - 0x0470)
class ACaptureGameMode final : public ATimeWatchGameMode
{
public:
	class AScoreAreaVolume*                       ScoreArea;                                         // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CaptureGameMode">();
	}
	static class ACaptureGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureGameMode>();
	}
};
static_assert(alignof(ACaptureGameMode) == 0x000008, "Wrong alignment on ACaptureGameMode");
static_assert(sizeof(ACaptureGameMode) == 0x000478, "Wrong size on ACaptureGameMode");
static_assert(offsetof(ACaptureGameMode, ScoreArea) == 0x000470, "Member 'ACaptureGameMode::ScoreArea' has a wrong offset!");

// Class TimeWatch.TWChallengeDetailWidget
// 0x0050 (0x0288 - 0x0238)
class UTWChallengeDetailWidget final : public UUserWidgetBase
{
public:
	class UScaleBox*                              ScaleBox_NoCounterBox;                             // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVerticalBox*                           VerticalBox_CounterBox;                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_NoCounterChallengeDescription;           // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_CounterChallengeDescription;             // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOverlay*                               Overlay_StatusActive;                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOverlay*                               Overlay_StatusCompleted;                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_Counter;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_Separator;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_MaxCounter;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTWChallengeEvent*                      ChallengeEvent;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWChallengeDetailWidget">();
	}
	static class UTWChallengeDetailWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWChallengeDetailWidget>();
	}
};
static_assert(alignof(UTWChallengeDetailWidget) == 0x000008, "Wrong alignment on UTWChallengeDetailWidget");
static_assert(sizeof(UTWChallengeDetailWidget) == 0x000288, "Wrong size on UTWChallengeDetailWidget");
static_assert(offsetof(UTWChallengeDetailWidget, ScaleBox_NoCounterBox) == 0x000238, "Member 'UTWChallengeDetailWidget::ScaleBox_NoCounterBox' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, VerticalBox_CounterBox) == 0x000240, "Member 'UTWChallengeDetailWidget::VerticalBox_CounterBox' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, TextBlock_NoCounterChallengeDescription) == 0x000248, "Member 'UTWChallengeDetailWidget::TextBlock_NoCounterChallengeDescription' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, TextBlock_CounterChallengeDescription) == 0x000250, "Member 'UTWChallengeDetailWidget::TextBlock_CounterChallengeDescription' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, Overlay_StatusActive) == 0x000258, "Member 'UTWChallengeDetailWidget::Overlay_StatusActive' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, Overlay_StatusCompleted) == 0x000260, "Member 'UTWChallengeDetailWidget::Overlay_StatusCompleted' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, TextBlock_Counter) == 0x000268, "Member 'UTWChallengeDetailWidget::TextBlock_Counter' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, TextBlock_Separator) == 0x000270, "Member 'UTWChallengeDetailWidget::TextBlock_Separator' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, TextBlock_MaxCounter) == 0x000278, "Member 'UTWChallengeDetailWidget::TextBlock_MaxCounter' has a wrong offset!");
static_assert(offsetof(UTWChallengeDetailWidget, ChallengeEvent) == 0x000280, "Member 'UTWChallengeDetailWidget::ChallengeEvent' has a wrong offset!");

// Class TimeWatch.TimeWatchHUD
// 0x0188 (0x0528 - 0x03A0)
class ATimeWatchHUD : public ANGDLayeredHUD
{
public:
	class UNGDAkComponent*                        NGDAk_ScoreSounds;                                 // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNGDAkComponent*                        NGDAk_ClockSounds;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNGDSoundConfig                        ClockTickSoundConfig;                              // 0x03B0(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNGDSoundConfig                        ClockFinalSoundConfig;                             // 0x0408(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNGDSoundConfig                        AllyScoreSoundConfig;                              // 0x0460(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNGDSoundConfig                        EnemyScoreSoundConfig;                             // 0x04B8(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_510[0x10];                                     // 0x0510(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bWasTWHUDInitialized;                              // 0x0520(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRematchData                           RematchData;                                       // 0x0521(0x0003)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanTWADSEvents();
	void CloseChat();
	TSubclassOf<class UNGDCrosshairWidget> GetCrosshairClass();
	class UNGDCrosshairWidget* GetCrosshairWidget();
	void HideTWCrossHair();
	void InitializeTWHUD();
	void OnChatMessagePostRequested(const class FText& TextMessage, EChatChannel Channel);
	void OnEnemyKilled(class ATimeWatchCharacter* Victim);
	void OnHittingCharacter(class AActor* InHittedActor, class FName InHittedBone, bool bIsMeleeHit);
	void OnPlayerHit(const struct FVector& HitDirection, const bool IsCritical);
	void OnStateChanged(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState);
	void OnStatePresented(class UNGDHUDState* PresentedState);
	void OnTeamScoredPoint(int32 TeamId);
	void OnTWExplosion(class AActor* InOwner);
	void OnVictoryConditionReached();
	void OpenChat();
	void PushGameEndScreen();
	void PushMatchResultsScreen();
	void RefreshChatStatus();
	void RefreshCrosshairColor();
	void RegisterTWADSEvents(class ATimeWatchCharacter* TWCharacter);
	void SetCrosshair(TSubclassOf<class UNGDCrosshairWidget> WeaponCrosshairClass);
	void SetOthersWantsRematch(bool bOtherWantsRematch);
	void ShowMatchResults();
	void ShowTWCrossHair();
	void VoidRematch();

	class ATemporalWeapon* GetCurrentWeapon() const;
	class ATimeWatchCharacter* GetTWCharacter() const;
	class ATimeWatchGameState* GetTWGameState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TimeWatchHUD">();
	}
	static class ATimeWatchHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATimeWatchHUD>();
	}
};
static_assert(alignof(ATimeWatchHUD) == 0x000008, "Wrong alignment on ATimeWatchHUD");
static_assert(sizeof(ATimeWatchHUD) == 0x000528, "Wrong size on ATimeWatchHUD");
static_assert(offsetof(ATimeWatchHUD, NGDAk_ScoreSounds) == 0x0003A0, "Member 'ATimeWatchHUD::NGDAk_ScoreSounds' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, NGDAk_ClockSounds) == 0x0003A8, "Member 'ATimeWatchHUD::NGDAk_ClockSounds' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, ClockTickSoundConfig) == 0x0003B0, "Member 'ATimeWatchHUD::ClockTickSoundConfig' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, ClockFinalSoundConfig) == 0x000408, "Member 'ATimeWatchHUD::ClockFinalSoundConfig' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, AllyScoreSoundConfig) == 0x000460, "Member 'ATimeWatchHUD::AllyScoreSoundConfig' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, EnemyScoreSoundConfig) == 0x0004B8, "Member 'ATimeWatchHUD::EnemyScoreSoundConfig' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, bWasTWHUDInitialized) == 0x000520, "Member 'ATimeWatchHUD::bWasTWHUDInitialized' has a wrong offset!");
static_assert(offsetof(ATimeWatchHUD, RematchData) == 0x000521, "Member 'ATimeWatchHUD::RematchData' has a wrong offset!");

// Class TimeWatch.CaptureHUD
// 0x0000 (0x0528 - 0x0528)
class ACaptureHUD final : public ATimeWatchHUD
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CaptureHUD">();
	}
	static class ACaptureHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureHUD>();
	}
};
static_assert(alignof(ACaptureHUD) == 0x000008, "Wrong alignment on ACaptureHUD");
static_assert(sizeof(ACaptureHUD) == 0x000528, "Wrong size on ACaptureHUD");

// Class TimeWatch.ChatWidget
// 0x0100 (0x0338 - 0x0238)
class UChatWidget final : public UUserWidgetBase
{
public:
	uint8                                         Pad_238[0x20];                                     // 0x0238(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NotificationsLifeSpan;                             // 0x0258(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HideSequenceDelay;                                 // 0x025C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EChatChannel, struct FChatChannelUIConfig> ChannelsUIConfig;                                // 0x0260(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       EditableTextBox_Message;                           // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TextBlock_ChannelTag;                              // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VerticalBox_Log;                                   // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Log;                                     // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_InputBox;                                   // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Border_Background;                                 // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNotificationWidget*>            NotificationsHistory;                              // 0x02E0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UNotificationWidget*>            NotificationsToHide;                               // 0x02F0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNotificationWidget>        AllWidgetClass;                                    // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNotificationWidget>        TeamWidgetClass;                                   // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x18];                                     // 0x0310(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChatChannel>                          AvailableChannels;                                 // 0x0328(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void OnChatClosed();
	void OnChatOpened();
	void OnMessageEntered(const class FText& Text, ETextCommit CommitMethod);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatWidget">();
	}
	static class UChatWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatWidget>();
	}
};
static_assert(alignof(UChatWidget) == 0x000008, "Wrong alignment on UChatWidget");
static_assert(sizeof(UChatWidget) == 0x000338, "Wrong size on UChatWidget");
static_assert(offsetof(UChatWidget, NotificationsLifeSpan) == 0x000258, "Member 'UChatWidget::NotificationsLifeSpan' has a wrong offset!");
static_assert(offsetof(UChatWidget, HideSequenceDelay) == 0x00025C, "Member 'UChatWidget::HideSequenceDelay' has a wrong offset!");
static_assert(offsetof(UChatWidget, ChannelsUIConfig) == 0x000260, "Member 'UChatWidget::ChannelsUIConfig' has a wrong offset!");
static_assert(offsetof(UChatWidget, EditableTextBox_Message) == 0x0002B0, "Member 'UChatWidget::EditableTextBox_Message' has a wrong offset!");
static_assert(offsetof(UChatWidget, TextBlock_ChannelTag) == 0x0002B8, "Member 'UChatWidget::TextBlock_ChannelTag' has a wrong offset!");
static_assert(offsetof(UChatWidget, VerticalBox_Log) == 0x0002C0, "Member 'UChatWidget::VerticalBox_Log' has a wrong offset!");
static_assert(offsetof(UChatWidget, ScrollBox_Log) == 0x0002C8, "Member 'UChatWidget::ScrollBox_Log' has a wrong offset!");
static_assert(offsetof(UChatWidget, Border_InputBox) == 0x0002D0, "Member 'UChatWidget::Border_InputBox' has a wrong offset!");
static_assert(offsetof(UChatWidget, Border_Background) == 0x0002D8, "Member 'UChatWidget::Border_Background' has a wrong offset!");
static_assert(offsetof(UChatWidget, NotificationsHistory) == 0x0002E0, "Member 'UChatWidget::NotificationsHistory' has a wrong offset!");
static_assert(offsetof(UChatWidget, NotificationsToHide) == 0x0002F0, "Member 'UChatWidget::NotificationsToHide' has a wrong offset!");
static_assert(offsetof(UChatWidget, AllWidgetClass) == 0x000300, "Member 'UChatWidget::AllWidgetClass' has a wrong offset!");
static_assert(offsetof(UChatWidget, TeamWidgetClass) == 0x000308, "Member 'UChatWidget::TeamWidgetClass' has a wrong offset!");
static_assert(offsetof(UChatWidget, AvailableChannels) == 0x000328, "Member 'UChatWidget::AvailableChannels' has a wrong offset!");

// Class TimeWatch.DailyBoostItemWidget
// 0x0010 (0x0290 - 0x0280)
class UDailyBoostItemWidget : public UNGDUserWidget
{
public:
	class UTexture2D*                             ItemCompletedImage;                                // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             ItemIncompletedImage;                              // 0x0288(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetIsItemCompleted(bool IsCompleted, const struct FLinearColor& WidgetColor);
	void SetItemInfo(const class FString& ItemInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DailyBoostItemWidget">();
	}
	static class UDailyBoostItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyBoostItemWidget>();
	}
};
static_assert(alignof(UDailyBoostItemWidget) == 0x000008, "Wrong alignment on UDailyBoostItemWidget");
static_assert(sizeof(UDailyBoostItemWidget) == 0x000290, "Wrong size on UDailyBoostItemWidget");
static_assert(offsetof(UDailyBoostItemWidget, ItemCompletedImage) == 0x000280, "Member 'UDailyBoostItemWidget::ItemCompletedImage' has a wrong offset!");
static_assert(offsetof(UDailyBoostItemWidget, ItemIncompletedImage) == 0x000288, "Member 'UDailyBoostItemWidget::ItemIncompletedImage' has a wrong offset!");

// Class TimeWatch.TWChallengeObserver
// 0x0060 (0x0110 - 0x00B0)
class UTWChallengeObserver final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTWChallengeEvent*>              ActiveChallenges;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTWChallengeEvent*>              CompletedChallenges;                               // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTWChallengeEvent* ChallengeEvent)> OnChallengeCompleteDelegate; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTWChallengeEventData* ChallengeEventData)> OnChallengeDataLoadComplete; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTWChallengeEventData* ChallengeEventData)> OnChallengeDataUnloadComplete; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	void LoadChallenges(class UTWChallengeEventData* DataAssetChallenge, const TArray<struct FTWChallengeEventInfo>& NonDataAssetChallenge);
	void OnChallengeProgress(class UTWChallengeEvent* ChallengeEvent, const struct FTWChallengeRule& Rule);
	void UnloadChallenges(class UTWChallengeEventData* DataAssetChallenge, const TArray<struct FTWChallengeEventInfo>& NonDataAssetChallenge);
	void UpdateChallenge(class FName RuleName, int32 RuleCount, bool bDeleteOnCompleted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TWChallengeObserver">();
	}
	static class UTWChallengeObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWChallengeObserver>();
	}
};
static_assert(alignof(UTWChallengeObserver) == 0x000008, "Wrong alignment on UTWChallengeObserver");
static_assert(sizeof(UTWChallengeObserver) == 0x000110, "Wrong size on UTWChallengeObserver");
static_assert(offsetof(UTWChallengeObserver, ActiveChallenges) == 0x0000C0, "Member 'UTWChallengeObserver::ActiveChallenges' has a wrong offset!");
static_assert(offsetof(UTWChallengeObserver, CompletedChallenges) == 0x0000D0, "Member 'UTWChallengeObserver::CompletedChallenges' has a wrong offset!");
static_assert(offsetof(UTWChallengeObserver, OnChallengeCompleteDelegate) == 0x0000E0, "Member 'UTWChallengeObserver::OnChallengeCompleteDelegate' has a wrong offset!");
static_assert(offsetof(UTWChallengeObserver, OnChallengeDataLoadComplete) == 0x0000F0, "Member 'UTWChallengeObserver::OnChallengeDataLoadComplete' has a wrong offset!");
static_assert(offsetof(UTWChallengeObserver, OnChallengeDataUnloadComplete) == 0x000100, "Member 'UTWChallengeObserver::OnChallengeDataUnloadComplete' has a wrong offset!");

// Class TimeWatch.DeathMatchGameMode
// 0x0000 (0x0470 - 0x0470)
class ADeathMatchGameMode final : public ATimeWatchGameMode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeathMatchGameMode">();
	}
	static class ADeathMatchGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeathMatchGameMode>();
	}
};
static_assert(alignof(ADeathMatchGameMode) == 0x000008, "Wrong alignment on ADeathMatchGameMode");
