#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeWatchGameInstanceBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function TimeWatchGameInstanceBP.TimeWatchGameInstanceBP_C.ExecuteUbergraph_TimeWatchGameInstanceBP
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartSession_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP) == 0x000004, "Wrong alignment on TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP");
static_assert(sizeof(TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP) == 0x000008, "Wrong size on TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP");
static_assert(offsetof(TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP, EntryPoint) == 0x000000, "Member 'TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP, CallFunc_StartSession_ReturnValue) == 0x000004, "Member 'TimeWatchGameInstanceBP_C_ExecuteUbergraph_TimeWatchGameInstanceBP::CallFunc_StartSession_ReturnValue' has a wrong offset!");

// Function TimeWatchGameInstanceBP.TimeWatchGameInstanceBP_C.UpdateAudioVolume
// 0x0010 (0x0010 - 0x0000)
struct TimeWatchGameInstanceBP_C_UpdateAudioVolume final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatCVar_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_1;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_2;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimeWatchGameInstanceBP_C_UpdateAudioVolume) == 0x000004, "Wrong alignment on TimeWatchGameInstanceBP_C_UpdateAudioVolume");
static_assert(sizeof(TimeWatchGameInstanceBP_C_UpdateAudioVolume) == 0x000010, "Wrong size on TimeWatchGameInstanceBP_C_UpdateAudioVolume");
static_assert(offsetof(TimeWatchGameInstanceBP_C_UpdateAudioVolume, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'TimeWatchGameInstanceBP_C_UpdateAudioVolume::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeWatchGameInstanceBP_C_UpdateAudioVolume, CallFunc_GetFloatCVar_ReturnValue) == 0x000004, "Member 'TimeWatchGameInstanceBP_C_UpdateAudioVolume::CallFunc_GetFloatCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimeWatchGameInstanceBP_C_UpdateAudioVolume, CallFunc_GetFloatCVar_ReturnValue_1) == 0x000008, "Member 'TimeWatchGameInstanceBP_C_UpdateAudioVolume::CallFunc_GetFloatCVar_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TimeWatchGameInstanceBP_C_UpdateAudioVolume, CallFunc_GetFloatCVar_ReturnValue_2) == 0x00000C, "Member 'TimeWatchGameInstanceBP_C_UpdateAudioVolume::CallFunc_GetFloatCVar_ReturnValue_2' has a wrong offset!");

}

