#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeWatch

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "TimeWatch_structs.hpp"
#include "Engine_structs.hpp"
#include "NGDOnlineService_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "NGDBackend_structs.hpp"
#include "UnrealProject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TimeWatch.TWItemDataAsset.GetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct TWItemDataAsset_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWItemDataAsset_GetDisplayName) == 0x000008, "Wrong alignment on TWItemDataAsset_GetDisplayName");
static_assert(sizeof(TWItemDataAsset_GetDisplayName) == 0x000018, "Wrong size on TWItemDataAsset_GetDisplayName");
static_assert(offsetof(TWItemDataAsset_GetDisplayName, ReturnValue) == 0x000000, "Member 'TWItemDataAsset_GetDisplayName::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilityTargetActor.GenericAxisChanged
// 0x0004 (0x0004 - 0x0000)
struct TWGameplayAbilityTargetActor_GenericAxisChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilityTargetActor_GenericAxisChanged) == 0x000004, "Wrong alignment on TWGameplayAbilityTargetActor_GenericAxisChanged");
static_assert(sizeof(TWGameplayAbilityTargetActor_GenericAxisChanged) == 0x000004, "Wrong size on TWGameplayAbilityTargetActor_GenericAxisChanged");
static_assert(offsetof(TWGameplayAbilityTargetActor_GenericAxisChanged, NewValue) == 0x000000, "Member 'TWGameplayAbilityTargetActor_GenericAxisChanged::NewValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilityTargetActor.StartTargeting
// 0x0008 (0x0008 - 0x0000)
struct TWGameplayAbilityTargetActor_StartTargeting final
{
public:
	class UTWAbility*                             Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilityTargetActor_StartTargeting) == 0x000008, "Wrong alignment on TWGameplayAbilityTargetActor_StartTargeting");
static_assert(sizeof(TWGameplayAbilityTargetActor_StartTargeting) == 0x000008, "Wrong size on TWGameplayAbilityTargetActor_StartTargeting");
static_assert(offsetof(TWGameplayAbilityTargetActor_StartTargeting, Ability) == 0x000000, "Member 'TWGameplayAbilityTargetActor_StartTargeting::Ability' has a wrong offset!");

// Function TimeWatch.Actuate.Animate
// 0x0018 (0x0018 - 0x0000)
struct Actuate_Animate final
{
public:
	float                                         InAnimDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InInitialState;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFinalState;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTween*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Actuate_Animate) == 0x000008, "Wrong alignment on Actuate_Animate");
static_assert(sizeof(Actuate_Animate) == 0x000018, "Wrong size on Actuate_Animate");
static_assert(offsetof(Actuate_Animate, InAnimDuration) == 0x000000, "Member 'Actuate_Animate::InAnimDuration' has a wrong offset!");
static_assert(offsetof(Actuate_Animate, InInitialState) == 0x000004, "Member 'Actuate_Animate::InInitialState' has a wrong offset!");
static_assert(offsetof(Actuate_Animate, InFinalState) == 0x000008, "Member 'Actuate_Animate::InFinalState' has a wrong offset!");
static_assert(offsetof(Actuate_Animate, ReturnValue) == 0x000010, "Member 'Actuate_Animate::ReturnValue' has a wrong offset!");

// Function TimeWatch.AutomaticTurretBase.OnShootTriggerOverlapBegin
// 0x00A8 (0x00A8 - 0x0000)
struct AutomaticTurretBase_OnShootTriggerOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutomaticTurretBase_OnShootTriggerOverlapBegin) == 0x000008, "Wrong alignment on AutomaticTurretBase_OnShootTriggerOverlapBegin");
static_assert(sizeof(AutomaticTurretBase_OnShootTriggerOverlapBegin) == 0x0000A8, "Wrong size on AutomaticTurretBase_OnShootTriggerOverlapBegin");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, OverlappedComp) == 0x000000, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::OverlappedComp' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, OtherActor) == 0x000008, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::OtherActor' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, OtherComp) == 0x000010, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::OtherComp' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, OtherBodyIndex) == 0x000018, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, bFromSweep) == 0x00001C, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::bFromSweep' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapBegin, SweepResult) == 0x000020, "Member 'AutomaticTurretBase_OnShootTriggerOverlapBegin::SweepResult' has a wrong offset!");

// Function TimeWatch.AutomaticTurretBase.OnShootTriggerOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct AutomaticTurretBase_OnShootTriggerOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutomaticTurretBase_OnShootTriggerOverlapEnd) == 0x000008, "Wrong alignment on AutomaticTurretBase_OnShootTriggerOverlapEnd");
static_assert(sizeof(AutomaticTurretBase_OnShootTriggerOverlapEnd) == 0x000020, "Wrong size on AutomaticTurretBase_OnShootTriggerOverlapEnd");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapEnd, OverlappedComp) == 0x000000, "Member 'AutomaticTurretBase_OnShootTriggerOverlapEnd::OverlappedComp' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapEnd, OtherActor) == 0x000008, "Member 'AutomaticTurretBase_OnShootTriggerOverlapEnd::OtherActor' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapEnd, OtherComp) == 0x000010, "Member 'AutomaticTurretBase_OnShootTriggerOverlapEnd::OtherComp' has a wrong offset!");
static_assert(offsetof(AutomaticTurretBase_OnShootTriggerOverlapEnd, OtherBodyIndex) == 0x000018, "Member 'AutomaticTurretBase_OnShootTriggerOverlapEnd::OtherBodyIndex' has a wrong offset!");

// Function TimeWatch.AutomaticTurretBase.GetRelativeCooldown
// 0x0004 (0x0004 - 0x0000)
struct AutomaticTurretBase_GetRelativeCooldown final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutomaticTurretBase_GetRelativeCooldown) == 0x000004, "Wrong alignment on AutomaticTurretBase_GetRelativeCooldown");
static_assert(sizeof(AutomaticTurretBase_GetRelativeCooldown) == 0x000004, "Wrong size on AutomaticTurretBase_GetRelativeCooldown");
static_assert(offsetof(AutomaticTurretBase_GetRelativeCooldown, ReturnValue) == 0x000000, "Member 'AutomaticTurretBase_GetRelativeCooldown::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchGameModeBase.OnSeamlessTravelPlayerReady
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameModeBase_OnSeamlessTravelPlayerReady final
{
public:
	class AFluxPlayerController*                  Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameModeBase_OnSeamlessTravelPlayerReady) == 0x000008, "Wrong alignment on TimeWatchGameModeBase_OnSeamlessTravelPlayerReady");
static_assert(sizeof(TimeWatchGameModeBase_OnSeamlessTravelPlayerReady) == 0x000008, "Wrong size on TimeWatchGameModeBase_OnSeamlessTravelPlayerReady");
static_assert(offsetof(TimeWatchGameModeBase_OnSeamlessTravelPlayerReady, Player) == 0x000000, "Member 'TimeWatchGameModeBase_OnSeamlessTravelPlayerReady::Player' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.GetScoreIncrement
// 0x0004 (0x0004 - 0x0000)
struct TimeWatchGameMode_GetScoreIncrement final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_GetScoreIncrement) == 0x000004, "Wrong alignment on TimeWatchGameMode_GetScoreIncrement");
static_assert(sizeof(TimeWatchGameMode_GetScoreIncrement) == 0x000004, "Wrong size on TimeWatchGameMode_GetScoreIncrement");
static_assert(offsetof(TimeWatchGameMode_GetScoreIncrement, ReturnValue) == 0x000000, "Member 'TimeWatchGameMode_GetScoreIncrement::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.MatchResultUpdateCompleted
// 0x0028 (0x0028 - 0x0000)
struct TimeWatchGameMode_MatchResultUpdateCompleted final
{
public:
	class FString                                 MatchResultJsonString;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorString;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_MatchResultUpdateCompleted) == 0x000008, "Wrong alignment on TimeWatchGameMode_MatchResultUpdateCompleted");
static_assert(sizeof(TimeWatchGameMode_MatchResultUpdateCompleted) == 0x000028, "Wrong size on TimeWatchGameMode_MatchResultUpdateCompleted");
static_assert(offsetof(TimeWatchGameMode_MatchResultUpdateCompleted, MatchResultJsonString) == 0x000000, "Member 'TimeWatchGameMode_MatchResultUpdateCompleted::MatchResultJsonString' has a wrong offset!");
static_assert(offsetof(TimeWatchGameMode_MatchResultUpdateCompleted, bWasSuccessful) == 0x000010, "Member 'TimeWatchGameMode_MatchResultUpdateCompleted::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(TimeWatchGameMode_MatchResultUpdateCompleted, ErrorString) == 0x000018, "Member 'TimeWatchGameMode_MatchResultUpdateCompleted::ErrorString' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.ProcessTWEvent
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameMode_ProcessTWEvent final
{
public:
	class UTimeWatchEvent*                        Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_ProcessTWEvent) == 0x000008, "Wrong alignment on TimeWatchGameMode_ProcessTWEvent");
static_assert(sizeof(TimeWatchGameMode_ProcessTWEvent) == 0x000008, "Wrong size on TimeWatchGameMode_ProcessTWEvent");
static_assert(offsetof(TimeWatchGameMode_ProcessTWEvent, Event) == 0x000000, "Member 'TimeWatchGameMode_ProcessTWEvent::Event' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.SetupNewPlayer
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameMode_SetupNewPlayer final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_SetupNewPlayer) == 0x000008, "Wrong alignment on TimeWatchGameMode_SetupNewPlayer");
static_assert(sizeof(TimeWatchGameMode_SetupNewPlayer) == 0x000008, "Wrong size on TimeWatchGameMode_SetupNewPlayer");
static_assert(offsetof(TimeWatchGameMode_SetupNewPlayer, NewPlayer) == 0x000000, "Member 'TimeWatchGameMode_SetupNewPlayer::NewPlayer' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.SwitchToSpectatorMode
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameMode_SwitchToSpectatorMode final
{
public:
	class APlayerController*                      Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_SwitchToSpectatorMode) == 0x000008, "Wrong alignment on TimeWatchGameMode_SwitchToSpectatorMode");
static_assert(sizeof(TimeWatchGameMode_SwitchToSpectatorMode) == 0x000008, "Wrong size on TimeWatchGameMode_SwitchToSpectatorMode");
static_assert(offsetof(TimeWatchGameMode_SwitchToSpectatorMode, Player) == 0x000000, "Member 'TimeWatchGameMode_SwitchToSpectatorMode::Player' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.GetScoringTeamID
// 0x0004 (0x0004 - 0x0000)
struct TimeWatchGameMode_GetScoringTeamID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_GetScoringTeamID) == 0x000004, "Wrong alignment on TimeWatchGameMode_GetScoringTeamID");
static_assert(sizeof(TimeWatchGameMode_GetScoringTeamID) == 0x000004, "Wrong size on TimeWatchGameMode_GetScoringTeamID");
static_assert(offsetof(TimeWatchGameMode_GetScoringTeamID, ReturnValue) == 0x000000, "Member 'TimeWatchGameMode_GetScoringTeamID::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchGameMode.GetTWGameState
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchGameMode_GetTWGameState final
{
public:
	class ATimeWatchGameState*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchGameMode_GetTWGameState) == 0x000008, "Wrong alignment on TimeWatchGameMode_GetTWGameState");
static_assert(sizeof(TimeWatchGameMode_GetTWGameState) == 0x000008, "Wrong size on TimeWatchGameMode_GetTWGameState");
static_assert(offsetof(TimeWatchGameMode_GetTWGameState, ReturnValue) == 0x000000, "Member 'TimeWatchGameMode_GetTWGameState::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.AbilityCustomDataFromTargetActors
// 0x0030 (0x0030 - 0x0000)
struct TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors final
{
public:
	TArray<class AActor*>                         TargetActors;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors");
static_assert(sizeof(TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors) == 0x000030, "Wrong size on TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors");
static_assert(offsetof(TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors, TargetActors) == 0x000000, "Member 'TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors::TargetActors' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors, ReturnValue) == 0x000010, "Member 'TWGameplayAbilitySystem_AbilityCustomDataFromTargetActors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.AbilityCustomDataFromVectors
// 0x0030 (0x0030 - 0x0000)
struct TWGameplayAbilitySystem_AbilityCustomDataFromVectors final
{
public:
	TArray<struct FVector>                        InVectors;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilitySystem_AbilityCustomDataFromVectors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_AbilityCustomDataFromVectors");
static_assert(sizeof(TWGameplayAbilitySystem_AbilityCustomDataFromVectors) == 0x000030, "Wrong size on TWGameplayAbilitySystem_AbilityCustomDataFromVectors");
static_assert(offsetof(TWGameplayAbilitySystem_AbilityCustomDataFromVectors, InVectors) == 0x000000, "Member 'TWGameplayAbilitySystem_AbilityCustomDataFromVectors::InVectors' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_AbilityCustomDataFromVectors, ReturnValue) == 0x000010, "Member 'TWGameplayAbilitySystem_AbilityCustomDataFromVectors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.CopyDataToHandle_TargetActors
// 0x0060 (0x0060 - 0x0000)
struct TWGameplayAbilitySystem_CopyDataToHandle_TargetActors final
{
public:
	struct FTWAbilityCustomDataHandle             InDataHandle;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             OutDataHandle;                                     // 0x0020(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomData_TargetActors      InData;                                            // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_CopyDataToHandle_TargetActors");
static_assert(sizeof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors) == 0x000060, "Wrong size on TWGameplayAbilitySystem_CopyDataToHandle_TargetActors");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors, InDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_TargetActors::InDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors, OutDataHandle) == 0x000020, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_TargetActors::OutDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors, InData) == 0x000040, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_TargetActors::InData' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_TargetActors, ReturnValue) == 0x000058, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_TargetActors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.CopyDataToHandle_Vectors
// 0x0060 (0x0060 - 0x0000)
struct TWGameplayAbilitySystem_CopyDataToHandle_Vectors final
{
public:
	struct FTWAbilityCustomDataHandle             InDataHandle;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             OutDataHandle;                                     // 0x0020(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomData_Vectors           InData;                                            // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_CopyDataToHandle_Vectors");
static_assert(sizeof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors) == 0x000060, "Wrong size on TWGameplayAbilitySystem_CopyDataToHandle_Vectors");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors, InDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_Vectors::InDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors, OutDataHandle) == 0x000020, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_Vectors::OutDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors, InData) == 0x000040, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_Vectors::InData' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_CopyDataToHandle_Vectors, ReturnValue) == 0x000058, "Member 'TWGameplayAbilitySystem_CopyDataToHandle_Vectors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.GetDataCopyFromHandle_TargetActors
// 0x0038 (0x0038 - 0x0000)
struct TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors final
{
public:
	struct FTWAbilityCustomDataHandle             InDataHandle;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTWAbilityCustomData_TargetActors> OutData;                                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors");
static_assert(sizeof(TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors) == 0x000038, "Wrong size on TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors, InDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors::InDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors, OutData) == 0x000020, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors::OutData' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors, ReturnValue) == 0x000030, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_TargetActors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.GetDataCopyFromHandle_Vectors
// 0x0038 (0x0038 - 0x0000)
struct TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors final
{
public:
	struct FTWAbilityCustomDataHandle             InDataHandle;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTWAbilityCustomData_Vectors>   OutData;                                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors");
static_assert(sizeof(TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors) == 0x000038, "Wrong size on TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors, InDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors::InDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors, OutData) == 0x000020, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors::OutData' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors, ReturnValue) == 0x000030, "Member 'TWGameplayAbilitySystem_GetDataCopyFromHandle_Vectors::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.ShouldTriggerLogic
// 0x0038 (0x0038 - 0x0000)
struct TWGameplayAbilitySystem_ShouldTriggerLogic final
{
public:
	class UTWGameplayAbilitySystem*               TWAbilitySystem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATimeWatchCharacter*                    CasterAvatar;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWGameplayAbilitySystem_ShouldTriggerLogic) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_ShouldTriggerLogic");
static_assert(sizeof(TWGameplayAbilitySystem_ShouldTriggerLogic) == 0x000038, "Wrong size on TWGameplayAbilitySystem_ShouldTriggerLogic");
static_assert(offsetof(TWGameplayAbilitySystem_ShouldTriggerLogic, TWAbilitySystem) == 0x000000, "Member 'TWGameplayAbilitySystem_ShouldTriggerLogic::TWAbilitySystem' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_ShouldTriggerLogic, CasterAvatar) == 0x000008, "Member 'TWGameplayAbilitySystem_ShouldTriggerLogic::CasterAvatar' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_ShouldTriggerLogic, AbilityDataHandle) == 0x000010, "Member 'TWGameplayAbilitySystem_ShouldTriggerLogic::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_ShouldTriggerLogic, ReturnValue) == 0x000030, "Member 'TWGameplayAbilitySystem_ShouldTriggerLogic::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.GetAbilityExecutionData
// 0x0048 (0x0048 - 0x0000)
struct TWGameplayAbilitySystem_GetAbilityExecutionData final
{
public:
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTWAbilityExecutionData                ReturnValue;                                       // 0x0020(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilitySystem_GetAbilityExecutionData) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_GetAbilityExecutionData");
static_assert(sizeof(TWGameplayAbilitySystem_GetAbilityExecutionData) == 0x000048, "Wrong size on TWGameplayAbilitySystem_GetAbilityExecutionData");
static_assert(offsetof(TWGameplayAbilitySystem_GetAbilityExecutionData, AbilityDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_GetAbilityExecutionData::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetAbilityExecutionData, ReturnValue) == 0x000020, "Member 'TWGameplayAbilitySystem_GetAbilityExecutionData::ReturnValue' has a wrong offset!");

// Function TimeWatch.TWGameplayAbilitySystem.GetAbilityTargets
// 0x0030 (0x0030 - 0x0000)
struct TWGameplayAbilitySystem_GetAbilityTargets final
{
public:
	struct FTWAbilityCustomDataHandle             AbilityDataHandle;                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWGameplayAbilitySystem_GetAbilityTargets) == 0x000008, "Wrong alignment on TWGameplayAbilitySystem_GetAbilityTargets");
static_assert(sizeof(TWGameplayAbilitySystem_GetAbilityTargets) == 0x000030, "Wrong size on TWGameplayAbilitySystem_GetAbilityTargets");
static_assert(offsetof(TWGameplayAbilitySystem_GetAbilityTargets, AbilityDataHandle) == 0x000000, "Member 'TWGameplayAbilitySystem_GetAbilityTargets::AbilityDataHandle' has a wrong offset!");
static_assert(offsetof(TWGameplayAbilitySystem_GetAbilityTargets, ReturnValue) == 0x000020, "Member 'TWGameplayAbilitySystem_GetAbilityTargets::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.GetCrosshairClass
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_GetCrosshairClass final
{
public:
	TSubclassOf<class UNGDCrosshairWidget>        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_GetCrosshairClass) == 0x000008, "Wrong alignment on TimeWatchHUD_GetCrosshairClass");
static_assert(sizeof(TimeWatchHUD_GetCrosshairClass) == 0x000008, "Wrong size on TimeWatchHUD_GetCrosshairClass");
static_assert(offsetof(TimeWatchHUD_GetCrosshairClass, ReturnValue) == 0x000000, "Member 'TimeWatchHUD_GetCrosshairClass::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.GetCrosshairWidget
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_GetCrosshairWidget final
{
public:
	class UNGDCrosshairWidget*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_GetCrosshairWidget) == 0x000008, "Wrong alignment on TimeWatchHUD_GetCrosshairWidget");
static_assert(sizeof(TimeWatchHUD_GetCrosshairWidget) == 0x000008, "Wrong size on TimeWatchHUD_GetCrosshairWidget");
static_assert(offsetof(TimeWatchHUD_GetCrosshairWidget, ReturnValue) == 0x000000, "Member 'TimeWatchHUD_GetCrosshairWidget::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnChatMessagePostRequested
// 0x0020 (0x0020 - 0x0000)
struct TimeWatchHUD_OnChatMessagePostRequested final
{
public:
	class FText                                   TextMessage;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EChatChannel                                  Channel;                                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TimeWatchHUD_OnChatMessagePostRequested) == 0x000008, "Wrong alignment on TimeWatchHUD_OnChatMessagePostRequested");
static_assert(sizeof(TimeWatchHUD_OnChatMessagePostRequested) == 0x000020, "Wrong size on TimeWatchHUD_OnChatMessagePostRequested");
static_assert(offsetof(TimeWatchHUD_OnChatMessagePostRequested, TextMessage) == 0x000000, "Member 'TimeWatchHUD_OnChatMessagePostRequested::TextMessage' has a wrong offset!");
static_assert(offsetof(TimeWatchHUD_OnChatMessagePostRequested, Channel) == 0x000018, "Member 'TimeWatchHUD_OnChatMessagePostRequested::Channel' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnEnemyKilled
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_OnEnemyKilled final
{
public:
	class ATimeWatchCharacter*                    Victim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_OnEnemyKilled) == 0x000008, "Wrong alignment on TimeWatchHUD_OnEnemyKilled");
static_assert(sizeof(TimeWatchHUD_OnEnemyKilled) == 0x000008, "Wrong size on TimeWatchHUD_OnEnemyKilled");
static_assert(offsetof(TimeWatchHUD_OnEnemyKilled, Victim) == 0x000000, "Member 'TimeWatchHUD_OnEnemyKilled::Victim' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnHittingCharacter
// 0x0018 (0x0018 - 0x0000)
struct TimeWatchHUD_OnHittingCharacter final
{
public:
	class AActor*                                 InHittedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InHittedBone;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMeleeHit;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TimeWatchHUD_OnHittingCharacter) == 0x000008, "Wrong alignment on TimeWatchHUD_OnHittingCharacter");
static_assert(sizeof(TimeWatchHUD_OnHittingCharacter) == 0x000018, "Wrong size on TimeWatchHUD_OnHittingCharacter");
static_assert(offsetof(TimeWatchHUD_OnHittingCharacter, InHittedActor) == 0x000000, "Member 'TimeWatchHUD_OnHittingCharacter::InHittedActor' has a wrong offset!");
static_assert(offsetof(TimeWatchHUD_OnHittingCharacter, InHittedBone) == 0x000008, "Member 'TimeWatchHUD_OnHittingCharacter::InHittedBone' has a wrong offset!");
static_assert(offsetof(TimeWatchHUD_OnHittingCharacter, bIsMeleeHit) == 0x000010, "Member 'TimeWatchHUD_OnHittingCharacter::bIsMeleeHit' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnPlayerHit
// 0x0010 (0x0010 - 0x0000)
struct TimeWatchHUD_OnPlayerHit final
{
public:
	struct FVector                                HitDirection;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCritical;                                        // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TimeWatchHUD_OnPlayerHit) == 0x000004, "Wrong alignment on TimeWatchHUD_OnPlayerHit");
static_assert(sizeof(TimeWatchHUD_OnPlayerHit) == 0x000010, "Wrong size on TimeWatchHUD_OnPlayerHit");
static_assert(offsetof(TimeWatchHUD_OnPlayerHit, HitDirection) == 0x000000, "Member 'TimeWatchHUD_OnPlayerHit::HitDirection' has a wrong offset!");
static_assert(offsetof(TimeWatchHUD_OnPlayerHit, IsCritical) == 0x00000C, "Member 'TimeWatchHUD_OnPlayerHit::IsCritical' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct TimeWatchHUD_OnStateChanged final
{
public:
	EFluxCapacitorStates                          OldState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFluxCapacitorStates                          NewState;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_OnStateChanged) == 0x000001, "Wrong alignment on TimeWatchHUD_OnStateChanged");
static_assert(sizeof(TimeWatchHUD_OnStateChanged) == 0x000002, "Wrong size on TimeWatchHUD_OnStateChanged");
static_assert(offsetof(TimeWatchHUD_OnStateChanged, OldState) == 0x000000, "Member 'TimeWatchHUD_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(TimeWatchHUD_OnStateChanged, NewState) == 0x000001, "Member 'TimeWatchHUD_OnStateChanged::NewState' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnStatePresented
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_OnStatePresented final
{
public:
	class UNGDHUDState*                           PresentedState;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_OnStatePresented) == 0x000008, "Wrong alignment on TimeWatchHUD_OnStatePresented");
static_assert(sizeof(TimeWatchHUD_OnStatePresented) == 0x000008, "Wrong size on TimeWatchHUD_OnStatePresented");
static_assert(offsetof(TimeWatchHUD_OnStatePresented, PresentedState) == 0x000000, "Member 'TimeWatchHUD_OnStatePresented::PresentedState' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnTeamScoredPoint
// 0x0004 (0x0004 - 0x0000)
struct TimeWatchHUD_OnTeamScoredPoint final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_OnTeamScoredPoint) == 0x000004, "Wrong alignment on TimeWatchHUD_OnTeamScoredPoint");
static_assert(sizeof(TimeWatchHUD_OnTeamScoredPoint) == 0x000004, "Wrong size on TimeWatchHUD_OnTeamScoredPoint");
static_assert(offsetof(TimeWatchHUD_OnTeamScoredPoint, TeamId) == 0x000000, "Member 'TimeWatchHUD_OnTeamScoredPoint::TeamId' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.OnTWExplosion
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_OnTWExplosion final
{
public:
	class AActor*                                 InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_OnTWExplosion) == 0x000008, "Wrong alignment on TimeWatchHUD_OnTWExplosion");
static_assert(sizeof(TimeWatchHUD_OnTWExplosion) == 0x000008, "Wrong size on TimeWatchHUD_OnTWExplosion");
static_assert(offsetof(TimeWatchHUD_OnTWExplosion, InOwner) == 0x000000, "Member 'TimeWatchHUD_OnTWExplosion::InOwner' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.RegisterTWADSEvents
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_RegisterTWADSEvents final
{
public:
	class ATimeWatchCharacter*                    TWCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_RegisterTWADSEvents) == 0x000008, "Wrong alignment on TimeWatchHUD_RegisterTWADSEvents");
static_assert(sizeof(TimeWatchHUD_RegisterTWADSEvents) == 0x000008, "Wrong size on TimeWatchHUD_RegisterTWADSEvents");
static_assert(offsetof(TimeWatchHUD_RegisterTWADSEvents, TWCharacter) == 0x000000, "Member 'TimeWatchHUD_RegisterTWADSEvents::TWCharacter' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.SetCrosshair
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_SetCrosshair final
{
public:
	TSubclassOf<class UNGDCrosshairWidget>        WeaponCrosshairClass;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_SetCrosshair) == 0x000008, "Wrong alignment on TimeWatchHUD_SetCrosshair");
static_assert(sizeof(TimeWatchHUD_SetCrosshair) == 0x000008, "Wrong size on TimeWatchHUD_SetCrosshair");
static_assert(offsetof(TimeWatchHUD_SetCrosshair, WeaponCrosshairClass) == 0x000000, "Member 'TimeWatchHUD_SetCrosshair::WeaponCrosshairClass' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.SetOthersWantsRematch
// 0x0001 (0x0001 - 0x0000)
struct TimeWatchHUD_SetOthersWantsRematch final
{
public:
	bool                                          bOtherWantsRematch;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_SetOthersWantsRematch) == 0x000001, "Wrong alignment on TimeWatchHUD_SetOthersWantsRematch");
static_assert(sizeof(TimeWatchHUD_SetOthersWantsRematch) == 0x000001, "Wrong size on TimeWatchHUD_SetOthersWantsRematch");
static_assert(offsetof(TimeWatchHUD_SetOthersWantsRematch, bOtherWantsRematch) == 0x000000, "Member 'TimeWatchHUD_SetOthersWantsRematch::bOtherWantsRematch' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.GetCurrentWeapon
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_GetCurrentWeapon final
{
public:
	class ATemporalWeapon*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_GetCurrentWeapon) == 0x000008, "Wrong alignment on TimeWatchHUD_GetCurrentWeapon");
static_assert(sizeof(TimeWatchHUD_GetCurrentWeapon) == 0x000008, "Wrong size on TimeWatchHUD_GetCurrentWeapon");
static_assert(offsetof(TimeWatchHUD_GetCurrentWeapon, ReturnValue) == 0x000000, "Member 'TimeWatchHUD_GetCurrentWeapon::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.GetTWCharacter
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_GetTWCharacter final
{
public:
	class ATimeWatchCharacter*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_GetTWCharacter) == 0x000008, "Wrong alignment on TimeWatchHUD_GetTWCharacter");
static_assert(sizeof(TimeWatchHUD_GetTWCharacter) == 0x000008, "Wrong size on TimeWatchHUD_GetTWCharacter");
static_assert(offsetof(TimeWatchHUD_GetTWCharacter, ReturnValue) == 0x000000, "Member 'TimeWatchHUD_GetTWCharacter::ReturnValue' has a wrong offset!");

// Function TimeWatch.TimeWatchHUD.GetTWGameState
// 0x0008 (0x0008 - 0x0000)
struct TimeWatchHUD_GetTWGameState final
{
public:
	class ATimeWatchGameState*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TimeWatchHUD_GetTWGameState) == 0x000008, "Wrong alignment on TimeWatchHUD_GetTWGameState");
static_assert(sizeof(TimeWatchHUD_GetTWGameState) == 0x000008, "Wrong size on TimeWatchHUD_GetTWGameState");
static_assert(offsetof(TimeWatchHUD_GetTWGameState, ReturnValue) == 0x000000, "Member 'TimeWatchHUD_GetTWGameState::ReturnValue' has a wrong offset!");

// Function TimeWatch.ChatWidget.OnMessageEntered
// 0x0020 (0x0020 - 0x0000)
struct ChatWidget_OnMessageEntered final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatWidget_OnMessageEntered) == 0x000008, "Wrong alignment on ChatWidget_OnMessageEntered");
static_assert(sizeof(ChatWidget_OnMessageEntered) == 0x000020, "Wrong size on ChatWidget_OnMessageEntered");
static_assert(offsetof(ChatWidget_OnMessageEntered, Text) == 0x000000, "Member 'ChatWidget_OnMessageEntered::Text' has a wrong offset!");
static_assert(offsetof(ChatWidget_OnMessageEntered, CommitMethod) == 0x000018, "Member 'ChatWidget_OnMessageEntered::CommitMethod' has a wrong offset!");

// Function TimeWatch.DailyBoostItemWidget.SetIsItemCompleted
// 0x0014 (0x0014 - 0x0000)
struct DailyBoostItemWidget_SetIsItemCompleted final
{
public:
	bool                                          IsCompleted;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WidgetColor;                                       // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DailyBoostItemWidget_SetIsItemCompleted) == 0x000004, "Wrong alignment on DailyBoostItemWidget_SetIsItemCompleted");
static_assert(sizeof(DailyBoostItemWidget_SetIsItemCompleted) == 0x000014, "Wrong size on DailyBoostItemWidget_SetIsItemCompleted");
static_assert(offsetof(DailyBoostItemWidget_SetIsItemCompleted, IsCompleted) == 0x000000, "Member 'DailyBoostItemWidget_SetIsItemCompleted::IsCompleted' has a wrong offset!");
static_assert(offsetof(DailyBoostItemWidget_SetIsItemCompleted, WidgetColor) == 0x000004, "Member 'DailyBoostItemWidget_SetIsItemCompleted::WidgetColor' has a wrong offset!");

// Function TimeWatch.DailyBoostItemWidget.SetItemInfo
// 0x0010 (0x0010 - 0x0000)
struct DailyBoostItemWidget_SetItemInfo final
{
public:
	class FString                                 ItemInfo;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DailyBoostItemWidget_SetItemInfo) == 0x000008, "Wrong alignment on DailyBoostItemWidget_SetItemInfo");
static_assert(sizeof(DailyBoostItemWidget_SetItemInfo) == 0x000010, "Wrong size on DailyBoostItemWidget_SetItemInfo");
static_assert(offsetof(DailyBoostItemWidget_SetItemInfo, ItemInfo) == 0x000000, "Member 'DailyBoostItemWidget_SetItemInfo::ItemInfo' has a wrong offset!");

// Function TimeWatch.TWChallengeObserver.LoadChallenges
// 0x0018 (0x0018 - 0x0000)
struct TWChallengeObserver_LoadChallenges final
{
public:
	class UTWChallengeEventData*                  DataAssetChallenge;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTWChallengeEventInfo>          NonDataAssetChallenge;                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWChallengeObserver_LoadChallenges) == 0x000008, "Wrong alignment on TWChallengeObserver_LoadChallenges");
static_assert(sizeof(TWChallengeObserver_LoadChallenges) == 0x000018, "Wrong size on TWChallengeObserver_LoadChallenges");
static_assert(offsetof(TWChallengeObserver_LoadChallenges, DataAssetChallenge) == 0x000000, "Member 'TWChallengeObserver_LoadChallenges::DataAssetChallenge' has a wrong offset!");
static_assert(offsetof(TWChallengeObserver_LoadChallenges, NonDataAssetChallenge) == 0x000008, "Member 'TWChallengeObserver_LoadChallenges::NonDataAssetChallenge' has a wrong offset!");

// Function TimeWatch.TWChallengeObserver.OnChallengeProgress
// 0x0020 (0x0020 - 0x0000)
struct TWChallengeObserver_OnChallengeProgress final
{
public:
	class UTWChallengeEvent*                      ChallengeEvent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTWChallengeRule                       Rule;                                              // 0x0008(0x0014)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWChallengeObserver_OnChallengeProgress) == 0x000008, "Wrong alignment on TWChallengeObserver_OnChallengeProgress");
static_assert(sizeof(TWChallengeObserver_OnChallengeProgress) == 0x000020, "Wrong size on TWChallengeObserver_OnChallengeProgress");
static_assert(offsetof(TWChallengeObserver_OnChallengeProgress, ChallengeEvent) == 0x000000, "Member 'TWChallengeObserver_OnChallengeProgress::ChallengeEvent' has a wrong offset!");
static_assert(offsetof(TWChallengeObserver_OnChallengeProgress, Rule) == 0x000008, "Member 'TWChallengeObserver_OnChallengeProgress::Rule' has a wrong offset!");

// Function TimeWatch.TWChallengeObserver.UnloadChallenges
// 0x0018 (0x0018 - 0x0000)
struct TWChallengeObserver_UnloadChallenges final
{
public:
	class UTWChallengeEventData*                  DataAssetChallenge;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTWChallengeEventInfo>          NonDataAssetChallenge;                             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TWChallengeObserver_UnloadChallenges) == 0x000008, "Wrong alignment on TWChallengeObserver_UnloadChallenges");
static_assert(sizeof(TWChallengeObserver_UnloadChallenges) == 0x000018, "Wrong size on TWChallengeObserver_UnloadChallenges");
static_assert(offsetof(TWChallengeObserver_UnloadChallenges, DataAssetChallenge) == 0x000000, "Member 'TWChallengeObserver_UnloadChallenges::DataAssetChallenge' has a wrong offset!");
static_assert(offsetof(TWChallengeObserver_UnloadChallenges, NonDataAssetChallenge) == 0x000008, "Member 'TWChallengeObserver_UnloadChallenges::NonDataAssetChallenge' has a wrong offset!");

// Function TimeWatch.TWChallengeObserver.UpdateChallenge
// 0x0010 (0x0010 - 0x0000)
struct TWChallengeObserver_UpdateChallenge final
{
public:
	class FName                                   RuleName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RuleCount;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteOnCompleted;                                // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TWChallengeObserver_UpdateChallenge) == 0x000004, "Wrong alignment on TWChallengeObserver_UpdateChallenge");
static_assert(sizeof(TWChallengeObserver_UpdateChallenge) == 0x000010, "Wrong size on TWChallengeObserver_UpdateChallenge");
static_assert(offsetof(TWChallengeObserver_UpdateChallenge, RuleName) == 0x000000, "Member 'TWChallengeObserver_UpdateChallenge::RuleName' has a wrong offset!");
static_assert(offsetof(TWChallengeObserver_UpdateChallenge, RuleCount) == 0x000008, "Member 'TWChallengeObserver_UpdateChallenge::RuleCount' has a wrong offset!");
static_assert(offsetof(TWChallengeObserver_UpdateChallenge, bDeleteOnCompleted) == 0x00000C, "Member 'TWChallengeObserver_UpdateChallenge::bDeleteOnCompleted' has a wrong offset!");

// Function TimeWatch.CaptureCompassWidget.GetCompassName
// 0x0018 (0x0018 - 0x0000)
struct CaptureCompassWidget_GetCompassName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCompassWidget_GetCompassName) == 0x000008, "Wrong alignment on CaptureCompassWidget_GetCompassName");
static_assert(sizeof(CaptureCompassWidget_GetCompassName) == 0x000018, "Wrong size on CaptureCompassWidget_GetCompassName");
static_assert(offsetof(CaptureCompassWidget_GetCompassName, ReturnValue) == 0x000000, "Member 'CaptureCompassWidget_GetCompassName::ReturnValue' has a wrong offset!");

// Function TimeWatch.CaptureCompassWidget.OnStateChanged
// 0x0014 (0x0014 - 0x0000)
struct CaptureCompassWidget_OnStateChanged final
{
public:
	ECaptureState                                 NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CaptureCompassWidget_OnStateChanged) == 0x000004, "Wrong alignment on CaptureCompassWidget_OnStateChanged");
static_assert(sizeof(CaptureCompassWidget_OnStateChanged) == 0x000014, "Wrong size on CaptureCompassWidget_OnStateChanged");
static_assert(offsetof(CaptureCompassWidget_OnStateChanged, NewState) == 0x000000, "Member 'CaptureCompassWidget_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(CaptureCompassWidget_OnStateChanged, Color) == 0x000004, "Member 'CaptureCompassWidget_OnStateChanged::Color' has a wrong offset!");

// Function TimeWatch.CaptureCompassWidget.ShowCapturePointStroke
// 0x0001 (0x0001 - 0x0000)
struct CaptureCompassWidget_ShowCapturePointStroke final
{
public:
