#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TWCharacterBP

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TWCharacterBP.TWCharacterBP_C
// 0x00F0 (0x10C0 - 0x0FD0)
class ATWCharacterBP_C final : public ATimeWatchCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0FD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_RunFaster;                                      // 0x0FD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_VFX_DoubleJump;                                 // 0x0FE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DamageReductionShield;                          // 0x0FE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0FF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_Spawn_Invulnerability;                          // 0x0FF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Fx_SpawnParticles;                                 // 0x1000(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CharGhostAnim_TransitionParam_9F52B606479695DF8379A4B33BE316B6; // 0x1008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CharGhostAnim__Direction_9F52B606479695DF8379A4B33BE316B6; // 0x100C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_100D[0x3];                                     // 0x100D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CharGhostAnim;                                     // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnAnimationEnd_SpawnOpacityOverride_974EFF694811351519AD17A5B4123466; // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnAnimationEnd_SpawnAnimationAlpha_974EFF694811351519AD17A5B4123466; // 0x101C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RespawnAnimationEnd__Direction_974EFF694811351519AD17A5B4123466; // 0x1020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1021[0x7];                                     // 0x1021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RespawnAnimationEnd;                               // 0x1028(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnAnimationStart_TPMeshDisintegrationParam_9C89C8044798927824F6A9ADB8245176; // 0x1030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnAnimationStart_VisibilityFP_9C89C8044798927824F6A9ADB8245176; // 0x1034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnAnimationStart_AttractorAnimation_9C89C8044798927824F6A9ADB8245176; // 0x1038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RespawnAnimationStart__Direction_9C89C8044798927824F6A9ADB8245176; // 0x103C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103D[0x3];                                     // 0x103D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RespawnAnimationStart;                             // 0x1040(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Emissive_CEDD496A46E1DD10B6F9A9A560F7706D; // 0x1048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_CEDD496A46E1DD10B6F9A9A560F7706D; // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Anim_CEDD496A46E1DD10B6F9A9A560F7706D;  // 0x1050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CEDD496A46E1DD10B6F9A9A560F7706D; // 0x1054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1055[0x3];                                     // 0x1055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1058(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalTrail_C*                       TemporalTrail;                                     // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Names;                                             // 0x1068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 Name_0;                                            // 0x1078(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UFluxAnimInstance*                      ThirdPersonAnim;                                   // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFirstPerson_AnimBP_C*                  FirstPersonAnim;                                   // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GhostDeadColor;                                    // 0x1098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsingGhostMaterial;                                // 0x10A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A9[0x7];                                     // 0x10A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            GroundedShakeCurve;                                // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATemporalParticle*                      VFXDoubleJump;                                     // 0x10B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TWCharacterBP(int32 EntryPoint);
	void BP_OnCharacterDoubleJumpEvent();
	void OnCharacterGrounded(float VerticalSpeed);
	void ReceiveTick(float DeltaSeconds);
	void GhostMaterialTransition(bool bIsGhost);
	void BP_OnRespawnEnd();
	void OnAnimationBlueprintSet();
	void OnTeamAssigned(int32 TeamId);
	void OnSprintEnabled(bool NewState);
	void BndEvt__CustomizationComponent_K2Node_ComponentBoundEvent_0_MaterialCustomization__DelegateSignature(class UMaterialInstanceDynamic* DynamicMaterial);
	void RefreshCharacterRotation(const struct FRotator& InRotationToSet);
	void SetCloneName();
	void OnRespawn();
	void OnGameStateChangedBP(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState);
	void OnCloneStateChange(EFluxTimelineState CurrentState);
	void CharGhostAnim__SwapMaterials__EventFunc();
	void CharGhostAnim__UpdateFunc();
	void CharGhostAnim__FinishedFunc();
	void RespawnAnimationEnd__UpdateFunc();
	void RespawnAnimationEnd__FinishedFunc();
	void RespawnAnimationStart__ToggleVisibility__EventFunc();
	void RespawnAnimationStart__CurrentWeaponVisibility__EventFunc();
	void RespawnAnimationStart__UpdateFunc();
	void RespawnAnimationStart__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SetOutlineColor();
	void DrawCloneTrail();
	void UpdateSpawnAnimation(float ParticleLerp, float FPVisibilityAlpha, float TPDisintegration);
	void UpdateGhostMaterial(class UMaterialInstanceDynamic* DynamicMaterial);

	class UPrimitiveComponent* GetTPMeshOccluder() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TWCharacterBP_C">();
	}
	static class ATWCharacterBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATWCharacterBP_C>();
	}
};
static_assert(alignof(ATWCharacterBP_C) == 0x000010, "Wrong alignment on ATWCharacterBP_C");
static_assert(sizeof(ATWCharacterBP_C) == 0x0010C0, "Wrong size on ATWCharacterBP_C");
static_assert(offsetof(ATWCharacterBP_C, UberGraphFrame) == 0x000FD0, "Member 'ATWCharacterBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, PS_RunFaster) == 0x000FD8, "Member 'ATWCharacterBP_C::PS_RunFaster' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, PS_VFX_DoubleJump) == 0x000FE0, "Member 'ATWCharacterBP_C::PS_VFX_DoubleJump' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, SM_DamageReductionShield) == 0x000FE8, "Member 'ATWCharacterBP_C::SM_DamageReductionShield' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, StaticMesh) == 0x000FF0, "Member 'ATWCharacterBP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, PS_Spawn_Invulnerability) == 0x000FF8, "Member 'ATWCharacterBP_C::PS_Spawn_Invulnerability' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Fx_SpawnParticles) == 0x001000, "Member 'ATWCharacterBP_C::Fx_SpawnParticles' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, CharGhostAnim_TransitionParam_9F52B606479695DF8379A4B33BE316B6) == 0x001008, "Member 'ATWCharacterBP_C::CharGhostAnim_TransitionParam_9F52B606479695DF8379A4B33BE316B6' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, CharGhostAnim__Direction_9F52B606479695DF8379A4B33BE316B6) == 0x00100C, "Member 'ATWCharacterBP_C::CharGhostAnim__Direction_9F52B606479695DF8379A4B33BE316B6' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, CharGhostAnim) == 0x001010, "Member 'ATWCharacterBP_C::CharGhostAnim' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationEnd_SpawnOpacityOverride_974EFF694811351519AD17A5B4123466) == 0x001018, "Member 'ATWCharacterBP_C::RespawnAnimationEnd_SpawnOpacityOverride_974EFF694811351519AD17A5B4123466' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationEnd_SpawnAnimationAlpha_974EFF694811351519AD17A5B4123466) == 0x00101C, "Member 'ATWCharacterBP_C::RespawnAnimationEnd_SpawnAnimationAlpha_974EFF694811351519AD17A5B4123466' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationEnd__Direction_974EFF694811351519AD17A5B4123466) == 0x001020, "Member 'ATWCharacterBP_C::RespawnAnimationEnd__Direction_974EFF694811351519AD17A5B4123466' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationEnd) == 0x001028, "Member 'ATWCharacterBP_C::RespawnAnimationEnd' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationStart_TPMeshDisintegrationParam_9C89C8044798927824F6A9ADB8245176) == 0x001030, "Member 'ATWCharacterBP_C::RespawnAnimationStart_TPMeshDisintegrationParam_9C89C8044798927824F6A9ADB8245176' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationStart_VisibilityFP_9C89C8044798927824F6A9ADB8245176) == 0x001034, "Member 'ATWCharacterBP_C::RespawnAnimationStart_VisibilityFP_9C89C8044798927824F6A9ADB8245176' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationStart_AttractorAnimation_9C89C8044798927824F6A9ADB8245176) == 0x001038, "Member 'ATWCharacterBP_C::RespawnAnimationStart_AttractorAnimation_9C89C8044798927824F6A9ADB8245176' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationStart__Direction_9C89C8044798927824F6A9ADB8245176) == 0x00103C, "Member 'ATWCharacterBP_C::RespawnAnimationStart__Direction_9C89C8044798927824F6A9ADB8245176' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, RespawnAnimationStart) == 0x001040, "Member 'ATWCharacterBP_C::RespawnAnimationStart' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Timeline_0_Emissive_CEDD496A46E1DD10B6F9A9A560F7706D) == 0x001048, "Member 'ATWCharacterBP_C::Timeline_0_Emissive_CEDD496A46E1DD10B6F9A9A560F7706D' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Timeline_0_Opacity_CEDD496A46E1DD10B6F9A9A560F7706D) == 0x00104C, "Member 'ATWCharacterBP_C::Timeline_0_Opacity_CEDD496A46E1DD10B6F9A9A560F7706D' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Timeline_0_Anim_CEDD496A46E1DD10B6F9A9A560F7706D) == 0x001050, "Member 'ATWCharacterBP_C::Timeline_0_Anim_CEDD496A46E1DD10B6F9A9A560F7706D' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Timeline_0__Direction_CEDD496A46E1DD10B6F9A9A560F7706D) == 0x001054, "Member 'ATWCharacterBP_C::Timeline_0__Direction_CEDD496A46E1DD10B6F9A9A560F7706D' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Timeline_0) == 0x001058, "Member 'ATWCharacterBP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, TemporalTrail) == 0x001060, "Member 'ATWCharacterBP_C::TemporalTrail' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Names) == 0x001068, "Member 'ATWCharacterBP_C::Names' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, Name_0) == 0x001078, "Member 'ATWCharacterBP_C::Name_0' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, ThirdPersonAnim) == 0x001088, "Member 'ATWCharacterBP_C::ThirdPersonAnim' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, FirstPersonAnim) == 0x001090, "Member 'ATWCharacterBP_C::FirstPersonAnim' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, GhostDeadColor) == 0x001098, "Member 'ATWCharacterBP_C::GhostDeadColor' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, UsingGhostMaterial) == 0x0010A8, "Member 'ATWCharacterBP_C::UsingGhostMaterial' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, GroundedShakeCurve) == 0x0010B0, "Member 'ATWCharacterBP_C::GroundedShakeCurve' has a wrong offset!");
static_assert(offsetof(ATWCharacterBP_C, VFXDoubleJump) == 0x0010B8, "Member 'ATWCharacterBP_C::VFXDoubleJump' has a wrong offset!");

}

