#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TWFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TimeWatch_structs.hpp"


namespace SDK::Params
{

// Function TWFunctionLibrary.TWFunctionLibrary_C.GetColorScheme
// 0x0458 (0x0458 - 0x0000)
struct TWFunctionLibrary_C_GetColorScheme final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayColorScheme                   TeamColorsOutlines;                                // 0x0008(0x0428)(Parm, OutParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstance*                 K2Node_DynamicCast_AsTime_Watch_Game_Instance;     // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGlobals*                             CallFunc_GetGlobals_ReturnValue;                   // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWColorSchemeDataAsset*                CallFunc_GetColorScheme_ReturnValue;               // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TWFunctionLibrary_C_GetColorScheme) == 0x000008, "Wrong alignment on TWFunctionLibrary_C_GetColorScheme");
static_assert(sizeof(TWFunctionLibrary_C_GetColorScheme) == 0x000458, "Wrong size on TWFunctionLibrary_C_GetColorScheme");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, __WorldContext) == 0x000000, "Member 'TWFunctionLibrary_C_GetColorScheme::__WorldContext' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, TeamColorsOutlines) == 0x000008, "Member 'TWFunctionLibrary_C_GetColorScheme::TeamColorsOutlines' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, CallFunc_GetGameInstance_ReturnValue) == 0x000430, "Member 'TWFunctionLibrary_C_GetColorScheme::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, K2Node_DynamicCast_AsTime_Watch_Game_Instance) == 0x000438, "Member 'TWFunctionLibrary_C_GetColorScheme::K2Node_DynamicCast_AsTime_Watch_Game_Instance' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, K2Node_DynamicCast_bSuccess) == 0x000440, "Member 'TWFunctionLibrary_C_GetColorScheme::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, CallFunc_GetGlobals_ReturnValue) == 0x000448, "Member 'TWFunctionLibrary_C_GetColorScheme::CallFunc_GetGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetColorScheme, CallFunc_GetColorScheme_ReturnValue) == 0x000450, "Member 'TWFunctionLibrary_C_GetColorScheme::CallFunc_GetColorScheme_ReturnValue' has a wrong offset!");

// Function TWFunctionLibrary.TWFunctionLibrary_C.GetChromaActionColor
// 0x0068 (0x0068 - 0x0000)
struct TWFunctionLibrary_C_GetChromaActionColor final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstance*                 K2Node_DynamicCast_AsTime_Watch_Game_Instance;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWGlobals*                             CallFunc_GetGlobals_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTWChromaColorSchemeDataAsset*          CallFunc_GetChromaColorScheme_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TWFunctionLibrary_C_GetChromaActionColor) == 0x000008, "Wrong alignment on TWFunctionLibrary_C_GetChromaActionColor");
static_assert(sizeof(TWFunctionLibrary_C_GetChromaActionColor) == 0x000068, "Wrong size on TWFunctionLibrary_C_GetChromaActionColor");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, ActionName) == 0x000000, "Member 'TWFunctionLibrary_C_GetChromaActionColor::ActionName' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, __WorldContext) == 0x000008, "Member 'TWFunctionLibrary_C_GetChromaActionColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, Color) == 0x000010, "Member 'TWFunctionLibrary_C_GetChromaActionColor::Color' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, Success) == 0x000020, "Member 'TWFunctionLibrary_C_GetChromaActionColor::Success' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'TWFunctionLibrary_C_GetChromaActionColor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, K2Node_DynamicCast_AsTime_Watch_Game_Instance) == 0x000030, "Member 'TWFunctionLibrary_C_GetChromaActionColor::K2Node_DynamicCast_AsTime_Watch_Game_Instance' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TWFunctionLibrary_C_GetChromaActionColor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, CallFunc_GetGlobals_ReturnValue) == 0x000040, "Member 'TWFunctionLibrary_C_GetChromaActionColor::CallFunc_GetGlobals_ReturnValue' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, CallFunc_GetChromaColorScheme_ReturnValue) == 0x000048, "Member 'TWFunctionLibrary_C_GetChromaActionColor::CallFunc_GetChromaColorScheme_ReturnValue' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, CallFunc_Map_Find_Value) == 0x000050, "Member 'TWFunctionLibrary_C_GetChromaActionColor::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(TWFunctionLibrary_C_GetChromaActionColor, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'TWFunctionLibrary_C_GetChromaActionColor::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

