#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TWPremiumPopupWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TWPremiumPopupWidget.TWPremiumPopupWidget_C
// 0x0020 (0x07F8 - 0x07D8)
class UTWPremiumPopupWidget_C final : public UTWPremiumPopup
{
public:
	class UImage*                                 BackgroundB1;                                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Benefit3BG;                                        // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TWPremiumPopupWidget_C">();
	}
	static class UTWPremiumPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWPremiumPopupWidget_C>();
	}
};
static_assert(alignof(UTWPremiumPopupWidget_C) == 0x000008, "Wrong alignment on UTWPremiumPopupWidget_C");
static_assert(sizeof(UTWPremiumPopupWidget_C) == 0x0007F8, "Wrong size on UTWPremiumPopupWidget_C");
static_assert(offsetof(UTWPremiumPopupWidget_C, BackgroundB1) == 0x0007D8, "Member 'UTWPremiumPopupWidget_C::BackgroundB1' has a wrong offset!");
static_assert(offsetof(UTWPremiumPopupWidget_C, Benefit3BG) == 0x0007E0, "Member 'UTWPremiumPopupWidget_C::Benefit3BG' has a wrong offset!");
static_assert(offsetof(UTWPremiumPopupWidget_C, Image) == 0x0007E8, "Member 'UTWPremiumPopupWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UTWPremiumPopupWidget_C, Image_132) == 0x0007F0, "Member 'UTWPremiumPopupWidget_C::Image_132' has a wrong offset!");

}

