#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TWRewardPopupWidget

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TWRewardPopupWidget.TWRewardPopupWidget_C
// 0x0028 (0x0868 - 0x0840)
class UTWRewardPopupWidget_C final : public UTWRewardPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0840(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ArrowsLoop;                                        // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Blue_arrow;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Orange_arrow;                                      // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PopupBG;                                           // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TWRewardPopupWidget(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TWRewardPopupWidget_C">();
	}
	static class UTWRewardPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTWRewardPopupWidget_C>();
	}
};
static_assert(alignof(UTWRewardPopupWidget_C) == 0x000008, "Wrong alignment on UTWRewardPopupWidget_C");
static_assert(sizeof(UTWRewardPopupWidget_C) == 0x000868, "Wrong size on UTWRewardPopupWidget_C");
static_assert(offsetof(UTWRewardPopupWidget_C, UberGraphFrame) == 0x000840, "Member 'UTWRewardPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTWRewardPopupWidget_C, ArrowsLoop) == 0x000848, "Member 'UTWRewardPopupWidget_C::ArrowsLoop' has a wrong offset!");
static_assert(offsetof(UTWRewardPopupWidget_C, Blue_arrow) == 0x000850, "Member 'UTWRewardPopupWidget_C::Blue_arrow' has a wrong offset!");
static_assert(offsetof(UTWRewardPopupWidget_C, Orange_arrow) == 0x000858, "Member 'UTWRewardPopupWidget_C::Orange_arrow' has a wrong offset!");
static_assert(offsetof(UTWRewardPopupWidget_C, PopupBG) == 0x000860, "Member 'UTWRewardPopupWidget_C::PopupBG' has a wrong offset!");

}

