#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealProject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "UnrealProject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"
#include "AIModule_classes.hpp"
#include "PhysXVehicles_classes.hpp"


namespace SDK
{

// Class UnrealProject.BaseActor
// 0x0018 (0x0230 - 0x0218)
class ABaseActor : public AActor
{
public:
	bool                                          bIsActive;                                         // 0x0218(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedTickTime;                                     // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_220[0x10];                                     // 0x0220(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ANGDCharacter* GetLocalCharacter() const;
	bool IsActive() const;
	bool IsOwnedByLocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseActor">();
	}
	static class ABaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseActor>();
	}
};
static_assert(alignof(ABaseActor) == 0x000008, "Wrong alignment on ABaseActor");
static_assert(sizeof(ABaseActor) == 0x000230, "Wrong size on ABaseActor");
static_assert(offsetof(ABaseActor, bIsActive) == 0x000218, "Member 'ABaseActor::bIsActive' has a wrong offset!");
static_assert(offsetof(ABaseActor, FixedTickTime) == 0x00021C, "Member 'ABaseActor::FixedTickTime' has a wrong offset!");

// Class UnrealProject.Item
// 0x0080 (0x02B0 - 0x0230)
class AItem : public ABaseActor
{
public:
	class FString                                 ItemIdentifier;                                    // 0x0230(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ItemName;                                          // 0x0240(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UTexture2D*                             ItemIcon;                                          // 0x0258(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          VisibleWhenAdquired;                               // 0x0260(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanBeStored;                                       // 0x0261(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Weight;                                            // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxStack;                                          // 0x0268(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AItemPickup>                ItemPickupClass;                                   // 0x0270(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Quantity;                                          // 0x0278(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EItemFlags                                    Flags_0;                                           // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData                         InventoryData;                                     // 0x0280(0x0010)(Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FInventoryData                         LocalInventoryData;                                // 0x0290(0x0010)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USceneComponent*                        ItemRoot;                                          // 0x02A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTransferable;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDefaultItem;                                    // 0x02A9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_InventoryData();
	void OnRep_QuantityData();
	void ServerRequestUse();
	void SetVisible(bool bNewVisibilityState);

	bool CanBeUsed() const;
	EItemFlags GetFlags() const;
	class UTexture2D* GetItemIcon() const;
	class FString GetItemIdentifier() const;
	class FString GetItemName() const;
	const TSubclassOf<class AItemPickup> GetItemPickupClass() const;
	class ANGDCharacter* GetOwnerCharacter() const;
	class UInventoryComponent* GetOwnerInventory() const;
	int32 GetQuantity() const;
	int32 GetRemainingStackQuantity() const;
	float GetWeight() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Item">();
	}
	static class AItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItem>();
	}
};
static_assert(alignof(AItem) == 0x000008, "Wrong alignment on AItem");
static_assert(sizeof(AItem) == 0x0002B0, "Wrong size on AItem");
static_assert(offsetof(AItem, ItemIdentifier) == 0x000230, "Member 'AItem::ItemIdentifier' has a wrong offset!");
static_assert(offsetof(AItem, ItemName) == 0x000240, "Member 'AItem::ItemName' has a wrong offset!");
static_assert(offsetof(AItem, ItemIcon) == 0x000258, "Member 'AItem::ItemIcon' has a wrong offset!");
static_assert(offsetof(AItem, VisibleWhenAdquired) == 0x000260, "Member 'AItem::VisibleWhenAdquired' has a wrong offset!");
static_assert(offsetof(AItem, CanBeStored) == 0x000261, "Member 'AItem::CanBeStored' has a wrong offset!");
static_assert(offsetof(AItem, Weight) == 0x000264, "Member 'AItem::Weight' has a wrong offset!");
static_assert(offsetof(AItem, MaxStack) == 0x000268, "Member 'AItem::MaxStack' has a wrong offset!");
static_assert(offsetof(AItem, ItemPickupClass) == 0x000270, "Member 'AItem::ItemPickupClass' has a wrong offset!");
static_assert(offsetof(AItem, Quantity) == 0x000278, "Member 'AItem::Quantity' has a wrong offset!");
static_assert(offsetof(AItem, Flags_0) == 0x00027C, "Member 'AItem::Flags_0' has a wrong offset!");
static_assert(offsetof(AItem, InventoryData) == 0x000280, "Member 'AItem::InventoryData' has a wrong offset!");
static_assert(offsetof(AItem, LocalInventoryData) == 0x000290, "Member 'AItem::LocalInventoryData' has a wrong offset!");
static_assert(offsetof(AItem, ItemRoot) == 0x0002A0, "Member 'AItem::ItemRoot' has a wrong offset!");
static_assert(offsetof(AItem, bIsTransferable) == 0x0002A8, "Member 'AItem::bIsTransferable' has a wrong offset!");
static_assert(offsetof(AItem, bIsDefaultItem) == 0x0002A9, "Member 'AItem::bIsDefaultItem' has a wrong offset!");

// Class UnrealProject.Ammunition
// 0x0000 (0x02B0 - 0x02B0)
class AAmmunition final : public AItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ammunition">();
	}
	static class AAmmunition* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmmunition>();
	}
};
static_assert(alignof(AAmmunition) == 0x000008, "Wrong alignment on AAmmunition");
static_assert(sizeof(AAmmunition) == 0x0002B0, "Wrong size on AAmmunition");

// Class UnrealProject.NGDAnimInstance
// 0x0000 (0x0270 - 0x0270)
#pragma pack(push, 0x1)
class alignas(0x10) UNGDAnimInstance : public UAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NGDAnimInstance">();
	}
	static class UNGDAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNGDAnimInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UNGDAnimInstance) == 0x000010, "Wrong alignment on UNGDAnimInstance");
static_assert(sizeof(UNGDAnimInstance) == 0x000270, "Wrong size on UNGDAnimInstance");

// Class UnrealProject.NGDCameraModifier
// 0x0050 (0x0098 - 0x0048)
class UNGDCameraModifier : public UCameraModifier
{
public:
	struct FPostProcess                           ModifierSettings;                                  // 0x0048(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyCustomParameterModifier(class FName ParameterName, float InBaseValue, float* OutBaseValue);
	bool BlueprintIsModifierActive();
	void BlueprintOverrideAlpha(float* OutNewAlpha);

	float GetRelativeTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NGDCameraModifier">();
	}
	static class UNGDCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNGDCameraModifier>();
	}
};
static_assert(alignof(UNGDCameraModifier) == 0x000008, "Wrong alignment on UNGDCameraModifier");
static_assert(sizeof(UNGDCameraModifier) == 0x000098, "Wrong size on UNGDCameraModifier");
static_assert(offsetof(UNGDCameraModifier, ModifierSettings) == 0x000048, "Member 'UNGDCameraModifier::ModifierSettings' has a wrong offset!");

// Class UnrealProject.Equipment
// 0x0038 (0x02E8 - 0x02B0)
class AEquipment : public AItem
{
public:
	class UNGDAttachmentContainerComponent*       AttachmentContainer;                               // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 SlotType;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapacityBoost;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldListenToADSChange;                          // 0x02CC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEquipped;                                       // 0x02CD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CE[0x1];                                      // 0x02CE(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsConsumable;                                     // 0x02CF(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         MeshTP;                                            // 0x02E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Consume();
	class UNGDAttachmentContainerComponent* GetAttachmentContainer();
	void OnEquipped();
	void OnUnequipped();

	class FName GetBodyAttachSocket() const;
	class UMeshComponent* GetMeshTP() const;
	int32 GetSlotIndex() const;
	class FString GetSlotType() const;
	bool IsConsumable() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Equipment">();
	}
	static class AEquipment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipment>();
	}
};
static_assert(alignof(AEquipment) == 0x000008, "Wrong alignment on AEquipment");
static_assert(sizeof(AEquipment) == 0x0002E8, "Wrong size on AEquipment");
static_assert(offsetof(AEquipment, AttachmentContainer) == 0x0002B0, "Member 'AEquipment::AttachmentContainer' has a wrong offset!");
static_assert(offsetof(AEquipment, SlotType) == 0x0002B8, "Member 'AEquipment::SlotType' has a wrong offset!");
static_assert(offsetof(AEquipment, CapacityBoost) == 0x0002C8, "Member 'AEquipment::CapacityBoost' has a wrong offset!");
static_assert(offsetof(AEquipment, bShouldListenToADSChange) == 0x0002CC, "Member 'AEquipment::bShouldListenToADSChange' has a wrong offset!");
static_assert(offsetof(AEquipment, bIsEquipped) == 0x0002CD, "Member 'AEquipment::bIsEquipped' has a wrong offset!");
static_assert(offsetof(AEquipment, bIsConsumable) == 0x0002CF, "Member 'AEquipment::bIsConsumable' has a wrong offset!");
static_assert(offsetof(AEquipment, MeshTP) == 0x0002E0, "Member 'AEquipment::MeshTP' has a wrong offset!");

// Class UnrealProject.Action
// 0x0038 (0x0060 - 0x0028)
class UAction : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnActionBegin;                                     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float DeltaTime)> OnActionUpdate;                                  // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnActionFinish;                                    // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          Finished;                                          // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActionBegan;                                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAction* CreateActionOfClass(const struct FActionParams& ActionParams, TSubclassOf<class UAction> ActionClass);

	void BroadcastBeginAction();
	void BroadcastFinishAction();
	void BroadcastUpdateAction(float Delta);
	void DestroyAction();
	void Initialize(const struct FActionParams& ActionParams);
	void Update(float Delta);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Action">();
	}
	static class UAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction>();
	}
};
static_assert(alignof(UAction) == 0x000008, "Wrong alignment on UAction");
static_assert(sizeof(UAction) == 0x000060, "Wrong size on UAction");
static_assert(offsetof(UAction, OnActionBegin) == 0x000028, "Member 'UAction::OnActionBegin' has a wrong offset!");
static_assert(offsetof(UAction, OnActionUpdate) == 0x000038, "Member 'UAction::OnActionUpdate' has a wrong offset!");
static_assert(offsetof(UAction, OnActionFinish) == 0x000048, "Member 'UAction::OnActionFinish' has a wrong offset!");
static_assert(offsetof(UAction, Finished) == 0x000058, "Member 'UAction::Finished' has a wrong offset!");
static_assert(offsetof(UAction, ActionBegan) == 0x000059, "Member 'UAction::ActionBegan' has a wrong offset!");

// Class UnrealProject.StartAimingAction
// 0x0028 (0x0088 - 0x0060)
class UStartAimingAction final : public UAction
{
public:
	class UPlayTestComponent*                     PlayTestComp;                                      // 0x0060(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AimTargetLocation;                                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AimTargetActor;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimDurationLimit;                                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void EventUpdate(float Delta);
	void Initialize_Implementation(const struct FActionParams& ActionParams);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StartAimingAction">();
	}
	static class UStartAimingAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartAimingAction>();
	}
};
static_assert(alignof(UStartAimingAction) == 0x000008, "Wrong alignment on UStartAimingAction");
static_assert(sizeof(UStartAimingAction) == 0x000088, "Wrong size on UStartAimingAction");
static_assert(offsetof(UStartAimingAction, PlayTestComp) == 0x000060, "Member 'UStartAimingAction::PlayTestComp' has a wrong offset!");
static_assert(offsetof(UStartAimingAction, AimTargetLocation) == 0x000068, "Member 'UStartAimingAction::AimTargetLocation' has a wrong offset!");
static_assert(offsetof(UStartAimingAction, AimTargetActor) == 0x000078, "Member 'UStartAimingAction::AimTargetActor' has a wrong offset!");
static_assert(offsetof(UStartAimingAction, Timer) == 0x000080, "Member 'UStartAimingAction::Timer' has a wrong offset!");
static_assert(offsetof(UStartAimingAction, AimDurationLimit) == 0x000084, "Member 'UStartAimingAction::AimDurationLimit' has a wrong offset!");

// Class UnrealProject.Armor
// 0x0058 (0x0340 - 0x02E8)
class AArmor final : public AEquipment
{
public:
	float                                         MaxDurability;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Durability;                                        // 0x02EC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UNGDBodyPart>, float>  AffectedBodyParts;                                 // 0x02F0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void Equip();
	void OnRep_Durability();
	void Unequip();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Armor">();
	}
	static class AArmor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArmor>();
	}
};
static_assert(alignof(AArmor) == 0x000008, "Wrong alignment on AArmor");
static_assert(sizeof(AArmor) == 0x000340, "Wrong size on AArmor");
static_assert(offsetof(AArmor, MaxDurability) == 0x0002E8, "Member 'AArmor::MaxDurability' has a wrong offset!");
static_assert(offsetof(AArmor, Durability) == 0x0002EC, "Member 'AArmor::Durability' has a wrong offset!");
static_assert(offsetof(AArmor, AffectedBodyParts) == 0x0002F0, "Member 'AArmor::AffectedBodyParts' has a wrong offset!");

// Class UnrealProject.NGDAkComponent
// 0x0010 (0x03E0 - 0x03D0)
class UNGDAkComponent : public UAkComponent
{
public:
	bool                                          bPlayAKEventOnBeginPlay;                           // 0x03D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvideIsPlayer;                                  // 0x03D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvideTimeDilation;                              // 0x03D2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ContextActor;                                      // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	int32 Play(class AActor* InContextActor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NGDAkComponent">();
	}
	static class UNGDAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNGDAkComponent>();
	}
};
static_assert(alignof(UNGDAkComponent) == 0x000010, "Wrong alignment on UNGDAkComponent");
static_assert(sizeof(UNGDAkComponent) == 0x0003E0, "Wrong size on UNGDAkComponent");
static_assert(offsetof(UNGDAkComponent, bPlayAKEventOnBeginPlay) == 0x0003D0, "Member 'UNGDAkComponent::bPlayAKEventOnBeginPlay' has a wrong offset!");
static_assert(offsetof(UNGDAkComponent, bProvideIsPlayer) == 0x0003D1, "Member 'UNGDAkComponent::bProvideIsPlayer' has a wrong offset!");
static_assert(offsetof(UNGDAkComponent, bProvideTimeDilation) == 0x0003D2, "Member 'UNGDAkComponent::bProvideTimeDilation' has a wrong offset!");
static_assert(offsetof(UNGDAkComponent, ContextActor) == 0x0003D8, "Member 'UNGDAkComponent::ContextActor' has a wrong offset!");

// Class UnrealProject.Attachment
// 0x00E0 (0x0390 - 0x02B0)
class AAttachment : public AItem
{
public:
	TArray<TSubclassOf<class AActor>>             AttachedByClasses;                                 // 0x02B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SlotType;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AttachSocket;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x02E0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bVisibleWhenDetached;                              // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            DefaultStaticMesh;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class AActor>, class UStaticMesh*> Meshes;                                      // 0x0320(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FAttachmentReplicationData             ReplicationData;                                   // 0x0370(0x0010)(Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAttachmentReplicationData             LocalReplicationData;                              // 0x0380(0x0010)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnRep_ReplicationData();

	bool IsAttached() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Attachment">();
	}
	static class AAttachment* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAttachment>();
	}
};
static_assert(alignof(AAttachment) == 0x000010, "Wrong alignment on AAttachment");
static_assert(sizeof(AAttachment) == 0x000390, "Wrong size on AAttachment");
static_assert(offsetof(AAttachment, AttachedByClasses) == 0x0002B0, "Member 'AAttachment::AttachedByClasses' has a wrong offset!");
static_assert(offsetof(AAttachment, StaticMeshComponent) == 0x0002C0, "Member 'AAttachment::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AAttachment, SlotType) == 0x0002C8, "Member 'AAttachment::SlotType' has a wrong offset!");
static_assert(offsetof(AAttachment, AttachSocket) == 0x0002D0, "Member 'AAttachment::AttachSocket' has a wrong offset!");
static_assert(offsetof(AAttachment, RelativeTransform) == 0x0002E0, "Member 'AAttachment::RelativeTransform' has a wrong offset!");
static_assert(offsetof(AAttachment, bVisibleWhenDetached) == 0x000310, "Member 'AAttachment::bVisibleWhenDetached' has a wrong offset!");
static_assert(offsetof(AAttachment, DefaultStaticMesh) == 0x000318, "Member 'AAttachment::DefaultStaticMesh' has a wrong offset!");
static_assert(offsetof(AAttachment, Meshes) == 0x000320, "Member 'AAttachment::Meshes' has a wrong offset!");
static_assert(offsetof(AAttachment, ReplicationData) == 0x000370, "Member 'AAttachment::ReplicationData' has a wrong offset!");
static_assert(offsetof(AAttachment, LocalReplicationData) == 0x000380, "Member 'AAttachment::LocalReplicationData' has a wrong offset!");

// Class UnrealProject.PlayTestComponent
// 0x01B8 (0x0268 - 0x00B0)
class UPlayTestComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0xB0];                                      // 0x00B0(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	class ANGDCharacter*                          Character;                                         // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            Controller;                                        // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANGDPlayerController*                   PlayerController;                                  // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCompositeAction*                       RootAction;                                        // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                                CurrentWeapon;                                     // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInventoryComponent*                    InventoryComponent;                                // 0x0188(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNGDInteractionComponent*               InteractionComponent;                              // 0x0190(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFindingItems;                                   // 0x0198(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0xF];                                      // 0x0199(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AimTarget;                                         // 0x01A8(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AimTargetActor;                                    // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              TeleportCase;                                      // 0x01C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x18];                                     // 0x01D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        PathPoints;                                        // 0x01E8(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x18];                                     // 0x01F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANGDCharacter*>                  Enemies;                                           // 0x0210(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AWeapon*>                        Weapons;                                           // 0x0220(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AAmmunition*>                    Ammo;                                              // 0x0230(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsAiming;                                         // 0x0240(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_241[0x13];                                     // 0x0241(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalLocation;                                     // 0x0254(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPathIsPartial;                                    // 0x0260(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTargetOnSight;                                    // 0x0261(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Aim(const struct FVector& AimToLocation, float DeltaTime);
	bool CheckLineOfSight(class AActor* OtherActor);
	void ClientTeleportBroadcast();
	void CrashTest(const class FString& CrashMessage);
	void FinishPlayTest();
	class ANGDCharacter* GetClosestEnemy();
	struct FVector ProjectPointToRandomReachableNavMesh(const struct FVector& PointToProject, float RandomRadius);
	void RefreshActions();
	void ResetPlayTest();
	void ServerTeleportPlayerToNavMeshLocation(const struct FVector& Destination);
	void ServerTeleportPlayerToRandomNavMeshLocation();
	void SetNewMoveDestination(const struct FVector& LocationToGo);
	void SetRandomMoveLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlayTestComponent">();
	}
	static class UPlayTestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayTestComponent>();
	}
};
static_assert(alignof(UPlayTestComponent) == 0x000008, "Wrong alignment on UPlayTestComponent");
static_assert(sizeof(UPlayTestComponent) == 0x000268, "Wrong size on UPlayTestComponent");
static_assert(offsetof(UPlayTestComponent, Character) == 0x000160, "Member 'UPlayTestComponent::Character' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, Controller) == 0x000168, "Member 'UPlayTestComponent::Controller' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, PlayerController) == 0x000170, "Member 'UPlayTestComponent::PlayerController' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, RootAction) == 0x000178, "Member 'UPlayTestComponent::RootAction' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, CurrentWeapon) == 0x000180, "Member 'UPlayTestComponent::CurrentWeapon' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, InventoryComponent) == 0x000188, "Member 'UPlayTestComponent::InventoryComponent' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, InteractionComponent) == 0x000190, "Member 'UPlayTestComponent::InteractionComponent' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, bIsFindingItems) == 0x000198, "Member 'UPlayTestComponent::bIsFindingItems' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, AimTarget) == 0x0001A8, "Member 'UPlayTestComponent::AimTarget' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, AimTargetActor) == 0x0001B8, "Member 'UPlayTestComponent::AimTargetActor' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, TeleportCase) == 0x0001C0, "Member 'UPlayTestComponent::TeleportCase' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, PathPoints) == 0x0001E8, "Member 'UPlayTestComponent::PathPoints' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, Enemies) == 0x000210, "Member 'UPlayTestComponent::Enemies' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, Weapons) == 0x000220, "Member 'UPlayTestComponent::Weapons' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, Ammo) == 0x000230, "Member 'UPlayTestComponent::Ammo' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, bIsAiming) == 0x000240, "Member 'UPlayTestComponent::bIsAiming' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, FinalLocation) == 0x000254, "Member 'UPlayTestComponent::FinalLocation' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, bPathIsPartial) == 0x000260, "Member 'UPlayTestComponent::bPathIsPartial' has a wrong offset!");
static_assert(offsetof(UPlayTestComponent, bTargetOnSight) == 0x000261, "Member 'UPlayTestComponent::bTargetOnSight' has a wrong offset!");

// Class UnrealProject.BarObject
// 0x0008 (0x0030 - 0x0028)
class UBarObject final : public UObject
{
public:
	class UBarWidget*                             BarWidget;                                         // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarObject">();
	}
	static class UBarObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarObject>();
	}
};
static_assert(alignof(UBarObject) == 0x000008, "Wrong alignment on UBarObject");
static_assert(sizeof(UBarObject) == 0x000030, "Wrong size on UBarObject");
static_assert(offsetof(UBarObject, BarWidget) == 0x000028, "Member 'UBarObject::BarWidget' has a wrong offset!");

// Class UnrealProject.BarsManager
// 0x0020 (0x0048 - 0x0028)
class UBarsManager final : public UObject
{
public:
	TArray<class UBarObject*>                     BarsCreated;                                       // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UBarObject* AddBar(class UObject* InContext, const TArray<struct FFloatValueToShow>& FloatsToShow, const struct FVector2D& Position);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarsManager">();
	}
	static class UBarsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarsManager>();
	}
};
static_assert(alignof(UBarsManager) == 0x000008, "Wrong alignment on UBarsManager");
static_assert(sizeof(UBarsManager) == 0x000048, "Wrong size on UBarsManager");
static_assert(offsetof(UBarsManager, BarsCreated) == 0x000028, "Member 'UBarsManager::BarsCreated' has a wrong offset!");

// Class UnrealProject.ThrowableProjectile
// 0x0068 (0x0298 - 0x0230)
class AThrowableProjectile final : public ABaseActor
{
public:
	class USphereComponent*                       CollisionComp;                                     // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProjectileMovementComponent*           ProjectileMovementComp;                            // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     SpawnActorOnTimerEnd;                              // 0x0240(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Timer;                                             // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNGDRadialDamageConfig                 ExplosionConfig;                                   // 0x0250(0x0030)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ImpactImpulse;                                     // 0x0280(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                AngularImpulse;                                    // 0x0284(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AController*                            InstigatorContorller;                              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ApplyRadialDamage();
	void InitializeExplosion();
	void OnTimerExpired();
	void ProjectileOnHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetInstigator(class AController* InInstigator);
	void SpawnExplosionActor();
	class AWeapon* TryGetOwnerWeapon();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ThrowableProjectile">();
	}
	static class AThrowableProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThrowableProjectile>();
	}
};
static_assert(alignof(AThrowableProjectile) == 0x000008, "Wrong alignment on AThrowableProjectile");
static_assert(sizeof(AThrowableProjectile) == 0x000298, "Wrong size on AThrowableProjectile");
static_assert(offsetof(AThrowableProjectile, CollisionComp) == 0x000230, "Member 'AThrowableProjectile::CollisionComp' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, ProjectileMovementComp) == 0x000238, "Member 'AThrowableProjectile::ProjectileMovementComp' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, SpawnActorOnTimerEnd) == 0x000240, "Member 'AThrowableProjectile::SpawnActorOnTimerEnd' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, Timer) == 0x000248, "Member 'AThrowableProjectile::Timer' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, ExplosionConfig) == 0x000250, "Member 'AThrowableProjectile::ExplosionConfig' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, ImpactImpulse) == 0x000280, "Member 'AThrowableProjectile::ImpactImpulse' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, AngularImpulse) == 0x000284, "Member 'AThrowableProjectile::AngularImpulse' has a wrong offset!");
static_assert(offsetof(AThrowableProjectile, InstigatorContorller) == 0x000290, "Member 'AThrowableProjectile::InstigatorContorller' has a wrong offset!");

// Class UnrealProject.BarWidget
// 0x0098 (0x02C8 - 0x0230)
class UBarWidget final : public UUserWidget
{
public:
	TArray<struct FFloatValueToShow>              OutValues;                                         // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              InitialPosition;                                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InitialSize;                                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           MyCanvas;                                          // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         Images;                                            // 0x0268(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UTextBlock*>                     Titles;                                            // 0x0278(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCanvasPanelSlot*>               TitlesCanvasSlot;                                  // 0x0288(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UImage*>                         DrawRectImages;                                    // 0x0298(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCanvasPanelSlot*>               FillImagesCanvasSlot;                              // 0x02A8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCanvasPanelSlot*>               RectImagesCanvasSlot;                              // 0x02B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BarWidget">();
	}
	static class UBarWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarWidget>();
	}
};
static_assert(alignof(UBarWidget) == 0x000008, "Wrong alignment on UBarWidget");
static_assert(sizeof(UBarWidget) == 0x0002C8, "Wrong size on UBarWidget");
static_assert(offsetof(UBarWidget, OutValues) == 0x000230, "Member 'UBarWidget::OutValues' has a wrong offset!");
static_assert(offsetof(UBarWidget, InitialPosition) == 0x000240, "Member 'UBarWidget::InitialPosition' has a wrong offset!");
static_assert(offsetof(UBarWidget, InitialSize) == 0x000248, "Member 'UBarWidget::InitialSize' has a wrong offset!");
static_assert(offsetof(UBarWidget, MyCanvas) == 0x000250, "Member 'UBarWidget::MyCanvas' has a wrong offset!");
static_assert(offsetof(UBarWidget, Images) == 0x000268, "Member 'UBarWidget::Images' has a wrong offset!");
static_assert(offsetof(UBarWidget, Titles) == 0x000278, "Member 'UBarWidget::Titles' has a wrong offset!");
static_assert(offsetof(UBarWidget, TitlesCanvasSlot) == 0x000288, "Member 'UBarWidget::TitlesCanvasSlot' has a wrong offset!");
static_assert(offsetof(UBarWidget, DrawRectImages) == 0x000298, "Member 'UBarWidget::DrawRectImages' has a wrong offset!");
static_assert(offsetof(UBarWidget, FillImagesCanvasSlot) == 0x0002A8, "Member 'UBarWidget::FillImagesCanvasSlot' has a wrong offset!");
static_assert(offsetof(UBarWidget, RectImagesCanvasSlot) == 0x0002B8, "Member 'UBarWidget::RectImagesCanvasSlot' has a wrong offset!");

// Class UnrealProject.NGDAttachmentContainerComponent
// 0x0010 (0x00C0 - 0x00B0)
class UNGDAttachmentContainerComponent final : public UActorComponent
{
public:
	TArray<struct FAttachmentSlot>                AttachmentSlots;                                   // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void ServerAttachToSlot(class AAttachment* InAttachment, const int32 SlotIndex);
	void ServerAutoAttach(class AAttachment* InAttachment);
	void ServerDetach(class AAttachment* InAttachment);
	void ServerDetachAll();

	bool CanBeAttached(class AAttachment* Attachment) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NGDAttachmentContainerComponent">();
	}
	static class UNGDAttachmentContainerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNGDAttachmentContainerComponent>();
	}
};
static_assert(alignof(UNGDAttachmentContainerComponent) == 0x000008, "Wrong alignment on UNGDAttachmentContainerComponent");
static_assert(sizeof(UNGDAttachmentContainerComponent) == 0x0000C0, "Wrong size on UNGDAttachmentContainerComponent");
static_assert(offsetof(UNGDAttachmentContainerComponent, AttachmentSlots) == 0x0000B0, "Member 'UNGDAttachmentContainerComponent::AttachmentSlots' has a wrong offset!");

// Class UnrealProject.BaseFirearmFeelComponent
// 0x0088 (0x0138 - 0x00B0)
class UBaseFirearmFeelComponent : public UActorComponent
{
public:
	bool                                          Enabled;                                           // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x00B1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDebugComposed;                               // 0x00B2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugScale;                                        // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 DebugScales;                                       // 0x00B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFirearmFeelCharacterModifiers         CharacterModifiers;                                // 0x00D8(0x0028)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CharacterModifierLerpTime;                         // 0x0100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentCharacterModifierLerpTime;                  // 0x0104(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentCharacterModifier;                          // 0x0108(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WantedCharacterModifier;                           // 0x010C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CharacterModifierTimer;                            // 0x0110(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFirearmFeelModifiers                  Modifiers;                                         // 0x0114(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         Scale;                                             // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 InitialState;                                      // 0x0128(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseFirearmFeelComponent">();
	}
	static class UBaseFirearmFeelComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseFirearmFeelComponent>();
	}
};
static_assert(alignof(UBaseFirearmFeelComponent) == 0x000008, "Wrong alignment on UBaseFirearmFeelComponent");
static_assert(sizeof(UBaseFirearmFeelComponent) == 0x000138, "Wrong size on UBaseFirearmFeelComponent");
static_assert(offsetof(UBaseFirearmFeelComponent, Enabled) == 0x0000B0, "Member 'UBaseFirearmFeelComponent::Enabled' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, bDebug) == 0x0000B1, "Member 'UBaseFirearmFeelComponent::bDebug' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, bForceDebugComposed) == 0x0000B2, "Member 'UBaseFirearmFeelComponent::bForceDebugComposed' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, DebugScale) == 0x0000B4, "Member 'UBaseFirearmFeelComponent::DebugScale' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, DebugScales) == 0x0000B8, "Member 'UBaseFirearmFeelComponent::DebugScales' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, CharacterModifiers) == 0x0000D8, "Member 'UBaseFirearmFeelComponent::CharacterModifiers' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, CharacterModifierLerpTime) == 0x000100, "Member 'UBaseFirearmFeelComponent::CharacterModifierLerpTime' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, CurrentCharacterModifierLerpTime) == 0x000104, "Member 'UBaseFirearmFeelComponent::CurrentCharacterModifierLerpTime' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, CurrentCharacterModifier) == 0x000108, "Member 'UBaseFirearmFeelComponent::CurrentCharacterModifier' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, WantedCharacterModifier) == 0x00010C, "Member 'UBaseFirearmFeelComponent::WantedCharacterModifier' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, CharacterModifierTimer) == 0x000110, "Member 'UBaseFirearmFeelComponent::CharacterModifierTimer' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, Modifiers) == 0x000114, "Member 'UBaseFirearmFeelComponent::Modifiers' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, Scale) == 0x000120, "Member 'UBaseFirearmFeelComponent::Scale' has a wrong offset!");
static_assert(offsetof(UBaseFirearmFeelComponent, InitialState) == 0x000128, "Member 'UBaseFirearmFeelComponent::InitialState' has a wrong offset!");

// Class UnrealProject.NGDWheeledVehicle
// 0x0130 (0x03B8 - 0x0288)
class ANGDWheeledVehicle : public AWheeledVehicle
{
public:
	uint8                                         Pad_288[0x20];                                     // 0x0288(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentFuel;                                       // 0x02A8(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FuelCapacity;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FuelConsumption;                                   // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AffectedSocket;                                    // 0x02B4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Impulse;                                           // 0x02BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinVelocityThresholdToRunOver;                     // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          InteractionBox;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          RunOverBox;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                          SimpleShapeBox;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
