#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealProject

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "UnrealProject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "NGDBackend_structs.hpp"


namespace SDK::Params
{

// Function UnrealProject.BaseActor.GetLocalCharacter
// 0x0008 (0x0008 - 0x0000)
struct BaseActor_GetLocalCharacter final
{
public:
	class ANGDCharacter*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseActor_GetLocalCharacter) == 0x000008, "Wrong alignment on BaseActor_GetLocalCharacter");
static_assert(sizeof(BaseActor_GetLocalCharacter) == 0x000008, "Wrong size on BaseActor_GetLocalCharacter");
static_assert(offsetof(BaseActor_GetLocalCharacter, ReturnValue) == 0x000000, "Member 'BaseActor_GetLocalCharacter::ReturnValue' has a wrong offset!");

// Function UnrealProject.BaseActor.IsActive
// 0x0001 (0x0001 - 0x0000)
struct BaseActor_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseActor_IsActive) == 0x000001, "Wrong alignment on BaseActor_IsActive");
static_assert(sizeof(BaseActor_IsActive) == 0x000001, "Wrong size on BaseActor_IsActive");
static_assert(offsetof(BaseActor_IsActive, ReturnValue) == 0x000000, "Member 'BaseActor_IsActive::ReturnValue' has a wrong offset!");

// Function UnrealProject.BaseActor.IsOwnedByLocalPlayer
// 0x0001 (0x0001 - 0x0000)
struct BaseActor_IsOwnedByLocalPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseActor_IsOwnedByLocalPlayer) == 0x000001, "Wrong alignment on BaseActor_IsOwnedByLocalPlayer");
static_assert(sizeof(BaseActor_IsOwnedByLocalPlayer) == 0x000001, "Wrong size on BaseActor_IsOwnedByLocalPlayer");
static_assert(offsetof(BaseActor_IsOwnedByLocalPlayer, ReturnValue) == 0x000000, "Member 'BaseActor_IsOwnedByLocalPlayer::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct Item_SetVisible final
{
public:
	bool                                          bNewVisibilityState;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_SetVisible) == 0x000001, "Wrong alignment on Item_SetVisible");
static_assert(sizeof(Item_SetVisible) == 0x000001, "Wrong size on Item_SetVisible");
static_assert(offsetof(Item_SetVisible, bNewVisibilityState) == 0x000000, "Member 'Item_SetVisible::bNewVisibilityState' has a wrong offset!");

// Function UnrealProject.Item.CanBeUsed
// 0x0001 (0x0001 - 0x0000)
struct Item_CanBeUsed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_CanBeUsed) == 0x000001, "Wrong alignment on Item_CanBeUsed");
static_assert(sizeof(Item_CanBeUsed) == 0x000001, "Wrong size on Item_CanBeUsed");
static_assert(offsetof(Item_CanBeUsed, ReturnValue) == 0x000000, "Member 'Item_CanBeUsed::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetFlags
// 0x0001 (0x0001 - 0x0000)
struct Item_GetFlags final
{
public:
	EItemFlags                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetFlags) == 0x000001, "Wrong alignment on Item_GetFlags");
static_assert(sizeof(Item_GetFlags) == 0x000001, "Wrong size on Item_GetFlags");
static_assert(offsetof(Item_GetFlags, ReturnValue) == 0x000000, "Member 'Item_GetFlags::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetItemIcon
// 0x0008 (0x0008 - 0x0000)
struct Item_GetItemIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetItemIcon) == 0x000008, "Wrong alignment on Item_GetItemIcon");
static_assert(sizeof(Item_GetItemIcon) == 0x000008, "Wrong size on Item_GetItemIcon");
static_assert(offsetof(Item_GetItemIcon, ReturnValue) == 0x000000, "Member 'Item_GetItemIcon::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetItemIdentifier
// 0x0010 (0x0010 - 0x0000)
struct Item_GetItemIdentifier final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetItemIdentifier) == 0x000008, "Wrong alignment on Item_GetItemIdentifier");
static_assert(sizeof(Item_GetItemIdentifier) == 0x000010, "Wrong size on Item_GetItemIdentifier");
static_assert(offsetof(Item_GetItemIdentifier, ReturnValue) == 0x000000, "Member 'Item_GetItemIdentifier::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetItemName
// 0x0010 (0x0010 - 0x0000)
struct Item_GetItemName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetItemName) == 0x000008, "Wrong alignment on Item_GetItemName");
static_assert(sizeof(Item_GetItemName) == 0x000010, "Wrong size on Item_GetItemName");
static_assert(offsetof(Item_GetItemName, ReturnValue) == 0x000000, "Member 'Item_GetItemName::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetItemPickupClass
// 0x0008 (0x0008 - 0x0000)
struct Item_GetItemPickupClass final
{
public:
	TSubclassOf<class AItemPickup>                ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetItemPickupClass) == 0x000008, "Wrong alignment on Item_GetItemPickupClass");
static_assert(sizeof(Item_GetItemPickupClass) == 0x000008, "Wrong size on Item_GetItemPickupClass");
static_assert(offsetof(Item_GetItemPickupClass, ReturnValue) == 0x000000, "Member 'Item_GetItemPickupClass::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct Item_GetOwnerCharacter final
{
public:
	class ANGDCharacter*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetOwnerCharacter) == 0x000008, "Wrong alignment on Item_GetOwnerCharacter");
static_assert(sizeof(Item_GetOwnerCharacter) == 0x000008, "Wrong size on Item_GetOwnerCharacter");
static_assert(offsetof(Item_GetOwnerCharacter, ReturnValue) == 0x000000, "Member 'Item_GetOwnerCharacter::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetOwnerInventory
// 0x0008 (0x0008 - 0x0000)
struct Item_GetOwnerInventory final
{
public:
	class UInventoryComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetOwnerInventory) == 0x000008, "Wrong alignment on Item_GetOwnerInventory");
static_assert(sizeof(Item_GetOwnerInventory) == 0x000008, "Wrong size on Item_GetOwnerInventory");
static_assert(offsetof(Item_GetOwnerInventory, ReturnValue) == 0x000000, "Member 'Item_GetOwnerInventory::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetQuantity
// 0x0004 (0x0004 - 0x0000)
struct Item_GetQuantity final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetQuantity) == 0x000004, "Wrong alignment on Item_GetQuantity");
static_assert(sizeof(Item_GetQuantity) == 0x000004, "Wrong size on Item_GetQuantity");
static_assert(offsetof(Item_GetQuantity, ReturnValue) == 0x000000, "Member 'Item_GetQuantity::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetRemainingStackQuantity
// 0x0004 (0x0004 - 0x0000)
struct Item_GetRemainingStackQuantity final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetRemainingStackQuantity) == 0x000004, "Wrong alignment on Item_GetRemainingStackQuantity");
static_assert(sizeof(Item_GetRemainingStackQuantity) == 0x000004, "Wrong size on Item_GetRemainingStackQuantity");
static_assert(offsetof(Item_GetRemainingStackQuantity, ReturnValue) == 0x000000, "Member 'Item_GetRemainingStackQuantity::ReturnValue' has a wrong offset!");

// Function UnrealProject.Item.GetWeight
// 0x0004 (0x0004 - 0x0000)
struct Item_GetWeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Item_GetWeight) == 0x000004, "Wrong alignment on Item_GetWeight");
static_assert(sizeof(Item_GetWeight) == 0x000004, "Wrong size on Item_GetWeight");
static_assert(offsetof(Item_GetWeight, ReturnValue) == 0x000000, "Member 'Item_GetWeight::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDCameraModifier.ApplyCustomParameterModifier
// 0x0010 (0x0010 - 0x0000)
struct NGDCameraModifier_ApplyCustomParameterModifier final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBaseValue;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutBaseValue;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDCameraModifier_ApplyCustomParameterModifier) == 0x000004, "Wrong alignment on NGDCameraModifier_ApplyCustomParameterModifier");
static_assert(sizeof(NGDCameraModifier_ApplyCustomParameterModifier) == 0x000010, "Wrong size on NGDCameraModifier_ApplyCustomParameterModifier");
static_assert(offsetof(NGDCameraModifier_ApplyCustomParameterModifier, ParameterName) == 0x000000, "Member 'NGDCameraModifier_ApplyCustomParameterModifier::ParameterName' has a wrong offset!");
static_assert(offsetof(NGDCameraModifier_ApplyCustomParameterModifier, InBaseValue) == 0x000008, "Member 'NGDCameraModifier_ApplyCustomParameterModifier::InBaseValue' has a wrong offset!");
static_assert(offsetof(NGDCameraModifier_ApplyCustomParameterModifier, OutBaseValue) == 0x00000C, "Member 'NGDCameraModifier_ApplyCustomParameterModifier::OutBaseValue' has a wrong offset!");

// Function UnrealProject.NGDCameraModifier.BlueprintIsModifierActive
// 0x0001 (0x0001 - 0x0000)
struct NGDCameraModifier_BlueprintIsModifierActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDCameraModifier_BlueprintIsModifierActive) == 0x000001, "Wrong alignment on NGDCameraModifier_BlueprintIsModifierActive");
static_assert(sizeof(NGDCameraModifier_BlueprintIsModifierActive) == 0x000001, "Wrong size on NGDCameraModifier_BlueprintIsModifierActive");
static_assert(offsetof(NGDCameraModifier_BlueprintIsModifierActive, ReturnValue) == 0x000000, "Member 'NGDCameraModifier_BlueprintIsModifierActive::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDCameraModifier.BlueprintOverrideAlpha
// 0x0004 (0x0004 - 0x0000)
struct NGDCameraModifier_BlueprintOverrideAlpha final
{
public:
	float                                         OutNewAlpha;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDCameraModifier_BlueprintOverrideAlpha) == 0x000004, "Wrong alignment on NGDCameraModifier_BlueprintOverrideAlpha");
static_assert(sizeof(NGDCameraModifier_BlueprintOverrideAlpha) == 0x000004, "Wrong size on NGDCameraModifier_BlueprintOverrideAlpha");
static_assert(offsetof(NGDCameraModifier_BlueprintOverrideAlpha, OutNewAlpha) == 0x000000, "Member 'NGDCameraModifier_BlueprintOverrideAlpha::OutNewAlpha' has a wrong offset!");

// Function UnrealProject.NGDCameraModifier.GetRelativeTime
// 0x0004 (0x0004 - 0x0000)
struct NGDCameraModifier_GetRelativeTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDCameraModifier_GetRelativeTime) == 0x000004, "Wrong alignment on NGDCameraModifier_GetRelativeTime");
static_assert(sizeof(NGDCameraModifier_GetRelativeTime) == 0x000004, "Wrong size on NGDCameraModifier_GetRelativeTime");
static_assert(offsetof(NGDCameraModifier_GetRelativeTime, ReturnValue) == 0x000000, "Member 'NGDCameraModifier_GetRelativeTime::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.GetAttachmentContainer
// 0x0008 (0x0008 - 0x0000)
struct Equipment_GetAttachmentContainer final
{
public:
	class UNGDAttachmentContainerComponent*       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_GetAttachmentContainer) == 0x000008, "Wrong alignment on Equipment_GetAttachmentContainer");
static_assert(sizeof(Equipment_GetAttachmentContainer) == 0x000008, "Wrong size on Equipment_GetAttachmentContainer");
static_assert(offsetof(Equipment_GetAttachmentContainer, ReturnValue) == 0x000000, "Member 'Equipment_GetAttachmentContainer::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.GetBodyAttachSocket
// 0x0008 (0x0008 - 0x0000)
struct Equipment_GetBodyAttachSocket final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_GetBodyAttachSocket) == 0x000004, "Wrong alignment on Equipment_GetBodyAttachSocket");
static_assert(sizeof(Equipment_GetBodyAttachSocket) == 0x000008, "Wrong size on Equipment_GetBodyAttachSocket");
static_assert(offsetof(Equipment_GetBodyAttachSocket, ReturnValue) == 0x000000, "Member 'Equipment_GetBodyAttachSocket::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.GetMeshTP
// 0x0008 (0x0008 - 0x0000)
struct Equipment_GetMeshTP final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_GetMeshTP) == 0x000008, "Wrong alignment on Equipment_GetMeshTP");
static_assert(sizeof(Equipment_GetMeshTP) == 0x000008, "Wrong size on Equipment_GetMeshTP");
static_assert(offsetof(Equipment_GetMeshTP, ReturnValue) == 0x000000, "Member 'Equipment_GetMeshTP::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.GetSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct Equipment_GetSlotIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_GetSlotIndex) == 0x000004, "Wrong alignment on Equipment_GetSlotIndex");
static_assert(sizeof(Equipment_GetSlotIndex) == 0x000004, "Wrong size on Equipment_GetSlotIndex");
static_assert(offsetof(Equipment_GetSlotIndex, ReturnValue) == 0x000000, "Member 'Equipment_GetSlotIndex::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.GetSlotType
// 0x0010 (0x0010 - 0x0000)
struct Equipment_GetSlotType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_GetSlotType) == 0x000008, "Wrong alignment on Equipment_GetSlotType");
static_assert(sizeof(Equipment_GetSlotType) == 0x000010, "Wrong size on Equipment_GetSlotType");
static_assert(offsetof(Equipment_GetSlotType, ReturnValue) == 0x000000, "Member 'Equipment_GetSlotType::ReturnValue' has a wrong offset!");

// Function UnrealProject.Equipment.IsConsumable
// 0x0001 (0x0001 - 0x0000)
struct Equipment_IsConsumable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Equipment_IsConsumable) == 0x000001, "Wrong alignment on Equipment_IsConsumable");
static_assert(sizeof(Equipment_IsConsumable) == 0x000001, "Wrong size on Equipment_IsConsumable");
static_assert(offsetof(Equipment_IsConsumable, ReturnValue) == 0x000000, "Member 'Equipment_IsConsumable::ReturnValue' has a wrong offset!");

// Function UnrealProject.Action.CreateActionOfClass
// 0x0040 (0x0040 - 0x0000)
struct Action_CreateActionOfClass final
{
public:
	struct FActionParams                          ActionParams;                                      // 0x0000(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UAction>                    ActionClass;                                       // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAction*                                ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Action_CreateActionOfClass) == 0x000008, "Wrong alignment on Action_CreateActionOfClass");
static_assert(sizeof(Action_CreateActionOfClass) == 0x000040, "Wrong size on Action_CreateActionOfClass");
static_assert(offsetof(Action_CreateActionOfClass, ActionParams) == 0x000000, "Member 'Action_CreateActionOfClass::ActionParams' has a wrong offset!");
static_assert(offsetof(Action_CreateActionOfClass, ActionClass) == 0x000030, "Member 'Action_CreateActionOfClass::ActionClass' has a wrong offset!");
static_assert(offsetof(Action_CreateActionOfClass, ReturnValue) == 0x000038, "Member 'Action_CreateActionOfClass::ReturnValue' has a wrong offset!");

// Function UnrealProject.Action.BroadcastUpdateAction
// 0x0004 (0x0004 - 0x0000)
struct Action_BroadcastUpdateAction final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Action_BroadcastUpdateAction) == 0x000004, "Wrong alignment on Action_BroadcastUpdateAction");
static_assert(sizeof(Action_BroadcastUpdateAction) == 0x000004, "Wrong size on Action_BroadcastUpdateAction");
static_assert(offsetof(Action_BroadcastUpdateAction, Delta) == 0x000000, "Member 'Action_BroadcastUpdateAction::Delta' has a wrong offset!");

// Function UnrealProject.Action.Initialize
// 0x0030 (0x0030 - 0x0000)
struct Action_Initialize final
{
public:
	struct FActionParams                          ActionParams;                                      // 0x0000(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(Action_Initialize) == 0x000008, "Wrong alignment on Action_Initialize");
static_assert(sizeof(Action_Initialize) == 0x000030, "Wrong size on Action_Initialize");
static_assert(offsetof(Action_Initialize, ActionParams) == 0x000000, "Member 'Action_Initialize::ActionParams' has a wrong offset!");

// Function UnrealProject.Action.Update
// 0x0004 (0x0004 - 0x0000)
struct Action_Update final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Action_Update) == 0x000004, "Wrong alignment on Action_Update");
static_assert(sizeof(Action_Update) == 0x000004, "Wrong size on Action_Update");
static_assert(offsetof(Action_Update, Delta) == 0x000000, "Member 'Action_Update::Delta' has a wrong offset!");

// Function UnrealProject.StartAimingAction.EventUpdate
// 0x0004 (0x0004 - 0x0000)
struct StartAimingAction_EventUpdate final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StartAimingAction_EventUpdate) == 0x000004, "Wrong alignment on StartAimingAction_EventUpdate");
static_assert(sizeof(StartAimingAction_EventUpdate) == 0x000004, "Wrong size on StartAimingAction_EventUpdate");
static_assert(offsetof(StartAimingAction_EventUpdate, Delta) == 0x000000, "Member 'StartAimingAction_EventUpdate::Delta' has a wrong offset!");

// Function UnrealProject.StartAimingAction.Initialize_Implementation
// 0x0030 (0x0030 - 0x0000)
struct StartAimingAction_Initialize_Implementation final
{
public:
	struct FActionParams                          ActionParams;                                      // 0x0000(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(StartAimingAction_Initialize_Implementation) == 0x000008, "Wrong alignment on StartAimingAction_Initialize_Implementation");
static_assert(sizeof(StartAimingAction_Initialize_Implementation) == 0x000030, "Wrong size on StartAimingAction_Initialize_Implementation");
static_assert(offsetof(StartAimingAction_Initialize_Implementation, ActionParams) == 0x000000, "Member 'StartAimingAction_Initialize_Implementation::ActionParams' has a wrong offset!");

// Function UnrealProject.NGDAkComponent.Play
// 0x0020 (0x0020 - 0x0000)
struct NGDAkComponent_Play final
{
public:
	class AActor*                                 InContextActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Callback;     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NGDAkComponent_Play) == 0x000008, "Wrong alignment on NGDAkComponent_Play");
static_assert(sizeof(NGDAkComponent_Play) == 0x000020, "Wrong size on NGDAkComponent_Play");
static_assert(offsetof(NGDAkComponent_Play, InContextActor) == 0x000000, "Member 'NGDAkComponent_Play::InContextActor' has a wrong offset!");
static_assert(offsetof(NGDAkComponent_Play, Callback) == 0x000008, "Member 'NGDAkComponent_Play::Callback' has a wrong offset!");
static_assert(offsetof(NGDAkComponent_Play, ReturnValue) == 0x000018, "Member 'NGDAkComponent_Play::ReturnValue' has a wrong offset!");

// Function UnrealProject.Attachment.IsAttached
// 0x0001 (0x0001 - 0x0000)
struct Attachment_IsAttached final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Attachment_IsAttached) == 0x000001, "Wrong alignment on Attachment_IsAttached");
static_assert(sizeof(Attachment_IsAttached) == 0x000001, "Wrong size on Attachment_IsAttached");
static_assert(offsetof(Attachment_IsAttached, ReturnValue) == 0x000000, "Member 'Attachment_IsAttached::ReturnValue' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.Aim
// 0x0010 (0x0010 - 0x0000)
struct PlayTestComponent_Aim final
{
public:
	struct FVector                                AimToLocation;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_Aim) == 0x000004, "Wrong alignment on PlayTestComponent_Aim");
static_assert(sizeof(PlayTestComponent_Aim) == 0x000010, "Wrong size on PlayTestComponent_Aim");
static_assert(offsetof(PlayTestComponent_Aim, AimToLocation) == 0x000000, "Member 'PlayTestComponent_Aim::AimToLocation' has a wrong offset!");
static_assert(offsetof(PlayTestComponent_Aim, DeltaTime) == 0x00000C, "Member 'PlayTestComponent_Aim::DeltaTime' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.CheckLineOfSight
// 0x0010 (0x0010 - 0x0000)
struct PlayTestComponent_CheckLineOfSight final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PlayTestComponent_CheckLineOfSight) == 0x000008, "Wrong alignment on PlayTestComponent_CheckLineOfSight");
static_assert(sizeof(PlayTestComponent_CheckLineOfSight) == 0x000010, "Wrong size on PlayTestComponent_CheckLineOfSight");
static_assert(offsetof(PlayTestComponent_CheckLineOfSight, OtherActor) == 0x000000, "Member 'PlayTestComponent_CheckLineOfSight::OtherActor' has a wrong offset!");
static_assert(offsetof(PlayTestComponent_CheckLineOfSight, ReturnValue) == 0x000008, "Member 'PlayTestComponent_CheckLineOfSight::ReturnValue' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.CrashTest
// 0x0010 (0x0010 - 0x0000)
struct PlayTestComponent_CrashTest final
{
public:
	class FString                                 CrashMessage;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_CrashTest) == 0x000008, "Wrong alignment on PlayTestComponent_CrashTest");
static_assert(sizeof(PlayTestComponent_CrashTest) == 0x000010, "Wrong size on PlayTestComponent_CrashTest");
static_assert(offsetof(PlayTestComponent_CrashTest, CrashMessage) == 0x000000, "Member 'PlayTestComponent_CrashTest::CrashMessage' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.GetClosestEnemy
// 0x0008 (0x0008 - 0x0000)
struct PlayTestComponent_GetClosestEnemy final
{
public:
	class ANGDCharacter*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_GetClosestEnemy) == 0x000008, "Wrong alignment on PlayTestComponent_GetClosestEnemy");
static_assert(sizeof(PlayTestComponent_GetClosestEnemy) == 0x000008, "Wrong size on PlayTestComponent_GetClosestEnemy");
static_assert(offsetof(PlayTestComponent_GetClosestEnemy, ReturnValue) == 0x000000, "Member 'PlayTestComponent_GetClosestEnemy::ReturnValue' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.ProjectPointToRandomReachableNavMesh
// 0x001C (0x001C - 0x0000)
struct PlayTestComponent_ProjectPointToRandomReachableNavMesh final
{
public:
	struct FVector                                PointToProject;                                    // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomRadius;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_ProjectPointToRandomReachableNavMesh) == 0x000004, "Wrong alignment on PlayTestComponent_ProjectPointToRandomReachableNavMesh");
static_assert(sizeof(PlayTestComponent_ProjectPointToRandomReachableNavMesh) == 0x00001C, "Wrong size on PlayTestComponent_ProjectPointToRandomReachableNavMesh");
static_assert(offsetof(PlayTestComponent_ProjectPointToRandomReachableNavMesh, PointToProject) == 0x000000, "Member 'PlayTestComponent_ProjectPointToRandomReachableNavMesh::PointToProject' has a wrong offset!");
static_assert(offsetof(PlayTestComponent_ProjectPointToRandomReachableNavMesh, RandomRadius) == 0x00000C, "Member 'PlayTestComponent_ProjectPointToRandomReachableNavMesh::RandomRadius' has a wrong offset!");
static_assert(offsetof(PlayTestComponent_ProjectPointToRandomReachableNavMesh, ReturnValue) == 0x000010, "Member 'PlayTestComponent_ProjectPointToRandomReachableNavMesh::ReturnValue' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.ServerTeleportPlayerToNavMeshLocation
// 0x000C (0x000C - 0x0000)
struct PlayTestComponent_ServerTeleportPlayerToNavMeshLocation final
{
public:
	struct FVector                                Destination;                                       // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_ServerTeleportPlayerToNavMeshLocation) == 0x000004, "Wrong alignment on PlayTestComponent_ServerTeleportPlayerToNavMeshLocation");
static_assert(sizeof(PlayTestComponent_ServerTeleportPlayerToNavMeshLocation) == 0x00000C, "Wrong size on PlayTestComponent_ServerTeleportPlayerToNavMeshLocation");
static_assert(offsetof(PlayTestComponent_ServerTeleportPlayerToNavMeshLocation, Destination) == 0x000000, "Member 'PlayTestComponent_ServerTeleportPlayerToNavMeshLocation::Destination' has a wrong offset!");

// Function UnrealProject.PlayTestComponent.SetNewMoveDestination
// 0x000C (0x000C - 0x0000)
struct PlayTestComponent_SetNewMoveDestination final
{
public:
	struct FVector                                LocationToGo;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PlayTestComponent_SetNewMoveDestination) == 0x000004, "Wrong alignment on PlayTestComponent_SetNewMoveDestination");
static_assert(sizeof(PlayTestComponent_SetNewMoveDestination) == 0x00000C, "Wrong size on PlayTestComponent_SetNewMoveDestination");
static_assert(offsetof(PlayTestComponent_SetNewMoveDestination, LocationToGo) == 0x000000, "Member 'PlayTestComponent_SetNewMoveDestination::LocationToGo' has a wrong offset!");

// Function UnrealProject.BarsManager.AddBar
// 0x0028 (0x0028 - 0x0000)
struct BarsManager_AddBar final
{
public:
	class UObject*                                InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFloatValueToShow>              FloatsToShow;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBarObject*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BarsManager_AddBar) == 0x000008, "Wrong alignment on BarsManager_AddBar");
static_assert(sizeof(BarsManager_AddBar) == 0x000028, "Wrong size on BarsManager_AddBar");
static_assert(offsetof(BarsManager_AddBar, InContext) == 0x000000, "Member 'BarsManager_AddBar::InContext' has a wrong offset!");
static_assert(offsetof(BarsManager_AddBar, FloatsToShow) == 0x000008, "Member 'BarsManager_AddBar::FloatsToShow' has a wrong offset!");
static_assert(offsetof(BarsManager_AddBar, Position) == 0x000018, "Member 'BarsManager_AddBar::Position' has a wrong offset!");
static_assert(offsetof(BarsManager_AddBar, ReturnValue) == 0x000020, "Member 'BarsManager_AddBar::ReturnValue' has a wrong offset!");

// Function UnrealProject.ThrowableProjectile.ProjectileOnHit
// 0x00B0 (0x00B0 - 0x0000)
struct ThrowableProjectile_ProjectileOnHit final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ThrowableProjectile_ProjectileOnHit) == 0x000008, "Wrong alignment on ThrowableProjectile_ProjectileOnHit");
static_assert(sizeof(ThrowableProjectile_ProjectileOnHit) == 0x0000B0, "Wrong size on ThrowableProjectile_ProjectileOnHit");
static_assert(offsetof(ThrowableProjectile_ProjectileOnHit, HitComp) == 0x000000, "Member 'ThrowableProjectile_ProjectileOnHit::HitComp' has a wrong offset!");
static_assert(offsetof(ThrowableProjectile_ProjectileOnHit, OtherActor) == 0x000008, "Member 'ThrowableProjectile_ProjectileOnHit::OtherActor' has a wrong offset!");
static_assert(offsetof(ThrowableProjectile_ProjectileOnHit, OtherComp) == 0x000010, "Member 'ThrowableProjectile_ProjectileOnHit::OtherComp' has a wrong offset!");
static_assert(offsetof(ThrowableProjectile_ProjectileOnHit, NormalImpulse) == 0x000018, "Member 'ThrowableProjectile_ProjectileOnHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(ThrowableProjectile_ProjectileOnHit, Hit) == 0x000024, "Member 'ThrowableProjectile_ProjectileOnHit::Hit' has a wrong offset!");

// Function UnrealProject.ThrowableProjectile.SetInstigator
// 0x0008 (0x0008 - 0x0000)
struct ThrowableProjectile_SetInstigator final
{
public:
	class AController*                            InInstigator;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThrowableProjectile_SetInstigator) == 0x000008, "Wrong alignment on ThrowableProjectile_SetInstigator");
static_assert(sizeof(ThrowableProjectile_SetInstigator) == 0x000008, "Wrong size on ThrowableProjectile_SetInstigator");
static_assert(offsetof(ThrowableProjectile_SetInstigator, InInstigator) == 0x000000, "Member 'ThrowableProjectile_SetInstigator::InInstigator' has a wrong offset!");

// Function UnrealProject.ThrowableProjectile.TryGetOwnerWeapon
// 0x0008 (0x0008 - 0x0000)
struct ThrowableProjectile_TryGetOwnerWeapon final
{
public:
	class AWeapon*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThrowableProjectile_TryGetOwnerWeapon) == 0x000008, "Wrong alignment on ThrowableProjectile_TryGetOwnerWeapon");
static_assert(sizeof(ThrowableProjectile_TryGetOwnerWeapon) == 0x000008, "Wrong size on ThrowableProjectile_TryGetOwnerWeapon");
static_assert(offsetof(ThrowableProjectile_TryGetOwnerWeapon, ReturnValue) == 0x000000, "Member 'ThrowableProjectile_TryGetOwnerWeapon::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDAttachmentContainerComponent.ServerAttachToSlot
// 0x0010 (0x0010 - 0x0000)
struct NGDAttachmentContainerComponent_ServerAttachToSlot final
{
public:
	class AAttachment*                            InAttachment;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NGDAttachmentContainerComponent_ServerAttachToSlot) == 0x000008, "Wrong alignment on NGDAttachmentContainerComponent_ServerAttachToSlot");
static_assert(sizeof(NGDAttachmentContainerComponent_ServerAttachToSlot) == 0x000010, "Wrong size on NGDAttachmentContainerComponent_ServerAttachToSlot");
static_assert(offsetof(NGDAttachmentContainerComponent_ServerAttachToSlot, InAttachment) == 0x000000, "Member 'NGDAttachmentContainerComponent_ServerAttachToSlot::InAttachment' has a wrong offset!");
static_assert(offsetof(NGDAttachmentContainerComponent_ServerAttachToSlot, SlotIndex) == 0x000008, "Member 'NGDAttachmentContainerComponent_ServerAttachToSlot::SlotIndex' has a wrong offset!");

// Function UnrealProject.NGDAttachmentContainerComponent.ServerAutoAttach
// 0x0008 (0x0008 - 0x0000)
struct NGDAttachmentContainerComponent_ServerAutoAttach final
{
public:
	class AAttachment*                            InAttachment;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDAttachmentContainerComponent_ServerAutoAttach) == 0x000008, "Wrong alignment on NGDAttachmentContainerComponent_ServerAutoAttach");
static_assert(sizeof(NGDAttachmentContainerComponent_ServerAutoAttach) == 0x000008, "Wrong size on NGDAttachmentContainerComponent_ServerAutoAttach");
static_assert(offsetof(NGDAttachmentContainerComponent_ServerAutoAttach, InAttachment) == 0x000000, "Member 'NGDAttachmentContainerComponent_ServerAutoAttach::InAttachment' has a wrong offset!");

// Function UnrealProject.NGDAttachmentContainerComponent.ServerDetach
// 0x0008 (0x0008 - 0x0000)
struct NGDAttachmentContainerComponent_ServerDetach final
{
public:
	class AAttachment*                            InAttachment;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDAttachmentContainerComponent_ServerDetach) == 0x000008, "Wrong alignment on NGDAttachmentContainerComponent_ServerDetach");
static_assert(sizeof(NGDAttachmentContainerComponent_ServerDetach) == 0x000008, "Wrong size on NGDAttachmentContainerComponent_ServerDetach");
static_assert(offsetof(NGDAttachmentContainerComponent_ServerDetach, InAttachment) == 0x000000, "Member 'NGDAttachmentContainerComponent_ServerDetach::InAttachment' has a wrong offset!");

// Function UnrealProject.NGDAttachmentContainerComponent.CanBeAttached
// 0x0010 (0x0010 - 0x0000)
struct NGDAttachmentContainerComponent_CanBeAttached final
{
public:
	class AAttachment*                            Attachment;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NGDAttachmentContainerComponent_CanBeAttached) == 0x000008, "Wrong alignment on NGDAttachmentContainerComponent_CanBeAttached");
static_assert(sizeof(NGDAttachmentContainerComponent_CanBeAttached) == 0x000010, "Wrong size on NGDAttachmentContainerComponent_CanBeAttached");
static_assert(offsetof(NGDAttachmentContainerComponent_CanBeAttached, Attachment) == 0x000000, "Member 'NGDAttachmentContainerComponent_CanBeAttached::Attachment' has a wrong offset!");
static_assert(offsetof(NGDAttachmentContainerComponent_CanBeAttached, ReturnValue) == 0x000008, "Member 'NGDAttachmentContainerComponent_CanBeAttached::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.OnDeath
// 0x0050 (0x0050 - 0x0000)
struct NGDWheeledVehicle_OnDeath final
{
public:
	struct FNGDDamageEvent                        DamageEvent;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_OnDeath) == 0x000008, "Wrong alignment on NGDWheeledVehicle_OnDeath");
static_assert(sizeof(NGDWheeledVehicle_OnDeath) == 0x000050, "Wrong size on NGDWheeledVehicle_OnDeath");
static_assert(offsetof(NGDWheeledVehicle_OnDeath, DamageEvent) == 0x000000, "Member 'NGDWheeledVehicle_OnDeath::DamageEvent' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnDeath, EventInstigator) == 0x000040, "Member 'NGDWheeledVehicle_OnDeath::EventInstigator' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnDeath, DamageCauser) == 0x000048, "Member 'NGDWheeledVehicle_OnDeath::DamageCauser' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.OnRunOverBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct NGDWheeledVehicle_OnRunOverBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_OnRunOverBeginOverlap) == 0x000008, "Wrong alignment on NGDWheeledVehicle_OnRunOverBeginOverlap");
static_assert(sizeof(NGDWheeledVehicle_OnRunOverBeginOverlap) == 0x0000A8, "Wrong size on NGDWheeledVehicle_OnRunOverBeginOverlap");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, OverlappedComponent) == 0x000000, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, OtherActor) == 0x000008, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, OtherComp) == 0x000010, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, bFromSweep) == 0x00001C, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnRunOverBeginOverlap, SweepResult) == 0x000020, "Member 'NGDWheeledVehicle_OnRunOverBeginOverlap::SweepResult' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.OnSimpleCollisionHit
// 0x00B0 (0x00B0 - 0x0000)
struct NGDWheeledVehicle_OnSimpleCollisionHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NGDWheeledVehicle_OnSimpleCollisionHit) == 0x000008, "Wrong alignment on NGDWheeledVehicle_OnSimpleCollisionHit");
static_assert(sizeof(NGDWheeledVehicle_OnSimpleCollisionHit) == 0x0000B0, "Wrong size on NGDWheeledVehicle_OnSimpleCollisionHit");
static_assert(offsetof(NGDWheeledVehicle_OnSimpleCollisionHit, HitComponent) == 0x000000, "Member 'NGDWheeledVehicle_OnSimpleCollisionHit::HitComponent' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnSimpleCollisionHit, OtherActor) == 0x000008, "Member 'NGDWheeledVehicle_OnSimpleCollisionHit::OtherActor' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnSimpleCollisionHit, OtherComp) == 0x000010, "Member 'NGDWheeledVehicle_OnSimpleCollisionHit::OtherComp' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnSimpleCollisionHit, NormalImpulse) == 0x000018, "Member 'NGDWheeledVehicle_OnSimpleCollisionHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnSimpleCollisionHit, Hit) == 0x000024, "Member 'NGDWheeledVehicle_OnSimpleCollisionHit::Hit' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.OnTakeDamage
// 0x0060 (0x0060 - 0x0000)
struct NGDWheeledVehicle_OnTakeDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNGDDamageEvent                        DamageEvent;                                       // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0048(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NGDWheeledVehicle_OnTakeDamage) == 0x000008, "Wrong alignment on NGDWheeledVehicle_OnTakeDamage");
static_assert(sizeof(NGDWheeledVehicle_OnTakeDamage) == 0x000060, "Wrong size on NGDWheeledVehicle_OnTakeDamage");
static_assert(offsetof(NGDWheeledVehicle_OnTakeDamage, Damage) == 0x000000, "Member 'NGDWheeledVehicle_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnTakeDamage, DamageEvent) == 0x000008, "Member 'NGDWheeledVehicle_OnTakeDamage::DamageEvent' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnTakeDamage, EventInstigator) == 0x000048, "Member 'NGDWheeledVehicle_OnTakeDamage::EventInstigator' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnTakeDamage, DamageCauser) == 0x000050, "Member 'NGDWheeledVehicle_OnTakeDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(NGDWheeledVehicle_OnTakeDamage, ReturnValue) == 0x000058, "Member 'NGDWheeledVehicle_OnTakeDamage::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.ServerNotifyLocalRunOverEvent
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_ServerNotifyLocalRunOverEvent final
{
public:
	class ANGDCharacter*                          Victim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_ServerNotifyLocalRunOverEvent) == 0x000008, "Wrong alignment on NGDWheeledVehicle_ServerNotifyLocalRunOverEvent");
static_assert(sizeof(NGDWheeledVehicle_ServerNotifyLocalRunOverEvent) == 0x000008, "Wrong size on NGDWheeledVehicle_ServerNotifyLocalRunOverEvent");
static_assert(offsetof(NGDWheeledVehicle_ServerNotifyLocalRunOverEvent, Victim) == 0x000000, "Member 'NGDWheeledVehicle_ServerNotifyLocalRunOverEvent::Victim' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.GetHitRegistrationCollider
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_GetHitRegistrationCollider final
{
public:
	class UCapsuleComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_GetHitRegistrationCollider) == 0x000008, "Wrong alignment on NGDWheeledVehicle_GetHitRegistrationCollider");
static_assert(sizeof(NGDWheeledVehicle_GetHitRegistrationCollider) == 0x000008, "Wrong size on NGDWheeledVehicle_GetHitRegistrationCollider");
static_assert(offsetof(NGDWheeledVehicle_GetHitRegistrationCollider, ReturnValue) == 0x000000, "Member 'NGDWheeledVehicle_GetHitRegistrationCollider::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.GetMortalityComponent
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_GetMortalityComponent final
{
public:
	class UNGDMortalityComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_GetMortalityComponent) == 0x000008, "Wrong alignment on NGDWheeledVehicle_GetMortalityComponent");
static_assert(sizeof(NGDWheeledVehicle_GetMortalityComponent) == 0x000008, "Wrong size on NGDWheeledVehicle_GetMortalityComponent");
static_assert(offsetof(NGDWheeledVehicle_GetMortalityComponent, ReturnValue) == 0x000000, "Member 'NGDWheeledVehicle_GetMortalityComponent::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.GetRewindableMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_GetRewindableMeshComponent final
{
public:
	class UMeshComponent*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_GetRewindableMeshComponent) == 0x000008, "Wrong alignment on NGDWheeledVehicle_GetRewindableMeshComponent");
static_assert(sizeof(NGDWheeledVehicle_GetRewindableMeshComponent) == 0x000008, "Wrong size on NGDWheeledVehicle_GetRewindableMeshComponent");
static_assert(offsetof(NGDWheeledVehicle_GetRewindableMeshComponent, ReturnValue) == 0x000000, "Member 'NGDWheeledVehicle_GetRewindableMeshComponent::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.GetRewindCollider
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_GetRewindCollider final
{
public:
	class UCapsuleComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_GetRewindCollider) == 0x000008, "Wrong alignment on NGDWheeledVehicle_GetRewindCollider");
static_assert(sizeof(NGDWheeledVehicle_GetRewindCollider) == 0x000008, "Wrong size on NGDWheeledVehicle_GetRewindCollider");
static_assert(offsetof(NGDWheeledVehicle_GetRewindCollider, ReturnValue) == 0x000000, "Member 'NGDWheeledVehicle_GetRewindCollider::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.GetRewindComponent
// 0x0008 (0x0008 - 0x0000)
struct NGDWheeledVehicle_GetRewindComponent final
{
public:
	class UNGDRewindComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NGDWheeledVehicle_GetRewindComponent) == 0x000008, "Wrong alignment on NGDWheeledVehicle_GetRewindComponent");
static_assert(sizeof(NGDWheeledVehicle_GetRewindComponent) == 0x000008, "Wrong size on NGDWheeledVehicle_GetRewindComponent");
static_assert(offsetof(NGDWheeledVehicle_GetRewindComponent, ReturnValue) == 0x000000, "Member 'NGDWheeledVehicle_GetRewindComponent::ReturnValue' has a wrong offset!");

// Function UnrealProject.NGDWheeledVehicle.IsRewindRelevant
// 0x0001 (0x0001 - 0x0000)
