#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CooldownCounter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TimeWatch_structs.hpp"


namespace SDK::Params
{

// Function WC_CooldownCounter.WC_CooldownCounter_C.ExecuteUbergraph_WC_CooldownCounter
// 0x0138 (0x0138 - 0x0000)
struct WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldTriggerFadeOut_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0080(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0018)()
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	EFluxCapacitorStates                          K2Node_CustomEvent_OldState;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          K2Node_CustomEvent_NewState;                       // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldTriggerFadeIn_ReturnValue;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter) == 0x000008, "Wrong alignment on WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter");
static_assert(sizeof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter) == 0x000138, "Wrong size on WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, EntryPoint) == 0x000000, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_ShouldTriggerFadeOut_ReturnValue) == 0x000004, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_ShouldTriggerFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_Event_MyGeometry) == 0x000008, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000050, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_FCeil_ReturnValue) == 0x00005C, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000060, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_FloatToText_ReturnValue) == 0x000080, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000A8, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E0, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000F0, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x0000F8, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_PostSound_ReturnValue) == 0x000100, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_CustomEvent_OldState) == 0x000118, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_CustomEvent_OldState' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, K2Node_CustomEvent_NewState) == 0x000119, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00011A, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00011B, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00011C, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_BooleanOR_ReturnValue) == 0x00011D, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_BooleanOR_ReturnValue_1) == 0x00011E, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_PlayAnimation_ReturnValue_2) == 0x000128, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000131, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter, CallFunc_ShouldTriggerFadeIn_ReturnValue) == 0x000132, "Member 'WC_CooldownCounter_C_ExecuteUbergraph_WC_CooldownCounter::CallFunc_ShouldTriggerFadeIn_ReturnValue' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.OnGameStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WC_CooldownCounter_C_OnGameStateChanged final
{
public:
	EFluxCapacitorStates                          OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CooldownCounter_C_OnGameStateChanged) == 0x000001, "Wrong alignment on WC_CooldownCounter_C_OnGameStateChanged");
static_assert(sizeof(WC_CooldownCounter_C_OnGameStateChanged) == 0x000002, "Wrong size on WC_CooldownCounter_C_OnGameStateChanged");
static_assert(offsetof(WC_CooldownCounter_C_OnGameStateChanged, OldState) == 0x000000, "Member 'WC_CooldownCounter_C_OnGameStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_OnGameStateChanged, NewState) == 0x000001, "Member 'WC_CooldownCounter_C_OnGameStateChanged::NewState' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_CooldownCounter_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CooldownCounter_C_Tick) == 0x000004, "Wrong alignment on WC_CooldownCounter_C_Tick");
static_assert(sizeof(WC_CooldownCounter_C_Tick) == 0x00003C, "Wrong size on WC_CooldownCounter_C_Tick");
static_assert(offsetof(WC_CooldownCounter_C_Tick, MyGeometry) == 0x000000, "Member 'WC_CooldownCounter_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_CooldownCounter_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.UpdateTimer
// 0x0068 (0x0068 - 0x0000)
struct WC_CooldownCounter_C_UpdateTimer final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0038(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_CooldownCounter_C_UpdateTimer) == 0x000008, "Wrong alignment on WC_CooldownCounter_C_UpdateTimer");
static_assert(sizeof(WC_CooldownCounter_C_UpdateTimer) == 0x000068, "Wrong size on WC_CooldownCounter_C_UpdateTimer");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_Conv_StringToInt_ReturnValue) == 0x000030, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_Conv_FloatToText_ReturnValue) == 0x000038, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000050, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000060, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_UpdateTimer, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000064, "Member 'WC_CooldownCounter_C_UpdateTimer::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.PlayCountdownSound
// 0x0050 (0x0050 - 0x0000)
struct WC_CooldownCounter_C_PlayCountdownSound final
{
public:
	int32                                         Second;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue_1;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CooldownCounter_C_PlayCountdownSound) == 0x000008, "Wrong alignment on WC_CooldownCounter_C_PlayCountdownSound");
static_assert(sizeof(WC_CooldownCounter_C_PlayCountdownSound) == 0x000050, "Wrong size on WC_CooldownCounter_C_PlayCountdownSound");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, Second) == 0x000000, "Member 'WC_CooldownCounter_C_PlayCountdownSound::Second' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WC_CooldownCounter_C_PlayCountdownSound::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000018, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_PostSound_ReturnValue) == 0x000030, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_MakeVector_ReturnValue_1) == 0x000038, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_PlayCountdownSound, CallFunc_PostSound_ReturnValue_1) == 0x000048, "Member 'WC_CooldownCounter_C_PlayCountdownSound::CallFunc_PostSound_ReturnValue_1' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.ShouldTriggerFadeIn
// 0x0010 (0x0010 - 0x0000)
struct WC_CooldownCounter_C_ShouldTriggerFadeIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_CooldownCounter_C_ShouldTriggerFadeIn) == 0x000004, "Wrong alignment on WC_CooldownCounter_C_ShouldTriggerFadeIn");
static_assert(sizeof(WC_CooldownCounter_C_ShouldTriggerFadeIn) == 0x000010, "Wrong size on WC_CooldownCounter_C_ShouldTriggerFadeIn");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, ReturnValue) == 0x000000, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_GetRenderOpacity_ReturnValue) == 0x000004, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00000A, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeIn, CallFunc_BooleanAND_ReturnValue_1) == 0x00000D, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeIn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WC_CooldownCounter.WC_CooldownCounter_C.ShouldTriggerFadeOut
// 0x0014 (0x0014 - 0x0000)
struct WC_CooldownCounter_C_ShouldTriggerFadeOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_CooldownCounter_C_ShouldTriggerFadeOut) == 0x000004, "Wrong alignment on WC_CooldownCounter_C_ShouldTriggerFadeOut");
static_assert(sizeof(WC_CooldownCounter_C_ShouldTriggerFadeOut) == 0x000014, "Wrong size on WC_CooldownCounter_C_ShouldTriggerFadeOut");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeOut, ReturnValue) == 0x000000, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeOut::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeOut, CallFunc_GetEndTime_ReturnValue) == 0x000004, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeOut::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CooldownCounter_C_ShouldTriggerFadeOut, CallFunc_GetRenderOpacity_ReturnValue) == 0x000008, "Member 'WC_CooldownCounter_C_ShouldTriggerFadeOut::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
