#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CornerPlayerProfile

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_CornerPlayerProfile.WC_CornerPlayerProfile_C
// 0x0040 (0x02E8 - 0x02A8)
class UWC_CornerPlayerProfile_C final : public UWidgetContainerCornerPlayerProfile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_1;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_185;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_785;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_AvatarStroke;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_114;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_Party_C*                        Widget_Party;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_CornerPlayerProfile(int32 EntryPoint);
	void FriendListButton_Unhovered();
	void FriendListButton_OnHovered();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_CornerPlayerProfile_C">();
	}
	static class UWC_CornerPlayerProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_CornerPlayerProfile_C>();
	}
};
static_assert(alignof(UWC_CornerPlayerProfile_C) == 0x000008, "Wrong alignment on UWC_CornerPlayerProfile_C");
static_assert(sizeof(UWC_CornerPlayerProfile_C) == 0x0002E8, "Wrong size on UWC_CornerPlayerProfile_C");
static_assert(offsetof(UWC_CornerPlayerProfile_C, UberGraphFrame) == 0x0002A8, "Member 'UWC_CornerPlayerProfile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, HorizontalBox_1) == 0x0002B0, "Member 'UWC_CornerPlayerProfile_C::HorizontalBox_1' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, Image_185) == 0x0002B8, "Member 'UWC_CornerPlayerProfile_C::Image_185' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, Image_785) == 0x0002C0, "Member 'UWC_CornerPlayerProfile_C::Image_785' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, Image_AvatarStroke) == 0x0002C8, "Member 'UWC_CornerPlayerProfile_C::Image_AvatarStroke' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, Image_Background) == 0x0002D0, "Member 'UWC_CornerPlayerProfile_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, RetainerBox_114) == 0x0002D8, "Member 'UWC_CornerPlayerProfile_C::RetainerBox_114' has a wrong offset!");
static_assert(offsetof(UWC_CornerPlayerProfile_C, Widget_Party) == 0x0002E0, "Member 'UWC_CornerPlayerProfile_C::Widget_Party' has a wrong offset!");

}

