#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_Credits

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_Credits.WC_Credits_C.ExecuteUbergraph_WC_Credits
// 0x00D0 (0x00D0 - 0x0000)
struct WC_Credits_C_ExecuteUbergraph_WC_Credits final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentYAlignment_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentYAlignment_ReturnValue_1;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentYAlignment_ReturnValue_2;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDilationFactor_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentYAlignment_ReturnValue_3;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_Credits_C_ExecuteUbergraph_WC_Credits) == 0x000008, "Wrong alignment on WC_Credits_C_ExecuteUbergraph_WC_Credits");
static_assert(sizeof(WC_Credits_C_ExecuteUbergraph_WC_Credits) == 0x0000D0, "Wrong size on WC_Credits_C_ExecuteUbergraph_WC_Credits");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, EntryPoint) == 0x000000, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, Temp_bool_IsClosed_Variable) == 0x000015, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, K2Node_Event_MyGeometry) == 0x000018, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, K2Node_Event_Animation) == 0x000058, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00006C, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000070, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetCurrentYAlignment_ReturnValue) == 0x000078, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetCurrentYAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_MakeVector2D_ReturnValue) == 0x00007C, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000084, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetCurrentYAlignment_ReturnValue_1) == 0x000088, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetCurrentYAlignment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_Add_FloatFloat_ReturnValue) == 0x000094, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetCurrentYAlignment_ReturnValue_2) == 0x000098, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetCurrentYAlignment_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetDilationFactor_ReturnValue) == 0x00009C, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetDilationFactor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetFloatValue_ReturnValue) == 0x0000A4, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000A8, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000B0, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B4, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetCurrentYAlignment_ReturnValue_3) == 0x0000B8, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetCurrentYAlignment_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_GetFloatValue_ReturnValue_2) == 0x0000BC, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C0, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0000C8, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_ExecuteUbergraph_WC_Credits, CallFunc_BooleanAND_ReturnValue) == 0x0000C9, "Member 'WC_Credits_C_ExecuteUbergraph_WC_Credits::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WC_Credits.WC_Credits_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WC_Credits_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_Credits_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WC_Credits_C_OnAnimationFinished");
static_assert(sizeof(WC_Credits_C_OnAnimationFinished) == 0x000008, "Wrong size on WC_Credits_C_OnAnimationFinished");
static_assert(offsetof(WC_Credits_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WC_Credits_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WC_Credits.WC_Credits_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_Credits_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_Credits_C_Tick) == 0x000004, "Wrong alignment on WC_Credits_C_Tick");
static_assert(sizeof(WC_Credits_C_Tick) == 0x00003C, "Wrong size on WC_Credits_C_Tick");
static_assert(offsetof(WC_Credits_C_Tick, MyGeometry) == 0x000000, "Member 'WC_Credits_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_Credits_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_Credits.WC_Credits_C.GetCreditsLinesCount
// 0x0018 (0x0018 - 0x0000)
struct WC_Credits_C_GetCreditsLinesCount final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_Credits_C_GetCreditsLinesCount) == 0x000004, "Wrong alignment on WC_Credits_C_GetCreditsLinesCount");
static_assert(sizeof(WC_Credits_C_GetCreditsLinesCount) == 0x000018, "Wrong size on WC_Credits_C_GetCreditsLinesCount");
static_assert(offsetof(WC_Credits_C_GetCreditsLinesCount, ReturnValue) == 0x000000, "Member 'WC_Credits_C_GetCreditsLinesCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCreditsLinesCount, CallFunc_GetDesiredSize_ReturnValue) == 0x000004, "Member 'WC_Credits_C_GetCreditsLinesCount::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCreditsLinesCount, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'WC_Credits_C_GetCreditsLinesCount::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCreditsLinesCount, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WC_Credits_C_GetCreditsLinesCount::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCreditsLinesCount, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'WC_Credits_C_GetCreditsLinesCount::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function WC_Credits.WC_Credits_C.GetCurrentYAlignment
// 0x0014 (0x0014 - 0x0000)
struct WC_Credits_C_GetCurrentYAlignment final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCreditsLinesCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_Credits_C_GetCurrentYAlignment) == 0x000004, "Wrong alignment on WC_Credits_C_GetCurrentYAlignment");
static_assert(sizeof(WC_Credits_C_GetCurrentYAlignment) == 0x000014, "Wrong size on WC_Credits_C_GetCurrentYAlignment");
static_assert(offsetof(WC_Credits_C_GetCurrentYAlignment, ReturnValue) == 0x000000, "Member 'WC_Credits_C_GetCurrentYAlignment::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCurrentYAlignment, CallFunc_GetCreditsLinesCount_ReturnValue) == 0x000004, "Member 'WC_Credits_C_GetCurrentYAlignment::CallFunc_GetCreditsLinesCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCurrentYAlignment, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'WC_Credits_C_GetCurrentYAlignment::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCurrentYAlignment, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'WC_Credits_C_GetCurrentYAlignment::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetCurrentYAlignment, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WC_Credits_C_GetCurrentYAlignment::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function WC_Credits.WC_Credits_C.GetDilationFactor
// 0x0034 (0x0034 - 0x0000)
struct WC_Credits_C_GetDilationFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCreditsLinesCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCreditsLinesCount_ReturnValue_1;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCreditsLinesCount_ReturnValue_2;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCreditsLinesCount_ReturnValue_3;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_Credits_C_GetDilationFactor) == 0x000004, "Wrong alignment on WC_Credits_C_GetDilationFactor");
static_assert(sizeof(WC_Credits_C_GetDilationFactor) == 0x000034, "Wrong size on WC_Credits_C_GetDilationFactor");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, ReturnValue) == 0x000000, "Member 'WC_Credits_C_GetDilationFactor::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_GetCreditsLinesCount_ReturnValue) == 0x000004, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_GetCreditsLinesCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_GetCreditsLinesCount_ReturnValue_1) == 0x000008, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_GetCreditsLinesCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_GetCreditsLinesCount_ReturnValue_2) == 0x000010, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_GetCreditsLinesCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_GetCreditsLinesCount_ReturnValue_3) == 0x000018, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_GetCreditsLinesCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000020, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000024, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_Credits_C_GetDilationFactor, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000030, "Member 'WC_Credits_C_GetDilationFactor::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");

}

