#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CornerPlayerProfile

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_CornerPlayerProfile.WC_CornerPlayerProfile_C.ExecuteUbergraph_WC_CornerPlayerProfile
// 0x0060 (0x0060 - 0x0000)
struct WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile) == 0x000004, "Wrong alignment on WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile");
static_assert(sizeof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile) == 0x000060, "Wrong size on WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile");
static_assert(offsetof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile, EntryPoint) == 0x000000, "Member 'WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile, K2Node_Event_MyGeometry) == 0x000024, "Member 'WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'WC_CornerPlayerProfile_C_ExecuteUbergraph_WC_CornerPlayerProfile::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function WC_CornerPlayerProfile.WC_CornerPlayerProfile_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_CornerPlayerProfile_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CornerPlayerProfile_C_Tick) == 0x000004, "Wrong alignment on WC_CornerPlayerProfile_C_Tick");
static_assert(sizeof(WC_CornerPlayerProfile_C_Tick) == 0x00003C, "Wrong size on WC_CornerPlayerProfile_C_Tick");
static_assert(offsetof(WC_CornerPlayerProfile_C_Tick, MyGeometry) == 0x000000, "Member 'WC_CornerPlayerProfile_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_CornerPlayerProfile_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_CornerPlayerProfile_C_Tick::InDeltaTime' has a wrong offset!");

}

