#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CharacterSelection

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_CharacterSelection.WC_CharacterSelection_C
// 0x00D8 (0x0538 - 0x0460)
class UWC_CharacterSelection_C final : public UWidgetContainerCharSelection
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBarBG;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Music_Tutorial_Stop;                               // 0x0478(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNGDAkComponent*                        NGDAk_Music;                                       // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Music_CharacterSelection;                          // 0x04D8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNGDAkComponent*                        CreatedAkComp;                                     // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_CharacterSelection(int32 EntryPoint);
	void OnStateChange(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_CharacterSelection_C">();
	}
	static class UWC_CharacterSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_CharacterSelection_C>();
	}
};
static_assert(alignof(UWC_CharacterSelection_C) == 0x000008, "Wrong alignment on UWC_CharacterSelection_C");
static_assert(sizeof(UWC_CharacterSelection_C) == 0x000538, "Wrong size on UWC_CharacterSelection_C");
static_assert(offsetof(UWC_CharacterSelection_C, UberGraphFrame) == 0x000460, "Member 'UWC_CharacterSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, Background) == 0x000468, "Member 'UWC_CharacterSelection_C::Background' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, ProgressBarBG) == 0x000470, "Member 'UWC_CharacterSelection_C::ProgressBarBG' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, Music_Tutorial_Stop) == 0x000478, "Member 'UWC_CharacterSelection_C::Music_Tutorial_Stop' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, NGDAk_Music) == 0x0004D0, "Member 'UWC_CharacterSelection_C::NGDAk_Music' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, Music_CharacterSelection) == 0x0004D8, "Member 'UWC_CharacterSelection_C::Music_CharacterSelection' has a wrong offset!");
static_assert(offsetof(UWC_CharacterSelection_C, CreatedAkComp) == 0x000530, "Member 'UWC_CharacterSelection_C::CreatedAkComp' has a wrong offset!");

}

