#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CustomMatch

#include "Basic.hpp"


namespace SDK::Params
{

// Function WC_CustomMatch.WC_CustomMatch_C.ExecuteUbergraph_WC_CustomMatch
// 0x0004 (0x0004 - 0x0000)
struct WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch) == 0x000004, "Wrong alignment on WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch");
static_assert(sizeof(WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch) == 0x000004, "Wrong size on WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch");
static_assert(offsetof(WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch, EntryPoint) == 0x000000, "Member 'WC_CustomMatch_C_ExecuteUbergraph_WC_CustomMatch::EntryPoint' has a wrong offset!");

// Function WC_CustomMatch.WC_CustomMatch_C.Get_TextBlock_CurrentPage_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetCurrentPageIndex_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0) == 0x000008, "Wrong alignment on WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0");
static_assert(sizeof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0) == 0x000038, "Wrong size on WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0, ReturnValue) == 0x000000, "Member 'WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0, CallFunc_GetCurrentPageIndex_ReturnValue) == 0x000018, "Member 'WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0::CallFunc_GetCurrentPageIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WC_CustomMatch_C_Get_TextBlock_CurrentPage_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WC_CustomMatch.WC_CustomMatch_C.Get_TextBlock_TotalPages_Text_0
// 0x0038 (0x0038 - 0x0000)
struct WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetTotalPagesAmount_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
static_assert(alignof(WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0) == 0x000008, "Wrong alignment on WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0");
static_assert(sizeof(WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0) == 0x000038, "Wrong size on WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0, ReturnValue) == 0x000000, "Member 'WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0, CallFunc_GetTotalPagesAmount_ReturnValue) == 0x000018, "Member 'WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0::CallFunc_GetTotalPagesAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WC_CustomMatch_C_Get_TextBlock_TotalPages_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

