#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CooldownCounter

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_CooldownCounter.WC_CooldownCounter_C
// 0x00F0 (0x0340 - 0x0250)
class UWC_CooldownCounter_C final : public UWidgetContainerCooldownCounter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       fade;                                              // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_CooldownCounterBG;                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MatchCountdown;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATimeWatchGameState*                    GameStateRef;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hasPlayedSound;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDAkComponent*                        NGDAk_Counter;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNGDSoundConfig                        NGDConfig_Counter;                                 // 0x0290(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FNGDSoundConfig                        NGDConfig_CounterStart;                            // 0x02E8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WC_CooldownCounter(int32 EntryPoint);
	void OnGameStateChanged(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void UpdateTimer();
	void PlayCountdownSound(int32 Second);
	bool ShouldTriggerFadeIn();
	bool ShouldTriggerFadeOut();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_CooldownCounter_C">();
	}
	static class UWC_CooldownCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_CooldownCounter_C>();
	}
};
static_assert(alignof(UWC_CooldownCounter_C) == 0x000008, "Wrong alignment on UWC_CooldownCounter_C");
static_assert(sizeof(UWC_CooldownCounter_C) == 0x000340, "Wrong size on UWC_CooldownCounter_C");
static_assert(offsetof(UWC_CooldownCounter_C, UberGraphFrame) == 0x000250, "Member 'UWC_CooldownCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, fade) == 0x000258, "Member 'UWC_CooldownCounter_C::fade' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, Pulse) == 0x000260, "Member 'UWC_CooldownCounter_C::Pulse' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, Image_CooldownCounterBG) == 0x000268, "Member 'UWC_CooldownCounter_C::Image_CooldownCounterBG' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, TextBlock_MatchCountdown) == 0x000270, "Member 'UWC_CooldownCounter_C::TextBlock_MatchCountdown' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, GameStateRef) == 0x000278, "Member 'UWC_CooldownCounter_C::GameStateRef' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, hasPlayedSound) == 0x000280, "Member 'UWC_CooldownCounter_C::hasPlayedSound' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, NGDAk_Counter) == 0x000288, "Member 'UWC_CooldownCounter_C::NGDAk_Counter' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, NGDConfig_Counter) == 0x000290, "Member 'UWC_CooldownCounter_C::NGDConfig_Counter' has a wrong offset!");
static_assert(offsetof(UWC_CooldownCounter_C, NGDConfig_CounterStart) == 0x0002E8, "Member 'UWC_CooldownCounter_C::NGDConfig_CounterStart' has a wrong offset!");

}

