#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_CustomMatch

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_CustomMatch.WC_CustomMatch_C
// 0x0030 (0x0340 - 0x0310)
class UWC_CustomMatch_C final : public UWidgetContainerCustomMatch
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentPage;                             // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalPages;                              // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_PanelSwitcher;                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_CustomMatch(int32 EntryPoint);
	void Construct();
	class FText Get_TextBlock_CurrentPage_Text_0();
	class FText Get_TextBlock_TotalPages_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_CustomMatch_C">();
	}
	static class UWC_CustomMatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_CustomMatch_C>();
	}
};
static_assert(alignof(UWC_CustomMatch_C) == 0x000008, "Wrong alignment on UWC_CustomMatch_C");
static_assert(sizeof(UWC_CustomMatch_C) == 0x000340, "Wrong size on UWC_CustomMatch_C");
static_assert(offsetof(UWC_CustomMatch_C, UberGraphFrame) == 0x000310, "Member 'UWC_CustomMatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_CustomMatch_C, Image_0) == 0x000318, "Member 'UWC_CustomMatch_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWC_CustomMatch_C, Image_Background) == 0x000320, "Member 'UWC_CustomMatch_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWC_CustomMatch_C, TextBlock_CurrentPage) == 0x000328, "Member 'UWC_CustomMatch_C::TextBlock_CurrentPage' has a wrong offset!");
static_assert(offsetof(UWC_CustomMatch_C, TextBlock_TotalPages) == 0x000330, "Member 'UWC_CustomMatch_C::TextBlock_TotalPages' has a wrong offset!");
static_assert(offsetof(UWC_CustomMatch_C, WidgetSwitcher_PanelSwitcher) == 0x000338, "Member 'UWC_CustomMatch_C::WidgetSwitcher_PanelSwitcher' has a wrong offset!");

}

