#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_DeathMatchScore

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_DeathMatchScore.WC_DeathMatchScore_C
// 0x0018 (0x0268 - 0x0250)
class UWC_DeathMatchScore_C final : public UWidgetContainerDeathMatchScore
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DeathTime;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeathMessageTimeLimit;                             // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdvantageAnimDuration;                             // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdvantageAnimTime;                                 // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_DeathMatchScore(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_DeathMatchScore_C">();
	}
	static class UWC_DeathMatchScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_DeathMatchScore_C>();
	}
};
static_assert(alignof(UWC_DeathMatchScore_C) == 0x000008, "Wrong alignment on UWC_DeathMatchScore_C");
static_assert(sizeof(UWC_DeathMatchScore_C) == 0x000268, "Wrong size on UWC_DeathMatchScore_C");
static_assert(offsetof(UWC_DeathMatchScore_C, UberGraphFrame) == 0x000250, "Member 'UWC_DeathMatchScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_DeathMatchScore_C, DeathTime) == 0x000258, "Member 'UWC_DeathMatchScore_C::DeathTime' has a wrong offset!");
static_assert(offsetof(UWC_DeathMatchScore_C, DeathMessageTimeLimit) == 0x00025C, "Member 'UWC_DeathMatchScore_C::DeathMessageTimeLimit' has a wrong offset!");
static_assert(offsetof(UWC_DeathMatchScore_C, AdvantageAnimDuration) == 0x000260, "Member 'UWC_DeathMatchScore_C::AdvantageAnimDuration' has a wrong offset!");
static_assert(offsetof(UWC_DeathMatchScore_C, AdvantageAnimTime) == 0x000264, "Member 'UWC_DeathMatchScore_C::AdvantageAnimTime' has a wrong offset!");

}

