#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_FluxStateIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WC_FluxStateIcon.WC_FluxStateIcon_C.ExecuteUbergraph_WC_FluxStateIcon
// 0x0040 (0x0040 - 0x0000)
struct WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UsingQuantumTime_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon) == 0x000008, "Wrong alignment on WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon");
static_assert(sizeof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon) == 0x000040, "Wrong size on WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, EntryPoint) == 0x000000, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000010, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_UsingQuantumTime_ReturnValue) == 0x000028, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_UsingQuantumTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'WC_FluxStateIcon_C_ExecuteUbergraph_WC_FluxStateIcon::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

