#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_FluxStateIcon

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_FluxStateIcon.WC_FluxStateIcon_C
// 0x0038 (0x0298 - 0x0260)
class UWC_FluxStateIcon_C final : public UWidgetContainerFluxStateIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopNameAnimation;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rewind_Animation;                                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Play_Animation;                                    // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PlayIcon;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RewindIcon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         StopTransitionAnimationLenght;                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_FluxStateIcon(int32 EntryPoint);
	void PlayCycleNameAnimation();
	void PlayForwardAnimation();
	void PlayReverseAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_FluxStateIcon_C">();
	}
	static class UWC_FluxStateIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_FluxStateIcon_C>();
	}
};
static_assert(alignof(UWC_FluxStateIcon_C) == 0x000008, "Wrong alignment on UWC_FluxStateIcon_C");
static_assert(sizeof(UWC_FluxStateIcon_C) == 0x000298, "Wrong size on UWC_FluxStateIcon_C");
static_assert(offsetof(UWC_FluxStateIcon_C, UberGraphFrame) == 0x000260, "Member 'UWC_FluxStateIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, LoopNameAnimation) == 0x000268, "Member 'UWC_FluxStateIcon_C::LoopNameAnimation' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, Rewind_Animation) == 0x000270, "Member 'UWC_FluxStateIcon_C::Rewind_Animation' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, Play_Animation) == 0x000278, "Member 'UWC_FluxStateIcon_C::Play_Animation' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, PlayIcon) == 0x000280, "Member 'UWC_FluxStateIcon_C::PlayIcon' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, RewindIcon) == 0x000288, "Member 'UWC_FluxStateIcon_C::RewindIcon' has a wrong offset!");
static_assert(offsetof(UWC_FluxStateIcon_C, StopTransitionAnimationLenght) == 0x000290, "Member 'UWC_FluxStateIcon_C::StopTransitionAnimationLenght' has a wrong offset!");

}

