#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_InGameMenu

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_InGameMenu.WC_InGameMenu_C
// 0x0038 (0x02C8 - 0x0290)
class UWC_InGameMenu_C final : public UWidgetContainerInGameMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MainMenuButtonOver;                                // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OptionsButonOver;                                  // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ResumeButtonOver;                                  // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Init;                                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BackgoundImage;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QL_Logo;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_InGameMenu(int32 EntryPoint);
	void BndEvt__BackToMainMenuButton_K2Node_ComponentBoundEvent_176_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BackToMainMenuButton_K2Node_ComponentBoundEvent_191_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_QuitButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_QuitButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_206_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__QuitGameButton_K2Node_ComponentBoundEvent_223_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ResumeButton_K2Node_ComponentBoundEvent_153_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ResumeButton_K2Node_ComponentBoundEvent_163_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void HideInGameMenu();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_InGameMenu_C">();
	}
	static class UWC_InGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_InGameMenu_C>();
	}
};
static_assert(alignof(UWC_InGameMenu_C) == 0x000008, "Wrong alignment on UWC_InGameMenu_C");
static_assert(sizeof(UWC_InGameMenu_C) == 0x0002C8, "Wrong size on UWC_InGameMenu_C");
static_assert(offsetof(UWC_InGameMenu_C, UberGraphFrame) == 0x000290, "Member 'UWC_InGameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, MainMenuButtonOver) == 0x000298, "Member 'UWC_InGameMenu_C::MainMenuButtonOver' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, OptionsButonOver) == 0x0002A0, "Member 'UWC_InGameMenu_C::OptionsButonOver' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, ResumeButtonOver) == 0x0002A8, "Member 'UWC_InGameMenu_C::ResumeButtonOver' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, Init) == 0x0002B0, "Member 'UWC_InGameMenu_C::Init' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, Image_BackgoundImage) == 0x0002B8, "Member 'UWC_InGameMenu_C::Image_BackgoundImage' has a wrong offset!");
static_assert(offsetof(UWC_InGameMenu_C, QL_Logo) == 0x0002C0, "Member 'UWC_InGameMenu_C::QL_Logo' has a wrong offset!");

}

