#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_InGameActionPrompt

#include "Basic.hpp"

#include "NGDUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_InGameActionPrompt.WC_InGameActionPrompt_C
// 0x0020 (0x0268 - 0x0248)
class UWC_InGameActionPrompt_C final : public UNGDWidgetContainer
{
public:
	class UDefaultActionLabel_C*                  DefaultActionLabel;                                // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Prompt;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentActionName;                                 // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowActionPrompt(class FName NewActionName, const class FText& ActionText);
	void HidePrompt(class FName ActionName_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_InGameActionPrompt_C">();
	}
	static class UWC_InGameActionPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_InGameActionPrompt_C>();
	}
};
static_assert(alignof(UWC_InGameActionPrompt_C) == 0x000008, "Wrong alignment on UWC_InGameActionPrompt_C");
static_assert(sizeof(UWC_InGameActionPrompt_C) == 0x000268, "Wrong size on UWC_InGameActionPrompt_C");
static_assert(offsetof(UWC_InGameActionPrompt_C, DefaultActionLabel) == 0x000248, "Member 'UWC_InGameActionPrompt_C::DefaultActionLabel' has a wrong offset!");
static_assert(offsetof(UWC_InGameActionPrompt_C, TextBlock_Prompt) == 0x000250, "Member 'UWC_InGameActionPrompt_C::TextBlock_Prompt' has a wrong offset!");
static_assert(offsetof(UWC_InGameActionPrompt_C, ActionName) == 0x000258, "Member 'UWC_InGameActionPrompt_C::ActionName' has a wrong offset!");
static_assert(offsetof(UWC_InGameActionPrompt_C, CurrentActionName) == 0x000260, "Member 'UWC_InGameActionPrompt_C::CurrentActionName' has a wrong offset!");

}

