#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_KillConfirmation

#include "Basic.hpp"


namespace SDK::Params
{

// Function WC_KillConfirmation.WC_KillConfirmation_C.ExecuteUbergraph_WC_KillConfirmation
// 0x0018 (0x0018 - 0x0000)
struct WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchCharacter*                    K2Node_Event_Character;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation) == 0x000008, "Wrong alignment on WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation");
static_assert(sizeof(WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation) == 0x000018, "Wrong size on WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation");
static_assert(offsetof(WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation, EntryPoint) == 0x000000, "Member 'WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation, K2Node_Event_Character) == 0x000008, "Member 'WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation::K2Node_Event_Character' has a wrong offset!");
static_assert(offsetof(WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WC_KillConfirmation_C_ExecuteUbergraph_WC_KillConfirmation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WC_KillConfirmation.WC_KillConfirmation_C.OnEnemyKilled
// 0x0008 (0x0008 - 0x0000)
struct WC_KillConfirmation_C_OnEnemyKilled final
{
public:
	class ATimeWatchCharacter*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_KillConfirmation_C_OnEnemyKilled) == 0x000008, "Wrong alignment on WC_KillConfirmation_C_OnEnemyKilled");
static_assert(sizeof(WC_KillConfirmation_C_OnEnemyKilled) == 0x000008, "Wrong size on WC_KillConfirmation_C_OnEnemyKilled");
static_assert(offsetof(WC_KillConfirmation_C_OnEnemyKilled, Character) == 0x000000, "Member 'WC_KillConfirmation_C_OnEnemyKilled::Character' has a wrong offset!");

}

