#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_LobbyMatchSettings

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_LobbyMatchSettings.WC_LobbyMatchSettings_C.ExecuteUbergraph_WC_LobbyMatchSettings
// 0x0060 (0x0060 - 0x0000)
struct WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpinner*                               K2Node_Event_Spinner;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInteractable;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatchSettingSpinner_C*                 K2Node_DynamicCast_AsMatch_Setting_Spinner;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFirstControllerInputPressed_Pressed; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFirstControllerInputPressed_Pressed_1; // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings) == 0x000008, "Wrong alignment on WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings");
static_assert(sizeof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings) == 0x000060, "Wrong size on WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, EntryPoint) == 0x000000, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_Event_Spinner) == 0x000008, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_Event_Spinner' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_Event_bInteractable) == 0x000010, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_Event_bInteractable' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_Event_MyGeometry) == 0x000014, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_DynamicCast_AsMatch_Setting_Spinner) == 0x000050, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_DynamicCast_AsMatch_Setting_Spinner' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, CallFunc_CheckFirstControllerInputPressed_Pressed) == 0x000059, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::CallFunc_CheckFirstControllerInputPressed_Pressed' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings, CallFunc_CheckFirstControllerInputPressed_Pressed_1) == 0x00005A, "Member 'WC_LobbyMatchSettings_C_ExecuteUbergraph_WC_LobbyMatchSettings::CallFunc_CheckFirstControllerInputPressed_Pressed_1' has a wrong offset!");

// Function WC_LobbyMatchSettings.WC_LobbyMatchSettings_C.ToggleMatchSettingsSpinnerInteractable
// 0x0010 (0x0010 - 0x0000)
struct WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable final
{
public:
	class USpinner*                               Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractable;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable) == 0x000008, "Wrong alignment on WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable");
static_assert(sizeof(WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable) == 0x000010, "Wrong size on WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable");
static_assert(offsetof(WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable, Spinner) == 0x000000, "Member 'WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable::Spinner' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable, bInteractable) == 0x000008, "Member 'WC_LobbyMatchSettings_C_ToggleMatchSettingsSpinnerInteractable::bInteractable' has a wrong offset!");

// Function WC_LobbyMatchSettings.WC_LobbyMatchSettings_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_LobbyMatchSettings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_LobbyMatchSettings_C_Tick) == 0x000004, "Wrong alignment on WC_LobbyMatchSettings_C_Tick");
static_assert(sizeof(WC_LobbyMatchSettings_C_Tick) == 0x00003C, "Wrong size on WC_LobbyMatchSettings_C_Tick");
static_assert(offsetof(WC_LobbyMatchSettings_C_Tick, MyGeometry) == 0x000000, "Member 'WC_LobbyMatchSettings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_LobbyMatchSettings_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_LobbyMatchSettings.WC_LobbyMatchSettings_C.CheckFirstControllerInputPressed
// 0x0030 (0x0030 - 0x0000)
struct WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed) == 0x000008, "Wrong alignment on WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed");
static_assert(sizeof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed) == 0x000030, "Wrong size on WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed");
static_assert(offsetof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed, Key) == 0x000000, "Member 'WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed::Key' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed, Pressed) == 0x000018, "Member 'WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed::Pressed' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000028, "Member 'WC_LobbyMatchSettings_C_CheckFirstControllerInputPressed::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");

}

