#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MainMenuLobby

#include "Basic.hpp"

#include "TimeWatch_structs.hpp"
#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_MainMenuLobby.WC_MainMenuLobby_C
// 0x0090 (0x05E0 - 0x0550)
class UWC_MainMenuLobby_C final : public UWidgetContainerCustomization
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_EmotesTab;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SpraysTab;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_VicPosesTab;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundImage;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkinsTab;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      LoadingCircularThrobber;                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Sound_OnBuyItemSuccess;                            // 0x0588(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WC_MainMenuLobby(int32 EntryPoint);
	void BP_OnBuyItemSuccess();
	void BP_OnActiveWidgetChanged(ECustomizationFlowState State);
	ESlateVisibility Get_LoadingCircularThrobber_Visibility_0();
	bool Get_Button_SetActiveCharacter_bIsEnabled_0();
	bool Get_Button_ApplyStyle_bIsEnabled_0();
	void TrySetActiveCharacterButton(EUINavigation UINavigation, class UWidget** Widget);
	void TryFooter(EUINavigation UINavigation, class UWidget** Widget);
	void TryBackButton(EUINavigation UINavigation, class UWidget** Widget);
	void GoToBackButton(EUINavigation UINavigation, class UWidget** Widget);
	ESlateVisibility Get_Button_SetActiveCharacter_Visibility_0();
	ESlateVisibility Get_Button_BuyCharacter_Visibility_0();
	ESlateVisibility Get_Button_ApplyStyle_Visibility_0();
	ESlateVisibility Get_Button_BuyStyle_Visibility_0();
	bool Get_Button_CustomizeCharacter_bIsEnabled_0();
	bool Get_Button_StylesTab_bIsEnabled_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_MainMenuLobby_C">();
	}
	static class UWC_MainMenuLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_MainMenuLobby_C>();
	}
};
static_assert(alignof(UWC_MainMenuLobby_C) == 0x000008, "Wrong alignment on UWC_MainMenuLobby_C");
static_assert(sizeof(UWC_MainMenuLobby_C) == 0x0005E0, "Wrong size on UWC_MainMenuLobby_C");
static_assert(offsetof(UWC_MainMenuLobby_C, UberGraphFrame) == 0x000550, "Member 'UWC_MainMenuLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Button_EmotesTab) == 0x000558, "Member 'UWC_MainMenuLobby_C::Button_EmotesTab' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Button_SpraysTab) == 0x000560, "Member 'UWC_MainMenuLobby_C::Button_SpraysTab' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Button_VicPosesTab) == 0x000568, "Member 'UWC_MainMenuLobby_C::Button_VicPosesTab' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Image_BackgroundImage) == 0x000570, "Member 'UWC_MainMenuLobby_C::Image_BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Image_SkinsTab) == 0x000578, "Member 'UWC_MainMenuLobby_C::Image_SkinsTab' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, LoadingCircularThrobber) == 0x000580, "Member 'UWC_MainMenuLobby_C::LoadingCircularThrobber' has a wrong offset!");
static_assert(offsetof(UWC_MainMenuLobby_C, Sound_OnBuyItemSuccess) == 0x000588, "Member 'UWC_MainMenuLobby_C::Sound_OnBuyItemSuccess' has a wrong offset!");

}

