#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MatchMaking

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_MatchMaking.WC_MatchMaking_C.Get_Button_Cancel_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MatchMaking_C_Get_Button_Cancel_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingCancelable_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MatchMaking_C_Get_Button_Cancel_Visibility_0) == 0x000001, "Wrong alignment on WC_MatchMaking_C_Get_Button_Cancel_Visibility_0");
static_assert(sizeof(WC_MatchMaking_C_Get_Button_Cancel_Visibility_0) == 0x000002, "Wrong size on WC_MatchMaking_C_Get_Button_Cancel_Visibility_0");
static_assert(offsetof(WC_MatchMaking_C_Get_Button_Cancel_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MatchMaking_C_Get_Button_Cancel_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_Get_Button_Cancel_Visibility_0, CallFunc_IsMatchmakingCancelable_ReturnValue) == 0x000001, "Member 'WC_MatchMaking_C_Get_Button_Cancel_Visibility_0::CallFunc_IsMatchmakingCancelable_ReturnValue' has a wrong offset!");

// Function WC_MatchMaking.WC_MatchMaking_C.TryLeaveCancelButton
// 0x0040 (0x0040 - 0x0000)
struct WC_MatchMaking_C_TryLeaveCancelButton final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDHUDState*                           CallFunc_GetOwnerHUDState_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDStateMainMenu*                      K2Node_DynamicCast_AsHUDState_Main_Menu;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWC_MainMenu_C*                         CallFunc_GetWidgetContainer_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWC_MainMenu_C*                         K2Node_DynamicCast_AsWC_Main_Menu;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MatchMaking_C_TryLeaveCancelButton) == 0x000008, "Wrong alignment on WC_MatchMaking_C_TryLeaveCancelButton");
static_assert(sizeof(WC_MatchMaking_C_TryLeaveCancelButton) == 0x000040, "Wrong size on WC_MatchMaking_C_TryLeaveCancelButton");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, UINavigation) == 0x000000, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, Widget) == 0x000008, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::Widget' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, CallFunc_GetOwnerHUDState_ReturnValue) == 0x000010, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::CallFunc_GetOwnerHUDState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, K2Node_DynamicCast_AsHUDState_Main_Menu) == 0x000018, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::K2Node_DynamicCast_AsHUDState_Main_Menu' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, CallFunc_GetWidgetContainer_ReturnValue) == 0x000028, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::CallFunc_GetWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, K2Node_DynamicCast_AsWC_Main_Menu) == 0x000030, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::K2Node_DynamicCast_AsWC_Main_Menu' has a wrong offset!");
static_assert(offsetof(WC_MatchMaking_C_TryLeaveCancelButton, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WC_MatchMaking_C_TryLeaveCancelButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

