#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MainMenuLobby

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "TimeWatch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.ExecuteUbergraph_WC_MainMenuLobby
// 0x0030 (0x0030 - 0x0000)
struct WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkinPreviewActor_C*                    K2Node_DynamicCast_AsSkin_Preview_Actor;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECustomizationFlowState                       K2Node_Event_State;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby) == 0x000008, "Wrong alignment on WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby");
static_assert(sizeof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby) == 0x000030, "Wrong size on WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, EntryPoint) == 0x000000, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, K2Node_DynamicCast_AsSkin_Preview_Actor) == 0x000008, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::K2Node_DynamicCast_AsSkin_Preview_Actor' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, K2Node_Event_State) == 0x000011, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, CallFunc_Vector_Zero_ReturnValue) == 0x000014, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby, CallFunc_PostSound_ReturnValue) == 0x000028, "Member 'WC_MainMenuLobby_C_ExecuteUbergraph_WC_MainMenuLobby::CallFunc_PostSound_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.BP_OnActiveWidgetChanged
// 0x0001 (0x0001 - 0x0000)
struct WC_MainMenuLobby_C_BP_OnActiveWidgetChanged final
{
public:
	ECustomizationFlowState                       State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_BP_OnActiveWidgetChanged) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_BP_OnActiveWidgetChanged");
static_assert(sizeof(WC_MainMenuLobby_C_BP_OnActiveWidgetChanged) == 0x000001, "Wrong size on WC_MainMenuLobby_C_BP_OnActiveWidgetChanged");
static_assert(offsetof(WC_MainMenuLobby_C_BP_OnActiveWidgetChanged, State) == 0x000000, "Member 'WC_MainMenuLobby_C_BP_OnActiveWidgetChanged::State' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_LoadingCircularThrobber_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_LoadingCircularThrobber_Visibility_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_SetActiveCharacter_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSetActiveCharacterButtonEnabled_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0, CallFunc_IsSetActiveCharacterButtonEnabled_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_bIsEnabled_0::CallFunc_IsSetActiveCharacterButtonEnabled_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_ApplyStyle_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsApplyStyleButtonEnabled_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0, CallFunc_IsApplyStyleButtonEnabled_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_ApplyStyle_bIsEnabled_0::CallFunc_IsApplyStyleButtonEnabled_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.TrySetActiveCharacterButton
// 0x0010 (0x0010 - 0x0000)
struct WC_MainMenuLobby_C_TrySetActiveCharacterButton final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_TrySetActiveCharacterButton) == 0x000008, "Wrong alignment on WC_MainMenuLobby_C_TrySetActiveCharacterButton");
static_assert(sizeof(WC_MainMenuLobby_C_TrySetActiveCharacterButton) == 0x000010, "Wrong size on WC_MainMenuLobby_C_TrySetActiveCharacterButton");
static_assert(offsetof(WC_MainMenuLobby_C_TrySetActiveCharacterButton, UINavigation) == 0x000000, "Member 'WC_MainMenuLobby_C_TrySetActiveCharacterButton::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_TrySetActiveCharacterButton, Widget) == 0x000008, "Member 'WC_MainMenuLobby_C_TrySetActiveCharacterButton::Widget' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.TryFooter
// 0x0010 (0x0010 - 0x0000)
struct WC_MainMenuLobby_C_TryFooter final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_TryFooter) == 0x000008, "Wrong alignment on WC_MainMenuLobby_C_TryFooter");
static_assert(sizeof(WC_MainMenuLobby_C_TryFooter) == 0x000010, "Wrong size on WC_MainMenuLobby_C_TryFooter");
static_assert(offsetof(WC_MainMenuLobby_C_TryFooter, UINavigation) == 0x000000, "Member 'WC_MainMenuLobby_C_TryFooter::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_TryFooter, Widget) == 0x000008, "Member 'WC_MainMenuLobby_C_TryFooter::Widget' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.TryBackButton
// 0x0010 (0x0010 - 0x0000)
struct WC_MainMenuLobby_C_TryBackButton final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_TryBackButton) == 0x000008, "Wrong alignment on WC_MainMenuLobby_C_TryBackButton");
static_assert(sizeof(WC_MainMenuLobby_C_TryBackButton) == 0x000010, "Wrong size on WC_MainMenuLobby_C_TryBackButton");
static_assert(offsetof(WC_MainMenuLobby_C_TryBackButton, UINavigation) == 0x000000, "Member 'WC_MainMenuLobby_C_TryBackButton::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_TryBackButton, Widget) == 0x000008, "Member 'WC_MainMenuLobby_C_TryBackButton::Widget' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.GoToBackButton
// 0x0010 (0x0010 - 0x0000)
struct WC_MainMenuLobby_C_GoToBackButton final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenuLobby_C_GoToBackButton) == 0x000008, "Wrong alignment on WC_MainMenuLobby_C_GoToBackButton");
static_assert(sizeof(WC_MainMenuLobby_C_GoToBackButton) == 0x000010, "Wrong size on WC_MainMenuLobby_C_GoToBackButton");
static_assert(offsetof(WC_MainMenuLobby_C_GoToBackButton, UINavigation) == 0x000000, "Member 'WC_MainMenuLobby_C_GoToBackButton::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_GoToBackButton, Widget) == 0x000008, "Member 'WC_MainMenuLobby_C_GoToBackButton::Widget' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_SetActiveCharacter_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0, CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_SetActiveCharacter_Visibility_0::CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_BuyCharacter_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0) == 0x000003, "Wrong size on WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0, CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0::CallFunc_IsSetActiveCharacterButtonVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WC_MainMenuLobby_C_Get_Button_BuyCharacter_Visibility_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_ApplyStyle_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApplyStyleButtonVisible_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0, CallFunc_IsApplyStyleButtonVisible_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_ApplyStyle_Visibility_0::CallFunc_IsApplyStyleButtonVisible_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_BuyStyle_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApplyStyleButtonVisible_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0) == 0x000003, "Wrong size on WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0, CallFunc_IsApplyStyleButtonVisible_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0::CallFunc_IsApplyStyleButtonVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WC_MainMenuLobby_C_Get_Button_BuyStyle_Visibility_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_CustomizeCharacter_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCustomizeCharacterButtonEnabled_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0, CallFunc_IsCustomizeCharacterButtonEnabled_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_CustomizeCharacter_bIsEnabled_0::CallFunc_IsCustomizeCharacterButtonEnabled_ReturnValue' has a wrong offset!");

// Function WC_MainMenuLobby.WC_MainMenuLobby_C.Get_Button_StylesTab_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStylesTabButtonEnabled_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0) == 0x000001, "Wrong alignment on WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0");
static_assert(sizeof(WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0) == 0x000002, "Wrong size on WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0, CallFunc_IsStylesTabButtonEnabled_ReturnValue) == 0x000001, "Member 'WC_MainMenuLobby_C_Get_Button_StylesTab_bIsEnabled_0::CallFunc_IsStylesTabButtonEnabled_ReturnValue' has a wrong offset!");

}

