#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MainMenu

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_MainMenu.WC_MainMenu_C
// 0x0020 (0x0378 - 0x0358)
class UWC_MainMenu_C final : public UWidgetContainerMainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Logo;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_AlphaBuildDisclaimer;                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsOnMainMenu;                                     // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFirstTransition;                                  // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WC_MainMenu(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void TryMatchmakingWidget(EUINavigation UINavigation, class UWidget** FocusWidget);
	void MouseEnableExpoSpectator();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_MainMenu_C">();
	}
	static class UWC_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_MainMenu_C>();
	}
};
static_assert(alignof(UWC_MainMenu_C) == 0x000008, "Wrong alignment on UWC_MainMenu_C");
static_assert(sizeof(UWC_MainMenu_C) == 0x000378, "Wrong size on UWC_MainMenu_C");
static_assert(offsetof(UWC_MainMenu_C, UberGraphFrame) == 0x000358, "Member 'UWC_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_MainMenu_C, Image_Logo) == 0x000360, "Member 'UWC_MainMenu_C::Image_Logo' has a wrong offset!");
static_assert(offsetof(UWC_MainMenu_C, TextBlock_AlphaBuildDisclaimer) == 0x000368, "Member 'UWC_MainMenu_C::TextBlock_AlphaBuildDisclaimer' has a wrong offset!");
static_assert(offsetof(UWC_MainMenu_C, bIsOnMainMenu) == 0x000370, "Member 'UWC_MainMenu_C::bIsOnMainMenu' has a wrong offset!");
static_assert(offsetof(UWC_MainMenu_C, bFirstTransition) == 0x000371, "Member 'UWC_MainMenu_C::bFirstTransition' has a wrong offset!");

}

