#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MatchOptions

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_MatchOptions.WC_MatchOptions_C
// 0x0028 (0x02E8 - 0x02C0)
class UWC_MatchOptions_C final : public UWidgetContainerMatchOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MatchCancel;                                       // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowLoop;                                         // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_MatchCancel;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MatchCancelledOnScreenDuration;                    // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_MatchOptions(int32 EntryPoint);
	void BP_StartMatchCancelledAnim();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_MatchOptions_C">();
	}
	static class UWC_MatchOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_MatchOptions_C>();
	}
};
static_assert(alignof(UWC_MatchOptions_C) == 0x000008, "Wrong alignment on UWC_MatchOptions_C");
static_assert(sizeof(UWC_MatchOptions_C) == 0x0002E8, "Wrong size on UWC_MatchOptions_C");
static_assert(offsetof(UWC_MatchOptions_C, UberGraphFrame) == 0x0002C0, "Member 'UWC_MatchOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_MatchOptions_C, MatchCancel) == 0x0002C8, "Member 'UWC_MatchOptions_C::MatchCancel' has a wrong offset!");
static_assert(offsetof(UWC_MatchOptions_C, ArrowLoop) == 0x0002D0, "Member 'UWC_MatchOptions_C::ArrowLoop' has a wrong offset!");
static_assert(offsetof(UWC_MatchOptions_C, Text_MatchCancel) == 0x0002D8, "Member 'UWC_MatchOptions_C::Text_MatchCancel' has a wrong offset!");
static_assert(offsetof(UWC_MatchOptions_C, MatchCancelledOnScreenDuration) == 0x0002E0, "Member 'UWC_MatchOptions_C::MatchCancelledOnScreenDuration' has a wrong offset!");

}

