#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_MainMenu.WC_MainMenu_C.ExecuteUbergraph_WC_MainMenu
// 0x0078 (0x0078 - 0x0000)
struct WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeWatchGameInstanceBP_C*             K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANGDLayeredHUD*                         CallFunc_GetWorldHUD_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainMenuHUD*                           K2Node_DynamicCast_AsMain_Menu_HUD;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu) == 0x000008, "Wrong alignment on WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu");
static_assert(sizeof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu) == 0x000078, "Wrong size on WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, EntryPoint) == 0x000000, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_Event_MyGeometry) == 0x000010, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP) == 0x000050, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, CallFunc_GetWorldHUD_ReturnValue) == 0x000060, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::CallFunc_GetWorldHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_DynamicCast_AsMain_Menu_HUD) == 0x000068, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_DynamicCast_AsMain_Menu_HUD' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WC_MainMenu_C_ExecuteUbergraph_WC_MainMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WC_MainMenu.WC_MainMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_MainMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_MainMenu_C_Tick) == 0x000004, "Wrong alignment on WC_MainMenu_C_Tick");
static_assert(sizeof(WC_MainMenu_C_Tick) == 0x00003C, "Wrong size on WC_MainMenu_C_Tick");
static_assert(offsetof(WC_MainMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WC_MainMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_MainMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_MainMenu.WC_MainMenu_C.TryMatchmakingWidget
// 0x0038 (0x0038 - 0x0000)
struct WC_MainMenu_C_TryMatchmakingWidget final
{
public:
	EUINavigation                                 UINavigation;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                FocusWidget;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNGDHUDState*                           CallFunc_GetOwnerHUDState_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWC_MatchMaking_C*                      CallFunc_GetWidgetContainer_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetContainerMatchmaking*            K2Node_DynamicCast_AsWidget_Container_Matchmaking; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchmakingStarted_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchmakingCancelable_ReturnValue;      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenu_C_TryMatchmakingWidget) == 0x000008, "Wrong alignment on WC_MainMenu_C_TryMatchmakingWidget");
static_assert(sizeof(WC_MainMenu_C_TryMatchmakingWidget) == 0x000038, "Wrong size on WC_MainMenu_C_TryMatchmakingWidget");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, UINavigation) == 0x000000, "Member 'WC_MainMenu_C_TryMatchmakingWidget::UINavigation' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, FocusWidget) == 0x000008, "Member 'WC_MainMenu_C_TryMatchmakingWidget::FocusWidget' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, CallFunc_GetIsEnabled_ReturnValue) == 0x000010, "Member 'WC_MainMenu_C_TryMatchmakingWidget::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, CallFunc_GetOwnerHUDState_ReturnValue) == 0x000018, "Member 'WC_MainMenu_C_TryMatchmakingWidget::CallFunc_GetOwnerHUDState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, CallFunc_GetWidgetContainer_ReturnValue) == 0x000020, "Member 'WC_MainMenu_C_TryMatchmakingWidget::CallFunc_GetWidgetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, K2Node_DynamicCast_AsWidget_Container_Matchmaking) == 0x000028, "Member 'WC_MainMenu_C_TryMatchmakingWidget::K2Node_DynamicCast_AsWidget_Container_Matchmaking' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WC_MainMenu_C_TryMatchmakingWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, CallFunc_IsMatchmakingStarted_ReturnValue) == 0x000031, "Member 'WC_MainMenu_C_TryMatchmakingWidget::CallFunc_IsMatchmakingStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_TryMatchmakingWidget, CallFunc_IsMatchmakingCancelable_ReturnValue) == 0x000032, "Member 'WC_MainMenu_C_TryMatchmakingWidget::CallFunc_IsMatchmakingCancelable_ReturnValue' has a wrong offset!");

// Function WC_MainMenu.WC_MainMenu_C.MouseEnableExpoSpectator
// 0x0020 (0x0020 - 0x0000)
struct WC_MainMenu_C_MouseEnableExpoSpectator final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstanceBP_C*             K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExpoSpectator_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_MainMenu_C_MouseEnableExpoSpectator) == 0x000008, "Wrong alignment on WC_MainMenu_C_MouseEnableExpoSpectator");
static_assert(sizeof(WC_MainMenu_C_MouseEnableExpoSpectator) == 0x000020, "Wrong size on WC_MainMenu_C_MouseEnableExpoSpectator");
static_assert(offsetof(WC_MainMenu_C_MouseEnableExpoSpectator, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WC_MainMenu_C_MouseEnableExpoSpectator::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_MouseEnableExpoSpectator, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WC_MainMenu_C_MouseEnableExpoSpectator::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_MouseEnableExpoSpectator, K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP) == 0x000010, "Member 'WC_MainMenu_C_MouseEnableExpoSpectator::K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_MouseEnableExpoSpectator, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WC_MainMenu_C_MouseEnableExpoSpectator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_MainMenu_C_MouseEnableExpoSpectator, CallFunc_IsExpoSpectator_ReturnValue) == 0x000019, "Member 'WC_MainMenu_C_MouseEnableExpoSpectator::CallFunc_IsExpoSpectator_ReturnValue' has a wrong offset!");

}

