#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_News

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WC_News.WC_News_C.ExecuteUbergraph_WC_News
// 0x0020 (0x0020 - 0x0000)
struct WC_News_C_ExecuteUbergraph_WC_News final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WC_News_C_ExecuteUbergraph_WC_News) == 0x000008, "Wrong alignment on WC_News_C_ExecuteUbergraph_WC_News");
static_assert(sizeof(WC_News_C_ExecuteUbergraph_WC_News) == 0x000020, "Wrong size on WC_News_C_ExecuteUbergraph_WC_News");
static_assert(offsetof(WC_News_C_ExecuteUbergraph_WC_News, EntryPoint) == 0x000000, "Member 'WC_News_C_ExecuteUbergraph_WC_News::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_News_C_ExecuteUbergraph_WC_News, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'WC_News_C_ExecuteUbergraph_WC_News::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_News_C_ExecuteUbergraph_WC_News, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WC_News_C_ExecuteUbergraph_WC_News::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

