#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_OptionsMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AutoSettings_structs.hpp"


namespace SDK::Params
{

// Function WC_OptionsMenu.WC_OptionsMenu_C.ExecuteUbergraph_WC_OptionsMenu
// 0x02B8 (0x02B8 - 0x0000)
struct WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstanceBP_C*             K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_2;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_3;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATWPlayerCameraManager*                 K2Node_DynamicCast_AsTWPlayer_Camera_Manager;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue_4;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsChecked_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsChecked)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchHUD*                          K2Node_DynamicCast_AsTime_Watch_HUD;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_SelectedItem_1;                 // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	struct FSettingOption                         CallFunc_GetOptionByLabel_ReturnValue;             // 0x0108(0x0028)()
	class FString                                 CallFunc_GetSuitableCulture_ReturnValue;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSettingOption                         CallFunc_GetOptionByValue_ReturnValue;             // 0x0140(0x0028)()
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCurrentCulture_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue_1;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentCulture_ReturnValue_2;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstanceBP_C*             K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP_1; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetFloatCVar_ReturnValue_2;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_3;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Value)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetCurrentIndex_ReturnValue;              // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Value;                          // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_2;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchHUD*                          K2Node_DynamicCast_AsTime_Watch_HUD_1;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate_6; // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsChecked)>              K2Node_CreateDelegate_OutputDelegate_7;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsChecked;                     // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATimeWatchCharacter*>            CallFunc_GetAllClones_ReturnValue;                 // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	class ATimeWatchCharacter*                    CallFunc_Array_Get_Item;                           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTWCloneOverheadWidget*                 CallFunc_GetCloneOverHeadWidget_ReturnValue;       // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_4;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_5;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_6;               // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_7;               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_8;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_9;               // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_10;              // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatCVar_ReturnValue_11;              // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu");
static_assert(sizeof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu) == 0x0002B8, "Wrong size on WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, EntryPoint) == 0x000000, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue) == 0x000004, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP) == 0x000020, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_PostEventAtLocation_ReturnValue) == 0x00002C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_PostEventAtLocation_ReturnValue_1) == 0x000030, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_PostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_PostEventAtLocation_ReturnValue_2) == 0x000034, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_PostEventAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_PostEventAtLocation_ReturnValue_3) == 0x000048, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_PostEventAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_1) == 0x000068, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTWPlayer_Camera_Manager) == 0x000070, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTWPlayer_Camera_Manager' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_PostEventAtLocation_ReturnValue_4) == 0x00007C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_PostEventAtLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_bIsChecked_1) == 0x000080, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetHUD_ReturnValue) == 0x0000A0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTime_Watch_HUD) == 0x0000A8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTime_Watch_HUD' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetCurrentCulture_ReturnValue) == 0x0000B8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_SelectedItem_1) == 0x0000D8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_SelectionType_1) == 0x0000E8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000E9, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetOptionByLabel_ReturnValue) == 0x000108, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetOptionByLabel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetSuitableCulture_ReturnValue) == 0x000130, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetSuitableCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetOptionByValue_ReturnValue) == 0x000140, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetOptionByValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_NotEqual_StrStr_ReturnValue_1) == 0x000168, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_NotEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_SetCurrentCulture_ReturnValue) == 0x000180, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_SetCurrentCulture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetCurrentCulture_ReturnValue_1) == 0x000188, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetCurrentCulture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetCurrentCulture_ReturnValue_2) == 0x000198, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetCurrentCulture_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetGameInstance_ReturnValue_1) == 0x0001A8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP_1) == 0x0001B0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess_3) == 0x0001B8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001BC, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_2) == 0x0001CC, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_3) == 0x0001D0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001D4, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetCurrentIndex_ReturnValue) == 0x0001E4, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetCurrentIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_Value) == 0x0001E8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_NotEqual_StrStr_ReturnValue_2) == 0x0001F8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_NotEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x000200, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetHUD_ReturnValue_1) == 0x000208, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTime_Watch_HUD_1) == 0x000210, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTime_Watch_HUD_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess_4) == 0x000218, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x00021C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_SelectedItem) == 0x000230, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_SelectionType) == 0x000240, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_7) == 0x000244, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_CustomEvent_bIsChecked) == 0x000254, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_CustomEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetGameState_ReturnValue) == 0x000258, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000260, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, K2Node_DynamicCast_bSuccess_5) == 0x000268, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetAllClones_ReturnValue) == 0x000270, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetAllClones_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Array_Get_Item) == 0x000280, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Array_Length_ReturnValue) == 0x000288, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00028C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetCloneOverHeadWidget_ReturnValue) == 0x000290, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetCloneOverHeadWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_4) == 0x000298, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_5) == 0x00029C, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_6) == 0x0002A0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_7) == 0x0002A4, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_8) == 0x0002A8, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_9) == 0x0002AC, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_10) == 0x0002B0, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu, CallFunc_GetFloatCVar_ReturnValue_11) == 0x0002B4, "Member 'WC_OptionsMenu_C_ExecuteUbergraph_WC_OptionsMenu::CallFunc_GetFloatCVar_ReturnValue_11' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.OnPlayerNameVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct WC_OptionsMenu_C_OnPlayerNameVisibilityChange final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_OptionsMenu_C_OnPlayerNameVisibilityChange) == 0x000001, "Wrong alignment on WC_OptionsMenu_C_OnPlayerNameVisibilityChange");
static_assert(sizeof(WC_OptionsMenu_C_OnPlayerNameVisibilityChange) == 0x000001, "Wrong size on WC_OptionsMenu_C_OnPlayerNameVisibilityChange");
static_assert(offsetof(WC_OptionsMenu_C_OnPlayerNameVisibilityChange, bIsChecked) == 0x000000, "Member 'WC_OptionsMenu_C_OnPlayerNameVisibilityChange::bIsChecked' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.OnCrosshairColorSelectionChange
// 0x0018 (0x0018 - 0x0000)
struct WC_OptionsMenu_C_OnCrosshairColorSelectionChange final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_OptionsMenu_C_OnCrosshairColorSelectionChange) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_OnCrosshairColorSelectionChange");
static_assert(sizeof(WC_OptionsMenu_C_OnCrosshairColorSelectionChange) == 0x000018, "Wrong size on WC_OptionsMenu_C_OnCrosshairColorSelectionChange");
static_assert(offsetof(WC_OptionsMenu_C_OnCrosshairColorSelectionChange, SelectedItem) == 0x000000, "Member 'WC_OptionsMenu_C_OnCrosshairColorSelectionChange::SelectedItem' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_OnCrosshairColorSelectionChange, SelectionType) == 0x000010, "Member 'WC_OptionsMenu_C_OnCrosshairColorSelectionChange::SelectionType' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.OnWindowModeChanged
// 0x0010 (0x0010 - 0x0000)
struct WC_OptionsMenu_C_OnWindowModeChanged final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_OptionsMenu_C_OnWindowModeChanged) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_OnWindowModeChanged");
static_assert(sizeof(WC_OptionsMenu_C_OnWindowModeChanged) == 0x000010, "Wrong size on WC_OptionsMenu_C_OnWindowModeChanged");
static_assert(offsetof(WC_OptionsMenu_C_OnWindowModeChanged, Value) == 0x000000, "Member 'WC_OptionsMenu_C_OnWindowModeChanged::Value' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.OnLanguageSelectionChanged
// 0x0018 (0x0018 - 0x0000)
struct WC_OptionsMenu_C_OnLanguageSelectionChanged final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_OptionsMenu_C_OnLanguageSelectionChanged) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_OnLanguageSelectionChanged");
static_assert(sizeof(WC_OptionsMenu_C_OnLanguageSelectionChanged) == 0x000018, "Wrong size on WC_OptionsMenu_C_OnLanguageSelectionChanged");
static_assert(offsetof(WC_OptionsMenu_C_OnLanguageSelectionChanged, SelectedItem) == 0x000000, "Member 'WC_OptionsMenu_C_OnLanguageSelectionChanged::SelectedItem' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_OnLanguageSelectionChanged, SelectionType) == 0x000010, "Member 'WC_OptionsMenu_C_OnLanguageSelectionChanged::SelectionType' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.OnChatVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct WC_OptionsMenu_C_OnChatVisibilityChange final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_OptionsMenu_C_OnChatVisibilityChange) == 0x000001, "Wrong alignment on WC_OptionsMenu_C_OnChatVisibilityChange");
static_assert(sizeof(WC_OptionsMenu_C_OnChatVisibilityChange) == 0x000001, "Wrong size on WC_OptionsMenu_C_OnChatVisibilityChange");
static_assert(offsetof(WC_OptionsMenu_C_OnChatVisibilityChange, bIsChecked) == 0x000000, "Member 'WC_OptionsMenu_C_OnChatVisibilityChange::bIsChecked' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.FocusWidget
// 0x0018 (0x0018 - 0x0000)
struct WC_OptionsMenu_C_FocusWidget final
{
public:
	class UOverlay*                               Overlay;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               OverlayToFocus;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_OptionsMenu_C_FocusWidget) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_FocusWidget");
static_assert(sizeof(WC_OptionsMenu_C_FocusWidget) == 0x000018, "Wrong size on WC_OptionsMenu_C_FocusWidget");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, Overlay) == 0x000000, "Member 'WC_OptionsMenu_C_FocusWidget::Overlay' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, OverlayToFocus) == 0x000008, "Member 'WC_OptionsMenu_C_FocusWidget::OverlayToFocus' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WC_OptionsMenu_C_FocusWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'WC_OptionsMenu_C_FocusWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000012, "Member 'WC_OptionsMenu_C_FocusWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_FocusWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000013, "Member 'WC_OptionsMenu_C_FocusWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.SetWidgetVisibility
// 0x0010 (0x0010 - 0x0000)
struct WC_OptionsMenu_C_SetWidgetVisibility final
{
public:
	bool                                          Visibility_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           PanelSlot;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_OptionsMenu_C_SetWidgetVisibility) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_SetWidgetVisibility");
static_assert(sizeof(WC_OptionsMenu_C_SetWidgetVisibility) == 0x000010, "Wrong size on WC_OptionsMenu_C_SetWidgetVisibility");
static_assert(offsetof(WC_OptionsMenu_C_SetWidgetVisibility, Visibility_0) == 0x000000, "Member 'WC_OptionsMenu_C_SetWidgetVisibility::Visibility_0' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SetWidgetVisibility, PanelSlot) == 0x000008, "Member 'WC_OptionsMenu_C_SetWidgetVisibility::PanelSlot' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.SelectTab
// 0x0068 (0x0068 - 0x0000)
struct WC_OptionsMenu_C_SelectTab final
{
public:
	class UTextBlock*                             SelectedTextBox;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SelectedBackground;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_OptionsMenu_C_SelectTab) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_SelectTab");
static_assert(sizeof(WC_OptionsMenu_C_SelectTab) == 0x000068, "Wrong size on WC_OptionsMenu_C_SelectTab");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, SelectedTextBox) == 0x000000, "Member 'WC_OptionsMenu_C_SelectTab::SelectedTextBox' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, SelectedBackground) == 0x000008, "Member 'WC_OptionsMenu_C_SelectTab::SelectedBackground' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WC_OptionsMenu_C_SelectTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WC_OptionsMenu_C_SelectTab::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WC_OptionsMenu_C_SelectTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_SelectTab, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'WC_OptionsMenu_C_SelectTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WC_OptionsMenu.WC_OptionsMenu_C.ToggleOptionsOnExpoMode
// 0x0018 (0x0018 - 0x0000)
struct WC_OptionsMenu_C_ToggleOptionsOnExpoMode final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimeWatchGameInstance*                 K2Node_DynamicCast_AsTime_Watch_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetExpoGraphicOptionsLocked_ReturnValue;  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_OptionsMenu_C_ToggleOptionsOnExpoMode) == 0x000008, "Wrong alignment on WC_OptionsMenu_C_ToggleOptionsOnExpoMode");
static_assert(sizeof(WC_OptionsMenu_C_ToggleOptionsOnExpoMode) == 0x000018, "Wrong size on WC_OptionsMenu_C_ToggleOptionsOnExpoMode");
static_assert(offsetof(WC_OptionsMenu_C_ToggleOptionsOnExpoMode, CallFunc_GetGameInstance_ReturnValue) == 0x000000, "Member 'WC_OptionsMenu_C_ToggleOptionsOnExpoMode::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_OptionsMenu_C_ToggleOptionsOnExpoMode, K2Node_DynamicCast_AsTime_Watch_Game_Instance) == 0x000008, "Member 'WC_OptionsMenu_C_ToggleOptionsOnExpoMode::K2Node_DynamicCast_AsTime_Watch_Game_Instance' has a wrong offset!");
