#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_PlayerInfoDisplay

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_PlayerInfoDisplay.WC_PlayerInfoDisplay_C
// 0x0038 (0x02A8 - 0x0270)
class UWC_PlayerInfoDisplay_C final : public UWidgetContainerPlayerInfoDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeaponClipCHanged;                                 // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponPick;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           Energy;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Latency;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           QuantumJuice;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpellCost;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_PlayerInfoDisplay(int32 EntryPoint);
	void Construct();
	ESlateVisibility Get_Image_Latency_Visibility_0();
	float Get_Energy_Percent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_PlayerInfoDisplay_C">();
	}
	static class UWC_PlayerInfoDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_PlayerInfoDisplay_C>();
	}
};
static_assert(alignof(UWC_PlayerInfoDisplay_C) == 0x000008, "Wrong alignment on UWC_PlayerInfoDisplay_C");
static_assert(sizeof(UWC_PlayerInfoDisplay_C) == 0x0002A8, "Wrong size on UWC_PlayerInfoDisplay_C");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, UberGraphFrame) == 0x000270, "Member 'UWC_PlayerInfoDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, WeaponClipCHanged) == 0x000278, "Member 'UWC_PlayerInfoDisplay_C::WeaponClipCHanged' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, WeaponPick) == 0x000280, "Member 'UWC_PlayerInfoDisplay_C::WeaponPick' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, Energy) == 0x000288, "Member 'UWC_PlayerInfoDisplay_C::Energy' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, Image_Latency) == 0x000290, "Member 'UWC_PlayerInfoDisplay_C::Image_Latency' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, QuantumJuice) == 0x000298, "Member 'UWC_PlayerInfoDisplay_C::QuantumJuice' has a wrong offset!");
static_assert(offsetof(UWC_PlayerInfoDisplay_C, SpellCost) == 0x0002A0, "Member 'UWC_PlayerInfoDisplay_C::SpellCost' has a wrong offset!");

}

