#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_PlaybookInfoOverlay

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_PlaybookInfoOverlay.WC_PlaybookInfoOverlay_C
// 0x0018 (0x0278 - 0x0260)
class UWC_PlaybookInfoOverlay_C final : public UWCPlaybookInfoOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_161;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_PlaybookInfoOverlay(int32 EntryPoint);
	void EnableOverlay(bool NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_PlaybookInfoOverlay_C">();
	}
	static class UWC_PlaybookInfoOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_PlaybookInfoOverlay_C>();
	}
};
static_assert(alignof(UWC_PlaybookInfoOverlay_C) == 0x000008, "Wrong alignment on UWC_PlaybookInfoOverlay_C");
static_assert(sizeof(UWC_PlaybookInfoOverlay_C) == 0x000278, "Wrong size on UWC_PlaybookInfoOverlay_C");
static_assert(offsetof(UWC_PlaybookInfoOverlay_C, UberGraphFrame) == 0x000260, "Member 'UWC_PlaybookInfoOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_PlaybookInfoOverlay_C, CanvasPanel_0) == 0x000268, "Member 'UWC_PlaybookInfoOverlay_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWC_PlaybookInfoOverlay_C, Image_161) == 0x000270, "Member 'UWC_PlaybookInfoOverlay_C::Image_161' has a wrong offset!");

}

