#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_PlayerProfile

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AutoSettings_structs.hpp"


namespace SDK::Params
{

// Function WC_PlayerProfile.WC_PlayerProfile_C.ExecuteUbergraph_WC_PlayerProfile
// 0x0088 (0x0088 - 0x0000)
struct WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeWatchGameInstance*                 CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UTimeWatchGameInstanceBP_C*             K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ArePlayerTitlesEnabled_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FSettingOption                         CallFunc_GetOptionByLabel_ReturnValue;             // 0x0060(0x0028)()
};
static_assert(alignof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile) == 0x000008, "Wrong alignment on WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile");
static_assert(sizeof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile) == 0x000088, "Wrong size on WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, EntryPoint) == 0x000000, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP) == 0x000020, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::K2Node_DynamicCast_AsTime_Watch_Game_Instance_BP' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, CallFunc_ArePlayerTitlesEnabled_ReturnValue) == 0x000029, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::CallFunc_ArePlayerTitlesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, K2Node_CustomEvent_SelectedItem) == 0x000030, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, K2Node_CustomEvent_SelectionType) == 0x000040, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile, CallFunc_GetOptionByLabel_ReturnValue) == 0x000060, "Member 'WC_PlayerProfile_C_ExecuteUbergraph_WC_PlayerProfile::CallFunc_GetOptionByLabel_ReturnValue' has a wrong offset!");

// Function WC_PlayerProfile.WC_PlayerProfile_C.OnLeaderboardPeriodSelectionChanged
// 0x0018 (0x0018 - 0x0000)
struct WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged) == 0x000008, "Wrong alignment on WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged");
static_assert(sizeof(WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged) == 0x000018, "Wrong size on WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged");
static_assert(offsetof(WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged, SelectedItem) == 0x000000, "Member 'WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged::SelectedItem' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged, SelectionType) == 0x000010, "Member 'WC_PlayerProfile_C_OnLeaderboardPeriodSelectionChanged::SelectionType' has a wrong offset!");

// Function WC_PlayerProfile.WC_PlayerProfile_C.SelectTab
// 0x0068 (0x0068 - 0x0000)
struct WC_PlayerProfile_C_SelectTab final
{
public:
	class UTextBlock*                             SelectedTextBlock;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SelectedBackground;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
};
static_assert(alignof(WC_PlayerProfile_C_SelectTab) == 0x000008, "Wrong alignment on WC_PlayerProfile_C_SelectTab");
static_assert(sizeof(WC_PlayerProfile_C_SelectTab) == 0x000068, "Wrong size on WC_PlayerProfile_C_SelectTab");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, SelectedTextBlock) == 0x000000, "Member 'WC_PlayerProfile_C_SelectTab::SelectedTextBlock' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, SelectedBackground) == 0x000008, "Member 'WC_PlayerProfile_C_SelectTab::SelectedBackground' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WC_PlayerProfile_C_SelectTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WC_PlayerProfile_C_SelectTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WC_PlayerProfile_C_SelectTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WC_PlayerProfile_C_SelectTab, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'WC_PlayerProfile_C_SelectTab::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

