#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_RewardTrack

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_RewardTrack.WC_RewardTrack_C
// 0x0090 (0x0520 - 0x0490)
class UWC_RewardTrack_C final : public UWidgetContainerRewardTrack
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_RewardTrack;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_198;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_191;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_825;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ScrollTooltip;                               // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_0;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_3;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_5;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_6;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_7;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_8;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_9;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_10;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_11;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsItemWidget_C*                      NewsItemWidget_C_12;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_RemainingTime;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_RewardTrack(int32 EntryPoint);
	void UpdateRemainingTime(int32 RemainingMinutes);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_RewardTrack_C">();
	}
	static class UWC_RewardTrack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_RewardTrack_C>();
	}
};
static_assert(alignof(UWC_RewardTrack_C) == 0x000010, "Wrong alignment on UWC_RewardTrack_C");
static_assert(sizeof(UWC_RewardTrack_C) == 0x000520, "Wrong size on UWC_RewardTrack_C");
static_assert(offsetof(UWC_RewardTrack_C, UberGraphFrame) == 0x000490, "Member 'UWC_RewardTrack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, CanvasPanel_RewardTrack) == 0x000498, "Member 'UWC_RewardTrack_C::CanvasPanel_RewardTrack' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, HorizontalBox_198) == 0x0004A0, "Member 'UWC_RewardTrack_C::HorizontalBox_198' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, Image_191) == 0x0004A8, "Member 'UWC_RewardTrack_C::Image_191' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, Image_511) == 0x0004B0, "Member 'UWC_RewardTrack_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, Image_825) == 0x0004B8, "Member 'UWC_RewardTrack_C::Image_825' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, Image_ScrollTooltip) == 0x0004C0, "Member 'UWC_RewardTrack_C::Image_ScrollTooltip' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_0) == 0x0004C8, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_0' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_3) == 0x0004D0, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_3' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_5) == 0x0004D8, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_5' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_6) == 0x0004E0, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_6' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_7) == 0x0004E8, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_7' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_8) == 0x0004F0, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_8' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_9) == 0x0004F8, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_9' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_10) == 0x000500, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_10' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_11) == 0x000508, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_11' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, NewsItemWidget_C_12) == 0x000510, "Member 'UWC_RewardTrack_C::NewsItemWidget_C_12' has a wrong offset!");
static_assert(offsetof(UWC_RewardTrack_C, Text_RemainingTime) == 0x000518, "Member 'UWC_RewardTrack_C::Text_RemainingTime' has a wrong offset!");

}

