#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_ReplayControls

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_ReplayControls.WC_ReplayControls_C
// 0x0090 (0x02F0 - 0x0260)
class UWC_ReplayControls_C final : public UWidgetContainerReplayControl
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_138;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_326;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_486;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_944;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1186;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1314;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1373;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1485;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1839;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_1932;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_2001;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultActionLabel_C*                  DefaultActionLabel_2070;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultAxisLabel_Override_C*           DefaultAxisLabel_Override;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultAxisLabel_Override_C*           DefaultAxisLabel_Override_65;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtReplaySpeed;                                    // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_ReplayControls(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class FText Get_TxtReplaySpeed_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_ReplayControls_C">();
	}
	static class UWC_ReplayControls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_ReplayControls_C>();
	}
};
static_assert(alignof(UWC_ReplayControls_C) == 0x000008, "Wrong alignment on UWC_ReplayControls_C");
static_assert(sizeof(UWC_ReplayControls_C) == 0x0002F0, "Wrong size on UWC_ReplayControls_C");
static_assert(offsetof(UWC_ReplayControls_C, UberGraphFrame) == 0x000260, "Member 'UWC_ReplayControls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, Background) == 0x000268, "Member 'UWC_ReplayControls_C::Background' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel) == 0x000270, "Member 'UWC_ReplayControls_C::DefaultActionLabel' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_138) == 0x000278, "Member 'UWC_ReplayControls_C::DefaultActionLabel_138' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_326) == 0x000280, "Member 'UWC_ReplayControls_C::DefaultActionLabel_326' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_486) == 0x000288, "Member 'UWC_ReplayControls_C::DefaultActionLabel_486' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_944) == 0x000290, "Member 'UWC_ReplayControls_C::DefaultActionLabel_944' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1186) == 0x000298, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1186' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1314) == 0x0002A0, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1314' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1373) == 0x0002A8, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1373' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1485) == 0x0002B0, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1485' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1839) == 0x0002B8, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1839' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_1932) == 0x0002C0, "Member 'UWC_ReplayControls_C::DefaultActionLabel_1932' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_2001) == 0x0002C8, "Member 'UWC_ReplayControls_C::DefaultActionLabel_2001' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultActionLabel_2070) == 0x0002D0, "Member 'UWC_ReplayControls_C::DefaultActionLabel_2070' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultAxisLabel_Override) == 0x0002D8, "Member 'UWC_ReplayControls_C::DefaultAxisLabel_Override' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, DefaultAxisLabel_Override_65) == 0x0002E0, "Member 'UWC_ReplayControls_C::DefaultAxisLabel_Override_65' has a wrong offset!");
static_assert(offsetof(UWC_ReplayControls_C, TxtReplaySpeed) == 0x0002E8, "Member 'UWC_ReplayControls_C::TxtReplaySpeed' has a wrong offset!");

}

