#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_RewardTrack

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WC_RewardTrack.WC_RewardTrack_C.ExecuteUbergraph_WC_RewardTrack
// 0x0150 (0x0150 - 0x0000)
struct WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RemainingMinutes;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00C8(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0138(0x0018)()
};
static_assert(alignof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack) == 0x000008, "Wrong alignment on WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack");
static_assert(sizeof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack) == 0x000150, "Wrong size on WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, EntryPoint) == 0x000000, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_Event_RemainingMinutes) == 0x000004, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_Event_RemainingMinutes' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_Divide_IntInt_ReturnValue) == 0x000048, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeArray_Array) == 0x000050, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_Format_ReturnValue_1) == 0x0000C8, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000E1, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0000E4, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, K2Node_MakeArray_Array_2) == 0x000128, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack, CallFunc_Format_ReturnValue_2) == 0x000138, "Member 'WC_RewardTrack_C_ExecuteUbergraph_WC_RewardTrack::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WC_RewardTrack.WC_RewardTrack_C.UpdateRemainingTime
// 0x0004 (0x0004 - 0x0000)
struct WC_RewardTrack_C_UpdateRemainingTime final
{
public:
	int32                                         RemainingMinutes;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_RewardTrack_C_UpdateRemainingTime) == 0x000004, "Wrong alignment on WC_RewardTrack_C_UpdateRemainingTime");
static_assert(sizeof(WC_RewardTrack_C_UpdateRemainingTime) == 0x000004, "Wrong size on WC_RewardTrack_C_UpdateRemainingTime");
static_assert(offsetof(WC_RewardTrack_C_UpdateRemainingTime, RemainingMinutes) == 0x000000, "Member 'WC_RewardTrack_C_UpdateRemainingTime::RemainingMinutes' has a wrong offset!");

}

