#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_ReplayControls

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_ReplayControls.WC_ReplayControls_C.ExecuteUbergraph_WC_ReplayControls
// 0x0058 (0x0058 - 0x0000)
struct WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlayerKeyGroupStatic_ReturnValue;      // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls) == 0x000008, "Wrong alignment on WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls");
static_assert(sizeof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls) == 0x000058, "Wrong size on WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, EntryPoint) == 0x000000, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, K2Node_Event_MyGeometry) == 0x000004, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_GetPlayerKeyGroupStatic_ReturnValue) == 0x000048, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_GetPlayerKeyGroupStatic_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000050, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000051, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000052, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'WC_ReplayControls_C_ExecuteUbergraph_WC_ReplayControls::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WC_ReplayControls.WC_ReplayControls_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_ReplayControls_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_ReplayControls_C_Tick) == 0x000004, "Wrong alignment on WC_ReplayControls_C_Tick");
static_assert(sizeof(WC_ReplayControls_C_Tick) == 0x00003C, "Wrong size on WC_ReplayControls_C_Tick");
static_assert(offsetof(WC_ReplayControls_C_Tick, MyGeometry) == 0x000000, "Member 'WC_ReplayControls_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_ReplayControls_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_ReplayControls.WC_ReplayControls_C.Get_TxtReplaySpeed_Text_0
// 0x00B0 (0x00B0 - 0x0000)
struct WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReplayFluxPlayerControllerBP_C*        K2Node_DynamicCast_AsReplay_Flux_Player_Controller_BP; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0) == 0x000008, "Wrong alignment on WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0");
static_assert(sizeof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0) == 0x0000B0, "Wrong size on WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, ReturnValue) == 0x000000, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, Temp_bool_Variable) == 0x000018, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, K2Node_DynamicCast_AsReplay_Flux_Player_Controller_BP) == 0x000028, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::K2Node_DynamicCast_AsReplay_Flux_Player_Controller_BP' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Conv_FloatToString_ReturnValue) == 0x000038, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, K2Node_Select_Default) == 0x000078, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000088, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'WC_ReplayControls_C_Get_TxtReplaySpeed_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

