#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_RadialFeedback

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_RadialFeedback.WC_RadialFeedback_C
// 0x0018 (0x0270 - 0x0258)
class UWC_RadialFeedback_C final : public UWidgetContainerRadialFeedback
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CenteredPanel;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_RadialFeedback(int32 EntryPoint);
	void UpdateFeedback(class UWidget* HitWidget, float Progress, float Alpha, float Scale, float Rotation);
	void Construct();
	void Initialize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_RadialFeedback_C">();
	}
	static class UWC_RadialFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_RadialFeedback_C>();
	}
};
static_assert(alignof(UWC_RadialFeedback_C) == 0x000008, "Wrong alignment on UWC_RadialFeedback_C");
static_assert(sizeof(UWC_RadialFeedback_C) == 0x000270, "Wrong size on UWC_RadialFeedback_C");
static_assert(offsetof(UWC_RadialFeedback_C, UberGraphFrame) == 0x000258, "Member 'UWC_RadialFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_RadialFeedback_C, CenteredPanel) == 0x000260, "Member 'UWC_RadialFeedback_C::CenteredPanel' has a wrong offset!");
static_assert(offsetof(UWC_RadialFeedback_C, Radius) == 0x000268, "Member 'UWC_RadialFeedback_C::Radius' has a wrong offset!");

}

