#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_ScorePopup

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_ScorePopup.WC_ScorePopup_C
// 0x0070 (0x02D0 - 0x0260)
class UWC_ScorePopup_C final : public UWidgetContainerScorePopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_RedScoreForSpectator;                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_BlueScoreForSpectator;                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_EnemyScored;                                  // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_YouScored;                                    // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_PlayerCards;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 defeat_bg;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             enemyscores_text;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SpectatorBlueBG;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SpectatorRedBG;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SCORE_Text;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 victory_bg;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_ScorePopup(int32 EntryPoint);
	void PlayRedScoredAnimationForSpectator();
	void PlayBlueScoredAnimationForSpectator();
	void PlayEnemyScoredAnimation();
	void PlayYouScoredAnimation();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_ScorePopup_C">();
	}
	static class UWC_ScorePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_ScorePopup_C>();
	}
};
static_assert(alignof(UWC_ScorePopup_C) == 0x000008, "Wrong alignment on UWC_ScorePopup_C");
static_assert(sizeof(UWC_ScorePopup_C) == 0x0002D0, "Wrong size on UWC_ScorePopup_C");
static_assert(offsetof(UWC_ScorePopup_C, UberGraphFrame) == 0x000260, "Member 'UWC_ScorePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Anim_RedScoreForSpectator) == 0x000268, "Member 'UWC_ScorePopup_C::Anim_RedScoreForSpectator' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Anim_BlueScoreForSpectator) == 0x000270, "Member 'UWC_ScorePopup_C::Anim_BlueScoreForSpectator' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Anim_EnemyScored) == 0x000278, "Member 'UWC_ScorePopup_C::Anim_EnemyScored' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Anim_YouScored) == 0x000280, "Member 'UWC_ScorePopup_C::Anim_YouScored' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Canvas_PlayerCards) == 0x000288, "Member 'UWC_ScorePopup_C::Canvas_PlayerCards' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, defeat_bg) == 0x000290, "Member 'UWC_ScorePopup_C::defeat_bg' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, enemyscores_text) == 0x000298, "Member 'UWC_ScorePopup_C::enemyscores_text' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Image_SpectatorBlueBG) == 0x0002A0, "Member 'UWC_ScorePopup_C::Image_SpectatorBlueBG' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, Image_SpectatorRedBG) == 0x0002A8, "Member 'UWC_ScorePopup_C::Image_SpectatorRedBG' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, SCORE_Text) == 0x0002B0, "Member 'UWC_ScorePopup_C::SCORE_Text' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, TextBlock_1) == 0x0002B8, "Member 'UWC_ScorePopup_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, TextBlock_2) == 0x0002C0, "Member 'UWC_ScorePopup_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWC_ScorePopup_C, victory_bg) == 0x0002C8, "Member 'UWC_ScorePopup_C::victory_bg' has a wrong offset!");

}

