#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_Store

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WC_Store.WC_Store_C.ExecuteUbergraph_WC_Store
// 0x0030 (0x0030 - 0x0000)
struct WC_Store_C_ExecuteUbergraph_WC_Store final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARewardTrackPreviewActor_C*             K2Node_DynamicCast_AsReward_Track_Preview_Actor;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_Store_C_ExecuteUbergraph_WC_Store) == 0x000008, "Wrong alignment on WC_Store_C_ExecuteUbergraph_WC_Store");
static_assert(sizeof(WC_Store_C_ExecuteUbergraph_WC_Store) == 0x000030, "Wrong size on WC_Store_C_ExecuteUbergraph_WC_Store");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, EntryPoint) == 0x000000, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, CallFunc_Vector_Zero_ReturnValue) == 0x000004, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, CallFunc_PostSound_ReturnValue) == 0x000018, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::CallFunc_PostSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, K2Node_DynamicCast_AsReward_Track_Preview_Actor) == 0x000020, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::K2Node_DynamicCast_AsReward_Track_Preview_Actor' has a wrong offset!");
static_assert(offsetof(WC_Store_C_ExecuteUbergraph_WC_Store, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WC_Store_C_ExecuteUbergraph_WC_Store::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

