#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_Store

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_Store.WC_Store_C
// 0x00A8 (0x04C8 - 0x0420)
class UWC_Store_C final : public UWidgetContainerStore
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_LoadingSymbol;                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CoinIcon;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InfoIcon;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InfoIcon_1;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UModeSelectionSlotWidget_C*             QuarkStore_slot;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Sound_OnBuyItemSuccess;                            // 0x0470(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WC_Store(int32 EntryPoint);
	void BP_OnBuyItemSuccess();
	void CustomEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_Store_C">();
	}
	static class UWC_Store_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_Store_C>();
	}
};
static_assert(alignof(UWC_Store_C) == 0x000008, "Wrong alignment on UWC_Store_C");
static_assert(sizeof(UWC_Store_C) == 0x0004C8, "Wrong size on UWC_Store_C");
static_assert(offsetof(UWC_Store_C, UberGraphFrame) == 0x000420, "Member 'UWC_Store_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, CircularThrobber_LoadingSymbol) == 0x000428, "Member 'UWC_Store_C::CircularThrobber_LoadingSymbol' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image) == 0x000430, "Member 'UWC_Store_C::Image' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_1) == 0x000438, "Member 'UWC_Store_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_2) == 0x000440, "Member 'UWC_Store_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_511) == 0x000448, "Member 'UWC_Store_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_CoinIcon) == 0x000450, "Member 'UWC_Store_C::Image_CoinIcon' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_InfoIcon) == 0x000458, "Member 'UWC_Store_C::Image_InfoIcon' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Image_InfoIcon_1) == 0x000460, "Member 'UWC_Store_C::Image_InfoIcon_1' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, QuarkStore_slot) == 0x000468, "Member 'UWC_Store_C::QuarkStore_slot' has a wrong offset!");
static_assert(offsetof(UWC_Store_C, Sound_OnBuyItemSuccess) == 0x000470, "Member 'UWC_Store_C::Sound_OnBuyItemSuccess' has a wrong offset!");

}

