#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_TimeLoopInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WC_TimeLoopInfo.WC_TimeLoopInfo_C.ExecuteUbergraph_WC_TimeLoopInfo
// 0x0080 (0x0080 - 0x0000)
struct WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UsingQuantumTime_ReturnValue;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayActive_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo) == 0x000008, "Wrong alignment on WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo");
static_assert(sizeof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo) == 0x000080, "Wrong size on WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, EntryPoint) == 0x000000, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, K2Node_Event_MyGeometry) == 0x000008, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, K2Node_Event_InDeltaTime) == 0x000040, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, Temp_bool_Has_Been_Initd_Variable_1) == 0x000050, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000058, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_UsingQuantumTime_ReturnValue) == 0x000062, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_UsingQuantumTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000063, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_IsGameplayActive_ReturnValue) == 0x000064, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_IsGameplayActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000065, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x000068, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_Less_FloatFloat_ReturnValue) == 0x00006C, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_BooleanAND_ReturnValue) == 0x00006D, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WC_TimeLoopInfo_C_ExecuteUbergraph_WC_TimeLoopInfo::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WC_TimeLoopInfo.WC_TimeLoopInfo_C.Tick
// 0x003C (0x003C - 0x0000)
struct WC_TimeLoopInfo_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_TimeLoopInfo_C_Tick) == 0x000004, "Wrong alignment on WC_TimeLoopInfo_C_Tick");
static_assert(sizeof(WC_TimeLoopInfo_C_Tick) == 0x00003C, "Wrong size on WC_TimeLoopInfo_C_Tick");
static_assert(offsetof(WC_TimeLoopInfo_C_Tick, MyGeometry) == 0x000000, "Member 'WC_TimeLoopInfo_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_Tick, InDeltaTime) == 0x000038, "Member 'WC_TimeLoopInfo_C_Tick::InDeltaTime' has a wrong offset!");

// Function WC_TimeLoopInfo.WC_TimeLoopInfo_C.BP_GetScoringState
// 0x0040 (0x0040 - 0x0000)
struct WC_TimeLoopInfo_C_BP_GetScoringState final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AScoreAreaVolume*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class AScoreAreaVolume*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCharacterInside_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WC_TimeLoopInfo_C_BP_GetScoringState) == 0x000008, "Wrong alignment on WC_TimeLoopInfo_C_BP_GetScoringState");
static_assert(sizeof(WC_TimeLoopInfo_C_BP_GetScoringState) == 0x000040, "Wrong size on WC_TimeLoopInfo_C_BP_GetScoringState");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, ReturnValue) == 0x000000, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000018, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000019, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_Array_Get_Item) == 0x000030, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, CallFunc_HasCharacterInside_ReturnValue) == 0x000039, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::CallFunc_HasCharacterInside_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_TimeLoopInfo_C_BP_GetScoringState, K2Node_SwitchInteger_CmpSuccess) == 0x00003A, "Member 'WC_TimeLoopInfo_C_BP_GetScoringState::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

