#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_Training

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_Training.WC_Training_C
// 0x0048 (0x0608 - 0x05C0)
class UWC_Training_C final : public UWidgetContainerTraining
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_video;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_1;                               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_2;                               // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_3;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_4;                               // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_6;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialEntrySlot_C*                   TutorialEntrySlot_9;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_Training(int32 EntryPoint);
	void Construct();
	void OnShootingRange();
	void OnTimeloopDrill();
	void OnTutorial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_Training_C">();
	}
	static class UWC_Training_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_Training_C>();
	}
};
static_assert(alignof(UWC_Training_C) == 0x000008, "Wrong alignment on UWC_Training_C");
static_assert(sizeof(UWC_Training_C) == 0x000608, "Wrong size on UWC_Training_C");
static_assert(offsetof(UWC_Training_C, UberGraphFrame) == 0x0005C0, "Member 'UWC_Training_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, Image_video) == 0x0005C8, "Member 'UWC_Training_C::Image_video' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot) == 0x0005D0, "Member 'UWC_Training_C::TutorialEntrySlot' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_1) == 0x0005D8, "Member 'UWC_Training_C::TutorialEntrySlot_1' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_2) == 0x0005E0, "Member 'UWC_Training_C::TutorialEntrySlot_2' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_3) == 0x0005E8, "Member 'UWC_Training_C::TutorialEntrySlot_3' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_4) == 0x0005F0, "Member 'UWC_Training_C::TutorialEntrySlot_4' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_6) == 0x0005F8, "Member 'UWC_Training_C::TutorialEntrySlot_6' has a wrong offset!");
static_assert(offsetof(UWC_Training_C, TutorialEntrySlot_9) == 0x000600, "Member 'UWC_Training_C::TutorialEntrySlot_9' has a wrong offset!");

}

