#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_TimeLoopInfo

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_TimeLoopInfo.WC_TimeLoopInfo_C
// 0x0040 (0x0298 - 0x0258)
class UWC_TimeLoopInfo_C final : public UWidgetContainerTimeLoopInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ContestedPulse;                                    // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AllyAdvantagePulse;                                // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewLoop;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FinalLoop;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SecondLoop;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FirstLoop;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TimeDilated;                                       // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_TimeLoopInfo(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	uint8 BP_GetScoringState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_TimeLoopInfo_C">();
	}
	static class UWC_TimeLoopInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_TimeLoopInfo_C>();
	}
};
static_assert(alignof(UWC_TimeLoopInfo_C) == 0x000008, "Wrong alignment on UWC_TimeLoopInfo_C");
static_assert(sizeof(UWC_TimeLoopInfo_C) == 0x000298, "Wrong size on UWC_TimeLoopInfo_C");
static_assert(offsetof(UWC_TimeLoopInfo_C, UberGraphFrame) == 0x000258, "Member 'UWC_TimeLoopInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, ContestedPulse) == 0x000260, "Member 'UWC_TimeLoopInfo_C::ContestedPulse' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, AllyAdvantagePulse) == 0x000268, "Member 'UWC_TimeLoopInfo_C::AllyAdvantagePulse' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, NewLoop) == 0x000270, "Member 'UWC_TimeLoopInfo_C::NewLoop' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, FinalLoop) == 0x000278, "Member 'UWC_TimeLoopInfo_C::FinalLoop' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, SecondLoop) == 0x000280, "Member 'UWC_TimeLoopInfo_C::SecondLoop' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, FirstLoop) == 0x000288, "Member 'UWC_TimeLoopInfo_C::FirstLoop' has a wrong offset!");
static_assert(offsetof(UWC_TimeLoopInfo_C, TimeDilated) == 0x000290, "Member 'UWC_TimeLoopInfo_C::TimeDilated' has a wrong offset!");

}

