#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_VersusScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WC_VersusScreen.WC_VersusScreen_C.ExecuteUbergraph_WC_VersusScreen
// 0x0010 (0x0010 - 0x0000)
struct WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen) == 0x000008, "Wrong alignment on WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen");
static_assert(sizeof(WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen) == 0x000010, "Wrong size on WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen");
static_assert(offsetof(WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen, EntryPoint) == 0x000000, "Member 'WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WC_VersusScreen_C_ExecuteUbergraph_WC_VersusScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WC_VersusScreen.WC_VersusScreen_C.PlayerCharacterIntro
// 0x0028 (0x0028 - 0x0000)
struct WC_VersusScreen_C_PlayerCharacterIntro final
{
public:
	int32                                         PlayerPerTeam;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       WidgetAnimationRef;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_VersusScreen_C_PlayerCharacterIntro) == 0x000008, "Wrong alignment on WC_VersusScreen_C_PlayerCharacterIntro");
static_assert(sizeof(WC_VersusScreen_C_PlayerCharacterIntro) == 0x000028, "Wrong size on WC_VersusScreen_C_PlayerCharacterIntro");
static_assert(offsetof(WC_VersusScreen_C_PlayerCharacterIntro, PlayerPerTeam) == 0x000000, "Member 'WC_VersusScreen_C_PlayerCharacterIntro::PlayerPerTeam' has a wrong offset!");
static_assert(offsetof(WC_VersusScreen_C_PlayerCharacterIntro, WidgetAnimationRef) == 0x000008, "Member 'WC_VersusScreen_C_PlayerCharacterIntro::WidgetAnimationRef' has a wrong offset!");
static_assert(offsetof(WC_VersusScreen_C_PlayerCharacterIntro, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WC_VersusScreen_C_PlayerCharacterIntro::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WC_VersusScreen_C_PlayerCharacterIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WC_VersusScreen_C_PlayerCharacterIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_VersusScreen_C_PlayerCharacterIntro, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WC_VersusScreen_C_PlayerCharacterIntro::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

