#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_VersusScreen

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_VersusScreen.WC_VersusScreen_C
// 0x0058 (0x0350 - 0x02F8)
class UWC_VersusScreen_C final : public UWidgetContainerVersusScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Vs_INTRO_Characters_2;                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Vs_INTRO_Characters;                               // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VS_INTRO_arrows;                                   // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Blue_arrow;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Blue_gradient;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1381;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_glow;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Orange_arrow;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Orange_gradient;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerCardWidget_C*                    PlayerCardWidget_71;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WC_VersusScreen(int32 EntryPoint);
	void PlayMatchIntro();
	void OnPlayerCardTrigger();
	void PlayerCharacterIntro(int32 PlayerPerTeam, class UWidgetAnimation** WidgetAnimationRef);
	void SequenceEvent__ENTRYPOINTWC_VersusScreen_0();
	void SequenceEvent__ENTRYPOINTWC_VersusScreen_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_VersusScreen_C">();
	}
	static class UWC_VersusScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_VersusScreen_C>();
	}
};
static_assert(alignof(UWC_VersusScreen_C) == 0x000008, "Wrong alignment on UWC_VersusScreen_C");
static_assert(sizeof(UWC_VersusScreen_C) == 0x000350, "Wrong size on UWC_VersusScreen_C");
static_assert(offsetof(UWC_VersusScreen_C, UberGraphFrame) == 0x0002F8, "Member 'UWC_VersusScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Vs_INTRO_Characters_2) == 0x000300, "Member 'UWC_VersusScreen_C::Vs_INTRO_Characters_2' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Vs_INTRO_Characters) == 0x000308, "Member 'UWC_VersusScreen_C::Vs_INTRO_Characters' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, VS_INTRO_arrows) == 0x000310, "Member 'UWC_VersusScreen_C::VS_INTRO_arrows' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Blue_arrow) == 0x000318, "Member 'UWC_VersusScreen_C::Blue_arrow' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Blue_gradient) == 0x000320, "Member 'UWC_VersusScreen_C::Blue_gradient' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Image_1381) == 0x000328, "Member 'UWC_VersusScreen_C::Image_1381' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Line_glow) == 0x000330, "Member 'UWC_VersusScreen_C::Line_glow' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Orange_arrow) == 0x000338, "Member 'UWC_VersusScreen_C::Orange_arrow' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, Orange_gradient) == 0x000340, "Member 'UWC_VersusScreen_C::Orange_gradient' has a wrong offset!");
static_assert(offsetof(UWC_VersusScreen_C, PlayerCardWidget_71) == 0x000348, "Member 'UWC_VersusScreen_C::PlayerCardWidget_71' has a wrong offset!");

}

