#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_WeaponCustomization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WC_WeaponCustomization.WC_WeaponCustomization_C.ExecuteUbergraph_WC_WeaponCustomization
// 0x0030 (0x0030 - 0x0000)
struct WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponSkinPreviewActor_C*              K2Node_DynamicCast_AsWeapon_Skin_Preview_Actor;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNGDAkComponent*                        CallFunc_PostSound_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization) == 0x000008, "Wrong alignment on WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization");
static_assert(sizeof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization) == 0x000030, "Wrong size on WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, EntryPoint) == 0x000000, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, K2Node_DynamicCast_AsWeapon_Skin_Preview_Actor) == 0x000010, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::K2Node_DynamicCast_AsWeapon_Skin_Preview_Actor' has a wrong offset!");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, CallFunc_Vector_Zero_ReturnValue) == 0x00001C, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization, CallFunc_PostSound_ReturnValue) == 0x000028, "Member 'WC_WeaponCustomization_C_ExecuteUbergraph_WC_WeaponCustomization::CallFunc_PostSound_ReturnValue' has a wrong offset!");

}

