#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WC_WeaponCustomization

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"
#include "UnrealProject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WC_WeaponCustomization.WC_WeaponCustomization_C
// 0x0068 (0x0408 - 0x03A0)
class UWC_WeaponCustomization_C final : public UWidgetContainerWeaponCustomization
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        WidgetSwitcher_TabSwitcher;                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FNGDSoundConfig                        Sound_OnBuyItemSuccess;                            // 0x03B0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WC_WeaponCustomization(int32 EntryPoint);
	void BP_OnBuyItemSuccess();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WC_WeaponCustomization_C">();
	}
	static class UWC_WeaponCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWC_WeaponCustomization_C>();
	}
};
static_assert(alignof(UWC_WeaponCustomization_C) == 0x000008, "Wrong alignment on UWC_WeaponCustomization_C");
static_assert(sizeof(UWC_WeaponCustomization_C) == 0x000408, "Wrong size on UWC_WeaponCustomization_C");
static_assert(offsetof(UWC_WeaponCustomization_C, UberGraphFrame) == 0x0003A0, "Member 'UWC_WeaponCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWC_WeaponCustomization_C, WidgetSwitcher_TabSwitcher) == 0x0003A8, "Member 'UWC_WeaponCustomization_C::WidgetSwitcher_TabSwitcher' has a wrong offset!");
static_assert(offsetof(UWC_WeaponCustomization_C, Sound_OnBuyItemSuccess) == 0x0003B0, "Member 'UWC_WeaponCustomization_C::Sound_OnBuyItemSuccess' has a wrong offset!");

}

