#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_SMG

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "TimeWatch_structs.hpp"


namespace SDK::Params
{

// Function Weapon_SMG.Weapon_SMG_C.ExecuteUbergraph_Weapon_SMG
// 0x0038 (0x0038 - 0x0000)
struct Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFluxCapacitorStates OldState, EFluxCapacitorStates NewState)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          K2Node_CustomEvent_OldState;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          K2Node_CustomEvent_NewState;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATimeWatchGameState*                    K2Node_DynamicCast_AsTime_Watch_Game_State;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG) == 0x000008, "Wrong alignment on Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG");
static_assert(sizeof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG) == 0x000038, "Wrong size on Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, EntryPoint) == 0x000000, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, K2Node_CustomEvent_OldState) == 0x000020, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::K2Node_CustomEvent_OldState' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, K2Node_CustomEvent_NewState) == 0x000021, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, K2Node_DynamicCast_AsTime_Watch_Game_State) == 0x000028, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::K2Node_DynamicCast_AsTime_Watch_Game_State' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Weapon_SMG_C_ExecuteUbergraph_Weapon_SMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Weapon_SMG.Weapon_SMG_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct Weapon_SMG_C_OnStateChanged final
{
public:
	EFluxCapacitorStates                          OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFluxCapacitorStates                          NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_SMG_C_OnStateChanged) == 0x000001, "Wrong alignment on Weapon_SMG_C_OnStateChanged");
static_assert(sizeof(Weapon_SMG_C_OnStateChanged) == 0x000002, "Wrong size on Weapon_SMG_C_OnStateChanged");
static_assert(offsetof(Weapon_SMG_C_OnStateChanged, OldState) == 0x000000, "Member 'Weapon_SMG_C_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_OnStateChanged, NewState) == 0x000001, "Member 'Weapon_SMG_C_OnStateChanged::NewState' has a wrong offset!");

// Function Weapon_SMG.Weapon_SMG_C.FakeTimeDilationSound
// 0x0058 (0x0058 - 0x0000)
struct Weapon_SMG_C_FakeTimeDilationSound final
{
public:
	EFluxCapacitorStates                          GameState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_SMG_C_FakeTimeDilationSound) == 0x000008, "Wrong alignment on Weapon_SMG_C_FakeTimeDilationSound");
static_assert(sizeof(Weapon_SMG_C_FakeTimeDilationSound) == 0x000058, "Wrong size on Weapon_SMG_C_FakeTimeDilationSound");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, GameState) == 0x000000, "Member 'Weapon_SMG_C_FakeTimeDilationSound::GameState' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, Temp_struct_Variable) == 0x000008, "Member 'Weapon_SMG_C_FakeTimeDilationSound::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'Weapon_SMG_C_FakeTimeDilationSound::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, Temp_delegate_Variable) == 0x00001C, "Member 'Weapon_SMG_C_FakeTimeDilationSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, Temp_struct_Variable_1) == 0x000030, "Member 'Weapon_SMG_C_FakeTimeDilationSound::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, Temp_delegate_Variable_1) == 0x000040, "Member 'Weapon_SMG_C_FakeTimeDilationSound::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, CallFunc_PostAkEvent_ReturnValue) == 0x000050, "Member 'Weapon_SMG_C_FakeTimeDilationSound::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_SMG_C_FakeTimeDilationSound, CallFunc_PostAkEvent_ReturnValue_1) == 0x000054, "Member 'Weapon_SMG_C_FakeTimeDilationSound::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

