#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_PartyMember

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_PartyMember.Widget_PartyMember_C
// 0x0020 (0x02E0 - 0x02C0)
class UWidget_PartyMember_C final : public UPartyMemberItemWidget
{
public:
	class UCircularThrobber*                      CircularThrobber_106;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_200;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_480;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_3;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Widget_PartyMember_C">();
	}
	static class UWidget_PartyMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_PartyMember_C>();
	}
};
static_assert(alignof(UWidget_PartyMember_C) == 0x000008, "Wrong alignment on UWidget_PartyMember_C");
static_assert(sizeof(UWidget_PartyMember_C) == 0x0002E0, "Wrong size on UWidget_PartyMember_C");
static_assert(offsetof(UWidget_PartyMember_C, CircularThrobber_106) == 0x0002C0, "Member 'UWidget_PartyMember_C::CircularThrobber_106' has a wrong offset!");
static_assert(offsetof(UWidget_PartyMember_C, Image_200) == 0x0002C8, "Member 'UWidget_PartyMember_C::Image_200' has a wrong offset!");
static_assert(offsetof(UWidget_PartyMember_C, Image_480) == 0x0002D0, "Member 'UWidget_PartyMember_C::Image_480' has a wrong offset!");
static_assert(offsetof(UWidget_PartyMember_C, RetainerBox_3) == 0x0002D8, "Member 'UWidget_PartyMember_C::RetainerBox_3' has a wrong offset!");

}

