#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_LoadAnimation

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_LoadAnimation.Widget_LoadAnimation_C
// 0x0020 (0x0250 - 0x0230)
class UWidget_LoadAnimation_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Costados;                                          // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_371;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_498;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_499;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Widget_LoadAnimation_C">();
	}
	static class UWidget_LoadAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_LoadAnimation_C>();
	}
};
static_assert(alignof(UWidget_LoadAnimation_C) == 0x000008, "Wrong alignment on UWidget_LoadAnimation_C");
static_assert(sizeof(UWidget_LoadAnimation_C) == 0x000250, "Wrong size on UWidget_LoadAnimation_C");
static_assert(offsetof(UWidget_LoadAnimation_C, Costados) == 0x000230, "Member 'UWidget_LoadAnimation_C::Costados' has a wrong offset!");
static_assert(offsetof(UWidget_LoadAnimation_C, Image_371) == 0x000238, "Member 'UWidget_LoadAnimation_C::Image_371' has a wrong offset!");
static_assert(offsetof(UWidget_LoadAnimation_C, Image_498) == 0x000240, "Member 'UWidget_LoadAnimation_C::Image_498' has a wrong offset!");
static_assert(offsetof(UWidget_LoadAnimation_C, Image_499) == 0x000248, "Member 'UWidget_LoadAnimation_C::Image_499' has a wrong offset!");

}

