#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_FriendsList

#include "Basic.hpp"


namespace SDK::Params
{

// Function Widget_FriendsList.Widget_FriendsList_C.ExecuteUbergraph_Widget_FriendsList
// 0x0044 (0x0044 - 0x0000)
struct Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList) == 0x000004, "Wrong alignment on Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList");
static_assert(sizeof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList) == 0x000044, "Wrong size on Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList");
static_assert(offsetof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList, EntryPoint) == 0x000000, "Member 'Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'Widget_FriendsList_C_ExecuteUbergraph_Widget_FriendsList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function Widget_FriendsList.Widget_FriendsList_C.ToggleVisibility
// 0x0018 (0x0018 - 0x0000)
struct Widget_FriendsList_C_ToggleVisibility final
{
public:
	bool                                          VisibilityState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Widget_FriendsList_C_ToggleVisibility) == 0x000008, "Wrong alignment on Widget_FriendsList_C_ToggleVisibility");
static_assert(sizeof(Widget_FriendsList_C_ToggleVisibility) == 0x000018, "Wrong size on Widget_FriendsList_C_ToggleVisibility");
static_assert(offsetof(Widget_FriendsList_C_ToggleVisibility, VisibilityState) == 0x000000, "Member 'Widget_FriendsList_C_ToggleVisibility::VisibilityState' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ToggleVisibility, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Widget_FriendsList_C_ToggleVisibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Widget_FriendsList_C_ToggleVisibility, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'Widget_FriendsList_C_ToggleVisibility::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

