#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_FriendsList

#include "Basic.hpp"

#include "TimeWatch_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_FriendsList.Widget_FriendsList_C
// 0x0038 (0x0340 - 0x0308)
class UWidget_FriendsList_C final : public UFriendsListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CloseAnim;                                         // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close1;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStandardButton_C*                      Button_Close2;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Friends_gradient;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Widget_FriendsList(int32 EntryPoint);
	void OnButtonClose2_Unhovered();
	void OnButtonClose2_Hovered();
	void OnButtonClose2_Clicked();
	void BndEvt__Button_Close1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ToggleVisibility(bool VisibilityState);
	void OnCloseAnimFinish();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Widget_FriendsList_C">();
	}
	static class UWidget_FriendsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_FriendsList_C>();
	}
};
static_assert(alignof(UWidget_FriendsList_C) == 0x000008, "Wrong alignment on UWidget_FriendsList_C");
static_assert(sizeof(UWidget_FriendsList_C) == 0x000340, "Wrong size on UWidget_FriendsList_C");
static_assert(offsetof(UWidget_FriendsList_C, UberGraphFrame) == 0x000308, "Member 'UWidget_FriendsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, CloseAnim) == 0x000310, "Member 'UWidget_FriendsList_C::CloseAnim' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, OpenAnim) == 0x000318, "Member 'UWidget_FriendsList_C::OpenAnim' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, Background) == 0x000320, "Member 'UWidget_FriendsList_C::Background' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, Button_Close1) == 0x000328, "Member 'UWidget_FriendsList_C::Button_Close1' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, Button_Close2) == 0x000330, "Member 'UWidget_FriendsList_C::Button_Close2' has a wrong offset!");
static_assert(offsetof(UWidget_FriendsList_C, Friends_gradient) == 0x000338, "Member 'UWidget_FriendsList_C::Friends_gradient' has a wrong offset!");

}

