#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_FriendsListItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function Widget_FriendsListItem.Widget_FriendsListItem_C.ExecuteUbergraph_Widget_FriendsListItem
// 0x0024 (0x0024 - 0x0000)
struct Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem) == 0x000004, "Wrong alignment on Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem");
static_assert(sizeof(Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem) == 0x000024, "Wrong size on Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem");
static_assert(offsetof(Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem, EntryPoint) == 0x000000, "Member 'Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Widget_FriendsListItem_C_ExecuteUbergraph_Widget_FriendsListItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

